[
    {
        "url": "https://digitalterminal.in/startup/aws-selects-seven-indian-startups-for-global-generative-ai-accelerator-program",
        "content": "Amazon Web Services announced that seven generative AI startups from India have been selected for the AWS Global Generative AI Accelerator program. The selected Indian startups— , , , , , and , are among the 80 companies selected by AWS worldwide for their innovative use of AI and their global growth ambitions. The Indian cohort also represents the highest number of startups selected from a country in the Asia-Pacific region for the AWS Global Generative AI Accelerator program. The selected startups will also be invited to AWS’s premier annual event, re:Invent, in Las Vegas, where they will showcase their solutions on a global stage. As part of AWS’s US$230 million commitment to accelerate the creation of applications worldwide, the AWS Generative AI Accelerator program provides startups, especially early-stage companies, with AWS credits, mentorship, and education to further their use of AI and ML technologies. Selected startups will gain access to AWS compute, storage, and database technologies, as well as AWS Trainium and AWS Inferentia2, energy-efficient AI chips that offer high performance at the lowest cost. The credits can also be used on Amazon SageMaker, a fully managed service that helps companies build and train their own foundation models , as well as to access models and tools to easily and securely build generative AI applications through Amazon Bedrock. The 10-week program matches participants with both business and technical mentors based on their industry, and chosen startups will receive up to US$1 million each in AWS credits to help them build, train, test, and launch their generative AI solutions. Participants will also have access to technology and technical sessions from program presenting partner NVIDIA, a pioneer in accelerated computing. “We are thrilled to announce the seven Indian startups that have been selected for the AWS global generative AI accelerator program. The Indian cohort represents the highest number of startups selected for the accelerator in the Asia-Pacific and Japan region. The selected startups are at the forefront of tapping into the transformative potential of generative AI to build innovative solutions,” said . \"At AWS, our $230 million commitment and global expansion of the generative AI accelerator reflects our continued focus on supporting startups to develop, build and scale their unique ideas using generative AI. We are excited to witness the pioneering advancements that the selected startups will bring to solve complex challenges in India and worldwide.\" In India, AWS continues to support generative AI startups through initiatives such as a collaborative pop-up space recently hosted in Bangalore to promote innovation in AI. It offered visitors a unique platform to gain insights and explore real-world applications of generative AI across industries. According to PitchBook Data, Inc, 1,813 AI and ML companies have raised funding in India with over US$82 billion in investments to date in 2024. However, only 35% of generative AI companies globally have offices in locations outside their headquarter country, revealing that more can be done to support startups realize their growth ambitions. “Asia-Pacific-based generative AI companies have raised over $2.5 billion in 2024, more than the prior three years combined,” said , Senior Analyst, Emerging Technology Research, PitchBook. “Developers and startups are seizing the opportunity to train custom models based on unique cultural and linguistic data. Additionally, leading AI researchers are working on a diversity of transformer models in multimodal domains including 3D images, interactive media, and synthetic voice. The future of AI applications will rely on specialized model architectures and startups will need world-class cloud infrastructure to fulfill their vision.” Here is the list of Indian startups selected for AWS Global Generative AI Accelerator program. Click here to see the complete list of 80 startups selected worldwide for the accelerator program. Convrse develops an AI-based tool to optimize complex 3D objects or scenes and make them web or real-time ready. House of Models leverages LLM and Diffuser models to generate digital content for brands and businesses, including images, videos, and product descriptions. | Neural Garage uses generative AI to sync actors' lips with dubbed audio in film, streaming, advertising, and broadcasting, offering seamless viewing without compromising the cinematic feel. | Orbo.ai uses generative AI to provide hyper-personalization and contextual search solutions for the beauty and personal care industries. | Phot.ai is a comprehensive AI-powered platform that simplifies photo editing and graphic design through a wide range of tools designed to help e-commerce sellers optimize their workflows. | Unscript AI uses generative AI to create studio-quality videos with real or virtual actors, without the cost or time involved with physical shooting. Zocket simplifies digital advertising using generative AI for ad creation, targeting, and analytics, making it easy for businesses of all sizes to manage and optimize campaigns 👉",
        "title": "AWS Selects Seven Indian Startups for Global Generative AI Accelerator Program",
        "date/time": "14 Sep 2024, 12:30 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/adobe-launches-workfront-planning-to-unify-marketing-campaigns-and-accelerate-execution",
        "content": "Adobe announced the general availability of Adobe Workfront Planning. Part of Adobe Workfront, an industry-leading enterprise work management application, this new offering connects fragmented workflows and data across marketing teams, with actionable insights that allow brands to execute campaigns with greater speed. Marketers have been under increasing pressure to deliver highly personalized customer experiences, without any material increase in resources. Workfront Planning addresses this by defining and creating the “metadata” of work, providing full visibility into day-to-day marketing operations. This effectively creates a “marketing system of record”, a practice that has allowed other functions such as sales or finance to power planning and execution with data intelligence. Instead of manually gathering details across teams, Workfront Planning allows marketers to quickly answer questions such as “How many campaigns are we running this year?” or “Which tactics are most frequently used in our campaigns?”. Users have these actionable insights right at their fingertips, surfaced through both curated visualizations and a generative AI-powered conversational interface. This can dramatically shorten the time it takes to plan and launch new campaigns, removing the labour-intensive work of aligning teams on timing and objectives. Users can also accelerate time-to-market by leveraging generative AI to summarize information, keep marketing records up-to-date or quickly set up new campaigns. “The daily work of the modern marketer has become increasingly complex, as different teams charge forward on individual campaigns without much visibility into the efforts of their colleagues,” . “The net result is fragmented marketing operations where too much time is spent trying to align programs and stakeholders, a problem Workfront Planning solves by providing a centralized solution to plan campaigns, deliver marketing briefs and orchestrate work across teams.” : The marketing calendar in Workfront Planning visualizes day-to-day marketing work in an easy-to-digest format. For instance, a timeline view displays all active campaigns in a chronological format that is customizable for any team or stakeholder. A user can automatically view campaigns targeting a certain audience or for a specific objective . A spreadsheet view provides a deeper look into each campaign, providing end-to-end visibility on key messages, individual contributors, project status and more. When marketers are ready to create a new campaign, generative AI-powered capabilities will soon enable users to take action on previously static plans. Marketers will be able to simply upload existing assets to create campaign records and generate a marketing brief. This curated view will include everything from marketing tactics and objectives to relevant assets and timelines. The conversational interface in Workfront Planning, powered by generative AI, also allows users to query details across campaigns, helping answer pressing questions that come up during planning stages. : Effective planning hinges on marketing records that are accurate and up-to-date. These records can include details such as target audience and region, tactics, relevant business unit and more—also known as the “metadata” of marketing. With the generative-AI powered conversational interface, users can automatically create or update records as plans evolve. Marketers simply upload an asset, such as a Word document with the latest campaign details, and the record is automatically updated. Records can then be connected into a marketing graph, which visualizes the connections between teams and workflows. This produces additional insights to drive alignment and shortens the time it takes to get campaigns into market. Global brands from Deloitte and IPG Health to NASCAR have used Workfront Planning to boost productivity and meet the rising demand for highly personalized marketing campaigns. The new offering is also having an impact on the Adobe Global Marketing Organization, by enabling teams to develop coordinated plans and gain full visibility into marketing activities. 👉",
        "title": "Adobe Launches Workfront Planning to Unify Marketing Campaigns and Accelerate Execution",
        "date/time": "30 Aug 2024, 11:08 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/adobe-rolls-out-color-management-updates-in-premiere-pro-beta",
        "content": "Adobe announced significant updates to Adobe Premiere Pro , featuring a new color management system and performance improvements, directly addressing top community requests to streamline video editing workflows. These enhancements help editors work faster and more efficiently to meet the increasing demand for both short and long-form content. Key Updates in Premiere Pro : Color Management The all-new Premiere color management combines all of this technology in a way that makes it easier to work with raw and log formats natively in Premiere Pro, so you always get a great starting point — you’ll see great-looking footage as soon as clips are dropped into the timeline — without having to spend time adding LUTs. This automatic system normalizes raw and log media while taking advantage of all that data in the color pipeline for better control and beautiful images. An entirely new color management system that automatically transforms RAW and log footage from nearly every camera into great-looking SDR and HDR, so users can spend less time managing LUTs and start editing right away. A new wide gamut working color space that’s vastly larger than Premiere’s HD Rec.709 working space in which all image processing operations are performed. This new wide gamut color space leverages Hollywood’s industry standard ACEScct with high-fidelity tone mapping that provides the kind of color and fidelity results that were previously impossible with Premiere Pro. Six simple “set-it-and-forget-it” presets in Sequence Settings and Lumetri color settings let users work in traditional Rec.709 for legacy projects or the new wide gamut color ACEScct with ease. Most-used effects, like Lumetri, are now color space aware with smoother and more flexible control for refining skin tones, balance, and creative looks when working in a wide-gamut preset. Consistent color and brightness when using Dynamic Link to send clips to and from Adobe After Effects for motion design and compositing Adobe is also introducing a new Properties panel that makes Premiere Pro easier to learn for beginners and makes video editing even faster for experienced professionals. With the Properties panel, editors can do things they’ve never been able to do before in Premiere Pro, like crop video directly from the Program monitor, or highlight and adjust the properties of multiple clips or graphics at the same time. Consolidating the most frequently used tools in a single panel, along with the ability to directly manipulate images using on-screen controls, and the ability to batch process multiple clips at a time make this a game changer for anyone editing in Premiere Pro. It makes it easier for new users to learn the app, and more efficient for existing power users to work quickly. Adobe has been working hard at making Premiere Pro faster and more reliable for every job. With even more hardware acceleration, you’ll have faster playback for codecs like AVC and HEVC. ProRes exports are now up to 3x faster so editors can deliver cuts to clients faster and get home earlier. Adobe also added format support for even more Canon, Sony, and RED cameras so users can import native files and start editing immediately. With two dark modes, a light mode, and high-contrast accessibility mode, editors can customize the look and feel of Premiere Pro. Users also get cleaner fonts and typography for better legibility and consistency with other Adobe Creative Cloud apps. That means less time spent re-learning how to use tools in different apps and more time creating. 👉",
        "title": "Adobe Rolls Out Color Management Updates in Premiere Pro (beta)",
        "date/time": "12 Sep 2024, 6:31 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/oracle-introduces-50-role-based-ai-agents-to-revolutionize-productivity-across-fusion-cloud-applications",
        "content": "Oracle announced 50+ role-based AI agents within the Oracle Fusion Cloud Applications Suite that will help successfully execute frequent, repetitive tasks and allow employees and managers to focus their time on more strategic tasks and initiatives. Powered by the latest innovations in generative AI, the new agents help employees and managers complete their work more efficiently by fully automating end-to-end business processes and delivering personalized insights, content, and recommendations in the context of specific business processes and in support of specialized user roles. The new AI agents enable customers to reimagine how work is done and help achieve new levels of productivity across finance, supply chain, HR, sales, marketing, and service. “The latest Oracle Fusion Applications updates showcase the power of a single integrated suite with AI embedded in end-to-end workflows enabling customers to gain more value from their data,” said . “The new AI agents have the potential to completely change the way we work and do business. By enabling organizations to engage with business data in Oracle Fusion Applications in new and exciting ways, we can help our customers achieve new levels of productivity and unlock enormous business growth potential.” The new AI agents in Oracle Fusion Applications can seamlessly support employees and managers by providing data-driven guidance, making personalized recommendations, and completing tasks on their behalf. Shift scheduling assistant: Helps organizations create, manage, and optimize employee shift schedules, while accommodating individual employee preferences and helping to address compliance regulations. For example, the agent can assist employees responsible for scheduling in understanding the policies related to an overscheduled shift and surface regulatory implications to consider. Employee hiring advisor: Helps organizations source candidates with optimized campaigns, and assists hiring managers and recruiters in creating requisitions and offers reducing time to hire. For example, the agent can assist in completing formal requests for creating new positions, filling existing roles, and developing job offers that align with company policies. Benefits analyst: Helps organizations streamline access to employee benefits and enables employees to better understand and optimize their benefit packages, based on their individual needs. For example, the agent can help provide clarity on what is included in different benefits packages and even compare options to improve understanding on important benefit decisions. Customer sales representative guide: Helps organizations enhance the customer experience by delivering personalized and contextual insights and recommendations for handling order queries. For example, the agent can provide insight into how delays or defects are handled under the organization’s customer service policies, as well as recommendations for notifying the customer of any related impacts to their order. Maintenance troubleshooting advisor: Helps organizations accelerate maintenance and expediate repairs by delivering personalized and contextual insights and recommendations for asset maintenance and repairs. For example, the agent can provide insight from equipment maintenance manuals around key troubleshooting topics, such as error codes, share possible causes and provide troubleshooting guidance. Document IO agent: Helps organizations automate and simplify onboarding of complex integrations for third parties such as suppliers, customers, banks, government authorities, and logistics providers to increase efficiency and improve capture and generation of documents across all transactions, electronic channels, document standards, formats, and languages. For example, the agent can ingest images, or formatted documents such as PDFs, or electronic documents in different languages, standardize and map all attributes and convert these documents into requisitions, or invoices, or payment instructions ready for human review and approval. Ledger agent: Helps organizations eliminate manual effort by identifying exceptions and anomalies in transaction data; efficiently monitor and analyze account balances, exceptions, and anomalies; and provide supporting details from subledgers with prompt-based natural language account analysis. For example, the agent can monitor and detect if revenue for a specific line-of-business is off forecast before the quarter end, facilitate prompt-based natural language inquiry for factors influencing revenue such as order delays, and then automate supporting true-up accrual journal entries. Advanced prediction agent: Helps organizations support multivariate AI prediction models, leveraging financial and operational as well as external factors in predictive forecasting. For example, the agent can create data-driven revenue forecasts by leveraging internal and external data factors to uncover hidden patterns or trends, resulting in more timely and accurate cash forecasts. Customer account researcher agent: Provides sales teams with insights and automation in planning and research tasks so that they can dedicate more time to building relationships and driving account growth. For example, the agent can provide a seller with a summary of key information about the overall account health, identify opportunities for upselling and cross-selling, and view key stakeholder and corporate initiatives. Contracts researcher agent: Enables sales teams to automate routine contract workflows and approvals so they can focus on selling rather than administrative tasks. For example, a seller can streamline contract authoring and the renewals process while facilitating compliance with vendor best practices. Incentive compensation plan guide: Helps organizations communicate and motivate sales representatives to better align their behavior to the strategic intent from the C-suite. For example, a seller can view a clear explanation of a compensation plan to help maximize their earning potential at any time in the sales process. Oracle Fusion Applications Suite enables organizations to take advantage of the cloud and the latest advancements in AI to break down organizational silos, standardize processes, and manage finance, HR, supply chain, and customer experience data on a single integrated cloud platform. With frequent updates throughout the year, Oracle Fusion Applications Suite helps organizations embrace continuous innovation and stay ahead of whatever comes next. 👉",
        "title": "Oracle Introduces 50+ Role-Based AI Agents to Revolutionize Productivity Across Fusion Cloud Applications",
        "date/time": "14 Sep 2024, 10:23 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/harman-launches-forecastgpt-a-generative-ai-driven-forecasting-platform",
        "content": "HARMAN’s Digital Transformations Solutions Business Unit, a strategic business dedicated to blending the physical and digital to make business technology more dynamic, is introducing HARMAN ForecastGPT, a predictive analytics platform that empowers organizations to accurately predict future trends, optimize resource allocation, and enhance overall business performance. Leveraging advanced GPT technology, HARMAN ForecastGPT has reasoning capabilities and provides detailed commentary to explain trends in data. It is designed for businesses that need to make accurate predictions and informed decisions and operate in dynamic and uncertain markets, where demand and supply can vary significantly. HARMAN ForecastGPT supports a variety of forecasting scenarios such as Sales Forecasting , Supply Chain Forecasting , Financial Planning , Marketing across industries such as Retail, Manufacturing, Healthcare, Hospitality, Communications etc. For example, in Financial Planning scenarios, analysts can forecast revenue from multiple streams with precision, identify anomalies and generate detailed commentary to explain the trends in the data. said, “Embracing AI is imperative for business success and at HARMAN DTS, we are pioneering the application of AI to deliver tangible, bottom-line results. By understanding the unique challenges and aspirations of each client, we're crafting AI solutions that go beyond generic predictions. The ForecastGPT platform is a testament to our commitment to equipping businesses with the tools to move past challenging roadblocks and fully capitalize on the potential of AI.\" Designed with a singular focus on predictive analytics, HARMAN ForecastGPT allows for a deeper understanding of complex data patterns and more accurate forecasting without requiring any predefined templates or formulas. The platform features advanced AI capabilities, real-time adaptability and the ability to seamlessly integrate with various platforms, supported by a dedicated implementation team. It can work with any data format and source, such as CSV, Excel, SQL, API, and more. 👉",
        "title": "HARMAN Launches ForecastGPT, a Generative AI-Driven Forecasting Platform",
        "date/time": "04 Sep 2024, 4:13 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/tech-companies/lt-semiconductor-and-ibm-to-collaborate-on-advanced-processor-innovations",
        "content": "L&T Semiconductor Technologies Limited has announced discussions to engage in a research and development collaboration with IBM to design advanced processors. The scope of this work could include processor design for edge devices and hybrid cloud systems, as well as for areas like mobility, industrial, energy, and servers. L&T Semiconductor Technologies Limited is a global semiconductor product company based out of India and targeting to build a semiconductor portfolio of smart devices across multiple verticals, and IBM is an industry leader in driving cutting-edge innovation in silicon and processor development, both independently and with an ecosystem of partners. Under this collaboration, IBM and L&T Semiconductor Technologies Limited anticipate focusing on innovation, functionality, and performance to enable reliable, secure, and scalable compute for a range of applications. This work would be supportive of India’s ambition to create semiconductor technologies that are competitive in the global market. “This is one of the most exciting times in the history of technology, specifically India's semiconductor tech ecosystem. Semiconductors are changing how all industries operate and reimagining how conventional architecture is being designed and used. L&T Semiconductor Technologies Limited proudly stands at the forefront of semiconductor innovation, pioneering a new era with our commitment to facilitating digital transformation and driving sustainability. The goal of our work with IBM is to harness our cutting-edge semiconductor design technology and IBM’s advanced processors to forge next-gen technology products,” said Sandeep Kumar, CEO, L&T Semiconductor Technologies Ltd. “Our collaboration with L&T Semiconductor Technologies would be part of our continued commitment to enhance India’s digital transformation and economic growth through advanced AI processor design and solutions. Leveraging our collective strengths and advanced capabilities, we are dedicated to working with key public and private collaborators to advance what’s next in semiconductor and processor design technologies,” said Mukesh Khare, General Manager, IBM Semiconductors and Vice President, Hybrid Cloud Research at IBM. “This relationship would bring together our innovative capabilities and IBM's deep expertise in semiconductor processors and development. By working together, we aim to accelerate the development of new solutions for India and the global markets,” said Jayant Damodar Patil, Advisor to CMD, L&T. “Semiconductors are the driving force behind the AI revolution, delivering the essential processing power that propels innovation. IBM India is excited to explore the opportunity to collaborate with L&T in advancing the semiconductor industry and accelerating innovation through our technical expertise. As a leader in semiconductor and processor design, we are committed to contributing to the growth of India's semiconductor sector,” said Sandip Patel, Managing Director of IBM India and South Asia. The relationship between L&T Semiconductor Technologies Limited and IBM emphasizes a shared focus to revolutionize the design and development of advanced processors adhering to regulatory standards and creating competitive products for global markets. This past spring, IBM announced a memorandum of understanding with the Centre for Development of Advanced Computing , an autonomous scientific society of MeitY, to collaborate on the creation of a joint working group to accelerate processor design and manufacturing for High Performance Computing in India. 👉",
        "title": "L&T Semiconductor and IBM to Collaborate on Advanced Processor Innovations",
        "date/time": "13 Sep 2024, 3:41 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/channel/infopercept-appoints-ivalue-as-its-distributor-for-india-southeast-asia-and-saarc",
        "content": "Infopercept Consulting Pvt Ltd announced the appointment of iValue, a prominent provider of integrated IT solutions and services across the Asia-Pacific region, as its distributor for India, South East Asia and SAARC countries. Under the agreement, iValue will distribute Invinsense Platform, a cybersecurity platform consolidating offensive, defensive, and security compliance tools and its subscriptions. Invinsense is a cybersecurity platform built by Infopercept in India. The platform consolidates various cybersecurity approaches, tools, and managed services to continuously improve the cybersecurity posture of organizations of all sizes and verticals. iValue is one of the leading technology aggregators, with a purpose-built solution stack and related services covering digital transformation and security for organizations across India, SAARC, and Southeast Asia. Speaking on the partnership, \"We have a track record of being the preferred choice as technology aggregators and a history of successful collaborations. Our association with Infopercept will provide similar value to our partners and their customers in the cybersecurity space. With Invinsense, Infopercept has addressed all the cybersecurity challenges today's organizations face. Invinsense covers all cybersecurity approaches: defensive security, which help organizations detect and respond to current threats; offensive security, which uncovers the weaknesses in people, processes, and technology for predicting future attacks; and security compliances. The other two significant aspects that drove us towards them were their platform being compatible with all landscapes: IT, Cloud, OT, and IoT, and it also includes subscription services by relevant subject matter experts. In totality, we can comprehensively cover the cybersecurity needs of all kinds of organizations.\" \"iValue has been addressing business and technical needs of a wide range of organizations through its large spectrum of technology,\" \"With the distribution partnership with them, we are sure of creating a cybersecurity ecosystem that helps organizations achieve continuously improved cybersecurity posture. Every organization needs to work like a cybersecurity company to combat increasingly sophisticated cyberattacks and adhere to stringent security compliances. This collaboration will enable organizations of all kinds and sizes to achieve these two outcomes.\" 👉",
        "title": "Infopercept Appoints iValue as its Distributor for India, Southeast Asia, and SAARC",
        "date/time": "13 Sep 2024, 11:41 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/oracle-introduces-new-rfid-powered-solution-to-empower-healthcare-organizations",
        "content": "Oracle announced a new replenishment solution in Oracle Fusion Cloud Supply Chain & Manufacturing to help healthcare customers optimize inventory management. The new RFID for Replenishment solution in Oracle Fusion Cloud Inventory Management, part of Oracle Cloud SCM, utilizes RFID technologies from Avery Dennison, Terso Solutions, and Zebra Technologies to automatically capture usage, update stock balances, track location, and trigger restocking of supplies and materials. RFID for Replenishment helps healthcare organizations increase productivity, expand inventory insights, and prevent delays by helping ensure the right amount of stock is in the right location at the right time. “To help ensure clinicians have the right supplies for each procedure, inventory managers in healthcare organizations require frequent stock counts that often rely on manual data entry, which can lead to errors, replenishment delays, and item shortages,” said . “We’re collaborating with leading RFID vendors to deliver an end-to-end solution that will allow healthcare organizations to automate stock replenishment, expand inventory visibility, improve productivity, and enable clinicians to spend less time looking for supplies and more time focusing on patients.” Track medical supplies: Helps organizations track a range of different medical supplies with either RFID-tagging for high-value non-implantable items; RFID-enabled cabinet, refrigerators, and freezers for items with specific climate requirements; or RFID-enabled Periodic Automatic Replenishment bins for lower value supplies. Automate replenishment: Helps organizations eliminate manual product counts and automate restock by using RFID-enabled tagging, cabinets, and PAR bins to automatically create supply replenishment requests in Oracle Inventory Management. Gain real-time inventory visibility: Helps organizations maintain accurate stock counts by triggering a usage update as soon as an item has been removed from an RFID-enabled storage location. Reduce human error: Helps organizations reduce errors in lot and serial number reporting and maintain an accurate view of stock levels by fully automating inventory management. \"Speed and accuracy will always be intrinsically linked to positive patient outcomes. Our digital identification solutions and RFID inlays have been trusted by the healthcare industry for decades,\" said . \"Integration into Oracle’s broader organization-wide inventory management system means that our joint customers can increase the efficiency of the services they deliver and drive more value for patients.\" “The lack of inventory visibility throughout the healthcare supply chain is a growing challenge for all stakeholders,” said . “With our RFID-powered cabinets, refrigerators, freezers, and read points, and Oracle’s inventory management capabilities in one end-to-end solution, we can help healthcare organizations automate processes, improve the speed and accuracy of replenishment, and optimize operations for greater patient outcomes.” “Hospital staff need the right technology to instantly identify, track, and capture the location and status of critical resources in real time,” said . “Our RFID readers and precise location tracking provides real-time visibility into every item in Oracle Inventory Management. This technology helps our customers work in new ways to expand inventory visibility, streamline the operations of front-line clinicians and deliver better care.” Oracle Cloud SCM helps organizations seamlessly connect supply chain processes and quickly respond to changing demand, supply, and market conditions. With new features added every quarter, Oracle Cloud SCM helps customers create a resilient supply network and processes that outpace change. 👉",
        "title": "Oracle Introduces New RFID-powered Solution to Empower Healthcare Organizations",
        "date/time": "14 Sep 2024, 4:12 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/tech-companies/optoma-india-reaches-milestone-with-official-registration",
        "content": "In a significant move in the AV industry, Optoma India announces its successful official registration in India, underscoring a new chapter of innovation, growth, and excellence in the business. Optoma, a Taiwanese projector company, is set to intensify its presence in the Indian market. To mark the significant occasion, the Optoma leadership team traveled from their Taiwan headquarters to the India office to make the celebration truly grand. Their presence highlights the significance of achievement and symbolizes a strong global collaboration, keeping the company driven forward. The event highlighted Optoma’s dedication to building strong international connections and delivering impactful solutions for customers around the globe. While expressing his pleasure over Facebook post, Mr. Vijay Sharma, Country Head-India, Optoma said, “Thank you all the stakeholders to achieve this milestone together.” With the new beginning, Optoma India shows commitment to providing top-tier AV solutions while matching up with the increasing demand of India market. The core focus of the company is to innovate technologies and deliver groundbreaking products with a clear understanding of customer's requirement. Optoma India anticipates forging stronger partnerships for a better customer experience while contributing to the growth of the AV industry in India. With the official registration, Optoma strengthens its brand presence in the country and indicates fuller opportunities ready for tomorrow. 👉",
        "title": "Optoma India Reaches Milestone with Official Registration",
        "date/time": "12 Sep 2024, 5:27 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/solutions/tally-solutions-unveils-tallyprime-50-pioneers-api-based-gst-filing-for-msmes",
        "content": "With the continued vision to empower the backbone of the Indian economy – the fast-growing MSME sector; Tally Solutions today announced the global launch of the all-new TallyPrime 5.0, elevating its suite of Connected Services. A leading technology company providing business management software, Tally brings a new paradigm in connected services with API-driven tax filing. The launch is in line with the company’s vision to enhance business operations for the mid-mass segment both in India and globally. The latest version with ‘Connected GST’ will serve as a consolidated interface for all online GST operations, without having to visit the GST portal. This release further strengthens Tally’s connected experience which includes e-invoicing and e-way bill generation capability, WhatsApp integration, etc. Additionally, addressing the increasing demand in the Middle East and Bangladesh, TallyPrime 5.0 adds advanced multi-lingual capabilities that will extend to Arabic and Bangla language interfaces with phonetic support. The new solution encapsulates an array of unique features including a direct connect* to the GST portal which enables fast data upload/download, GSTR1 return filing, new recon flexibilities, including GSTR-1 recon and GSTR-3B recon features unique to Tally, Input Tax Credit at risk identification and ledger creation. The feature also supports end-to-end ‘bookkeeping to return filing’, bringing an integrated experience. With this new launch and other product pipeline initiatives, Tally is aiming to expand its current user base of 2.5 million+ by 50% over the next 3 years, while eyeing a CAGR growth of 30-40%. Sharing his views, said, “We’re continuously innovating our technology to help simplify business operations for MSMEs. Our latest release is designed to make GST filing simpler and hassle-free for Indian businesses. Currently, only a small portion of businesses use API-based filing, but we’re aiming to change that. With this latest launch, our focus is to consolidate the end-to-end GST filing journey of MSMEs, enabling them to save 60%-70% of their time. This release will also give a real-time status of their suppliers’ GST, safeguarding their ITC.” MSMEs are seeking effective tech solutions for their operations, and TallyPrime 5.0 provides a simple, secure, and reliable solution. It enhances business management with new features and builds on existing ones like e-invoice generation, user-friendly dashboards, WhatsApp integration, and Excel imports. This new launch is in line with Tally’s mission to connect businesses with their ecosystem and elevate user experience. The latest release is free for all active TSS subscribers. 👉",
        "title": "Tally Solutions Unveils TallyPrime 5.0: Pioneers API-Based GST Filing for MSMEs",
        "date/time": "13 Sep 2024, 10:43 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/smart-phone/tecno-unveils-pova-6-neo-with-ai-features-and-16gb-ram",
        "content": "TECNO is back with yet another game-changing device—the TECNO POVA 6 Neo, designed to elevate the smartphone AI experience. As AI rapidly transforms the smartphone landscape, making features more intuitive and powerful, its full potential has largely remained untapped, accessible only to the elite—until now. TECNO, always at the forefront of making cutting-edge tech affordable, ensures this AI-powered future is within everyone’s reach. With the POVA 6 Neo, TECNO invites users to embrace the full potential of AI. Don’t struggle in the digital world—\"Simply AI It\" and explore all that a smartphone can offer! In the heart of India’s Tier 3 cities and beyond, where innovation often seems distant, the POVA 6 Neo stands out as one of the first smartphones to bring premium AI features like AIGC Portrait, AI Magic Eraser, AI Cutout, AI Wallpaper, AI ArtBoard, and Ask AI. Imagine a phone that doesn’t just follow you but learns your rhythm, anticipates your needs, and delivers a truly personalized experience. Going on sale on Amazon and in retail stores from September 14 with prices starting at ₹11,999, the TECNO POVA 6 Neo also boasts segment-first features like a 108MP AI camera and 16GB* RAM and 256GB ROM, offering a solid experience at an unbeatable price. Addressing the launch, , said “At TECNO, we believe that cutting-edge technology should be accessible to everyone, not just a privileged few. With the POVA 6 Neo, we're proud to deliver premium AI capabilities, including a segment 1st 5G with 108MP AI Camera. This smartphone is a testament to our commitment to bridging the gap between affordability and innovation, ensuring that consumers across the nation can experience the power of advanced AI features without compromising on quality.” Meet your new AI BFF—the POVA 6 Neo! Packed with smart tools, it turns everyday tasks into fun experiences. Transform photos into avatars with AIGC Portrait, erase unwanted objects with AI Magic Eraser, and create custom stickers with AI Cut Out. Personalize your phone with AI Wallpaper 2.0, or let AI Artboard turn doodles into art. Plus, ASK AI handles multitasking, grammar fixes, and answers on the go, keeping you ahead of the game! Photography fans, rejoice! The POVA 6 Neo boasts the segment 1st 5G with 108MP AI camera for stunning, detailed shots. With 3x lossless in-sensor zoom, Super Night Mode, Time-Lapse, Vlog, and Dual Video, you’re ready for any moment. The 8MP front camera, with dual-color flash and AI, makes sure your selfies shine in any light. The POVA 6 Neo is a powerhouse, offering up to 16GB* of RAM and 256GB storage, first in the segment, perfect for gaming and streaming. Need more? Expand it up to 1TB! Powered by the MediaTek D6300 5G processor, it delivers smooth, high-speed performance for all your tasks. The TECNO POVA 6 Neo will be available in Midnight Shadow, Azure Sky, and Aurora Cloud colour variants, catering to all style preferences. As a part of the special launch offer POVA 6 Neo is priced at ₹11,999 for the 12GB* + 128GB variant and ₹12,999 for the 16GB* + 256GB variant, it offers exceptional value with top-tier features. Plus, enjoy a ₹1,000 exchange offer for even more savings! You can grab the POVA 6 Neo on Amazon or at your nearest retail store. 👉",
        "title": "TECNO Unveils POVA 6 Neo with AI Features and 16GB RAM",
        "date/time": "12 Sep 2024, 12:16 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/smart-phone/realme-unveils-p2-pro-5g-smartphone-powered-by-snapdragon-7s-gen-2-5g-processor",
        "content": "realme, announced the launch of , the newest addition to realme’s smartphone & AIOT portfolio. “We are thrilled to announce the launch of our latest innovations, the realme P2 Pro 5G and realme Pad 2 Lite. These new additions to our smartphone and AIOT portfolio are designed to deliver a seamless and immersive digital experience. The realme P2 Pro 5G, with its superior performance, and sleek design, is set to redefine the smartphone experience. On the other hand, the realme Pad 2 Lite, with its stunning display, powerful chipset, and mega battery, is designed to offer an unparalleled tablet experience. We believe these devices will truly empower our users in their digital journey.” The realme P2 Pro 5G is a testament to realme's dedication to offering exceptional value and exceeding typical flagship standards. Equipped with 80W Ultra Fast Charge with a massive 5200mAh Battery, the realme P2 Pro 5G ensures extended usage and rapid charging times. This smartphone also features a top-tier 50MP Sony main camera and the industry's first AI photography architecture, the HYPERIMAGE+ camera system, providing an ultra-clear shooting experience. The smartphone also boasts the brightest and most eye-comfort screen in its price segment, certified by SGS for AI Eye Protection. Furthermore, its Swiss SGS Premium Performance 5 Stars Drop Resistance certification and Corning Gorilla Glass 7i protection ensures durability and peace of mind. With the integration of AI capabilities, the realme P2 Pro 5G provides a smarter user experience, revolutionizing how users engage with their device. The smartphone comes with the Snapdragon® 7s Gen 2 5G Chipset, segment’s largest 3D VC Cooling System, and the realme GT Mode ensuring a smooth gaming experience while providing an unprecedented cool experience. The realme P2 Pro 5G is available in two elegant colors: Parrot Green and Eagle Grey, and three storage variants: 8GB+128GB priced at INR 19,999, 12GB+256GB priced at INR 21,999 and 12GB+512GB priced at INR 24,999. The realme Pad 2 Lite brings a transformative upgrade to the tablet segment with its 27.81cm 90Hz 2K Eye Comfort Display, providing a smoother and more immersive viewing experience. Powered by the Helio G99 Chipset and equipped with up to 16GB Dynamic RAM and 128GB ROM, it offers seamless performance and ample storage. The device also features the innovative Dynamic RAM Expansion technology, allowing it to expand 8GB of RAM by up to 8GB for a 16GB-like experience. The realme Pad 2 Lite is backed by a mega 8300mAh battery, the largest in its segment, and supports intelligent charging for extended battery life. It runs on realme UI 5.0 for Pad, offering user-friendly navigation and smart AI functionality. Capture life's moments with the 8MP AI Camera and enjoy the sleek, ultra-slim design with a sophisticated vegan leather finish. Available in two elegant colors: Space Grey and Nebula Purple, and two storage variants: 4GB+128GB priced at INR 14,999 and 8GB+128GB priced at INR 16,999, the realme Pad 2 Lite is set to redefine the tablet experience. 👉",
        "title": "Realme Unveils P2 Pro 5G Smartphone, Powered by Snapdragon 7s Gen 2 5G Processor",
        "date/time": "13 Sep 2024, 3:38 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/smart-phone/vivo-launches-t3-ultra-5g-with-dimensity-9200-processor",
        "content": "vivo, introduced its latest addition to the vivo T3 series – the vivo T3 Ultra 5G. The T3 Ultra 5G is the first smartphone by vivo in the ‘Ultra’ series and will be the most premium smartphone in the series T portfolio. Leveraging the acclaimed performance reputation of the Series T, the T3 Ultra 5G is powered by the MediaTek Dimensity 9200+ processor, the most powerful in the lineup, with an impressive AnTuTu score of over 1600K. The smartphone also comes with significant upgrades in camera and design, offering a Sony IMX921 OIS sensor along with a slim design, 5500 mAh battery, and IP68 rating. The T3 Ultra 5G will be available in two trendy colors – Frost Green and Lunar Gray and will be priced at INR 31999 for the 8GB + 128GB variant, INR 33999 for the 8GB + 256GB variant, and INR 35999 for the 12GB + 256GB variant. HDFC Bank users can also avail a flat discount of INR 3000*, making the effective price for the T3 Ultra 5G INR 28,999 for the 8GB + 128GB variant, INR 30,999 for 8GB + 256GB variant, and INR 32,999 for the 12GB + 256GB variant. Consumers can purchase the smartphone starting September 19, 2024, starting 7:00 PM, across Flipkart, vivo India e-store and partner retail stores. Commenting on the launch, “We are pleased to introduce the new vivo T3 Ultra 5G in India. This smartphone marks the debut of our ‘Ultra’ series, designed to offer a balance of advanced performance, imaging capabilities, and durability. As the leading model in the T3 Series, the T3 Ultra 5G is crafted to meet the needs of today’s dynamic users, providing a combination of style and performance. With this launch, we aim to enhance the Series T and set a new benchmark for the mid-premium segment.” Building on vivo’s strong partnership with MediaTek, the vivo T3 Ultra 5G comes with the powerful MediaTek Dimensity 9200+ processor, making it the segment’s fastest curved smartphone. Utilizing an advanced TSMC 4 nm process and integrating over 17 billion transistors, the T3 Ultra 5G delivers flagship-level performance with a perfect balance of speed and energy efficiency. It uses an octa-core CPU and a super-performance prime core Cortex-X3 CPU with a clock speed of 3.35 GHz, which is the highest ever for a series T smartphone. To further enhance the overall performance and user experience, the T3 Ultra 5G is equipped with a 6.78-inch 1.5K ultra-clear AMOLED display with a 120 Hz refresh rate and 4500 nits peak brightness, ensuring vibrant visuals even in bright sunlight. It also includes eye protection features certified by SGS and offers enhanced audio with Closed-Box Dual Stereo Speakers for immersive sound, whether gaming or watching videos. The earpiece mode boosts call volume by 200%, ensuring clear communication in noisy environments. The device is engineered for longevity, with a massive 5500 mAh battery that supports extended gaming, video streaming, and web browsing. The smartphone also supports 80W FlashCharge for quick charging. Additionally, the innovative Zero-Power Superfast Startup feature allows users to resume tasks almost instantly, restarting the phone in just 6 seconds. The vivo T3 Ultra 5G offers outstanding imaging with its flagship 50 MP Sony IMX921 sensor, equipped with OIS for sharp, clear photos in any lighting. The sensor’s 1/1.56-inch size and F/1.88 aperture enhance light capture and image quality, closely resembling human vision with vivo’s Camera-Bionic Spectrum technology. Additionally, the 8 MP wide-angle camera with a 120° field of view captures expansive landscapes and detailed close-ups effortlessly. For selfies, the T3 Ultra 5G comes with a 50 MP front wide-angle camera with a 92° field of view, ensuring sharp, distortion-free images. The Advanced AI Facial Contouring Technology further corrects common distortions from wide-angle lenses, offering natural, balanced portraits. The vivo T3 Ultra 5G also features vivo’s exclusive Studio Quality Aura Light that enhances low-light photography with soft, even illumination. The Studio-Quality Aura Light technology uses electronically controlled dimming to optimize lighting brightness for portraits. This advanced technology enhances brightness, clarity, and color accuracy in low-light and night conditions. To add to the festive spirit, the vivo T3 Ultra 5G features the Festival Portrait mode that adds festive color tones for memorable holiday photos. The smartphone also supports 4K video recording at 60 FPS and features hybrid OIS + EIS stabilization for smooth, clear footage. Additionally, smart AI features such as AI Erase and AI Photo Enhance help users refine their images by removing unwanted elements and improving photo quality with ease. The vivo T3 Ultra 5G sets a new standard in durability with its IP68 rating, ensuring it remains functional even after being submerged in water up to 1.5 meters deep for 30 minutes. Combining slim design with exceptional water resistance, the phone features advanced adhesive materials, SCHOTT Xensation® α Cover Glass for enhanced drop resistance, and improved cushioning for shock absorption. Its raised corners and reinforced edges provide additional protection against impacts, ensuring the T3 Ultra 5G is both resilient and reliable in everyday use. The vivo T3 Ultra 5G stands out with its sleek and elegant design, being the slimmest curved phone with a 5,500 mAh battery in this category at just 0.758cm . Its 3D curved AMOLED display and the Gemini Ring Camera Module, inspired by the constellation, enhance its premium look. Available in two new color variants, Frost green and Lunar Gray, the T3 Ultra 5G seamlessly blends style with functionality. The vivo T3 Ultra 5G runs on FunTouch OS 14, built on Android 14, delivering a smooth and responsive user experience. The device is backed by two years of Android software updates and three years of security patches. 👉",
        "title": "Vivo Launches T3 Ultra 5G with Dimensity 9200+ Processor",
        "date/time": "12 Sep 2024, 5:09 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/smart-phone/apple-unveils-iphone-16-pro-and-pro-max-with-larger-display",
        "content": "Apple introduced iPhone 16 Pro and iPhone 16 Pro Max, featuring Apple Intelligence, larger display sizes, new creative capabilities with innovative pro camera features, stunning graphics for immersive gaming, and more — all powered by the A18 Pro chip. With Apple Intelligence, powerful Apple-built generative models come to iPhone in the easy-to-use personal intelligence system that understands personal context to deliver intelligence that is helpful and relevant while protecting user privacy. iPhone 16 Pro and iPhone 16 Pro Max will be available in four stunning finishes: black titanium, natural titanium, white titanium, and desert titanium. Pre-orders begin Friday, September 13, with availability beginning Friday, September 20. “Powered by the faster, more efficient A18 Pro chip and built for Apple Intelligence, iPhone 16 Pro and iPhone 16 Pro Max are the most advanced iPhone models we’ve ever made,” said “Customers who are looking for the best possible iPhone will be able to take advantage of this huge step forward, whether they’re applying edits to a photo without lifting a finger, rewriting meeting notes for a more professional tone, or using the advanced camera system to capture their next masterpiece in 4K120 fps in Dolby Vision — all while enjoying extraordinary battery life.” Apple Intelligence on the iPhone 16 lineup harnesses the power of Apple silicon and Apple-built generative models to understand and create language and images, take action across apps, and draw from personal context to simplify and accelerate everyday tasks. Apple Intelligence maintains the privacy and security of user data with Private Cloud Compute. With systemwide Writing Tools, users can adjust notes or emails to be more friendly, more concise, or add a more professional tone to their writing; check for grammar, word choice, and sentence structure; and summarize selected text to make it more digestible. In the Notes and Phone apps, users can also record, transcribe, and summarize audio. When a recording is initiated while on a call in the Phone app, participants are automatically notified, and once the call ends, Apple Intelligence generates a summary to recall key points. The new Pro lineup features the thinnest borders of any Apple product and introduces larger display sizes: 6.3 inches on iPhone 16 Pro and 6.9 inches on iPhone 16 Pro Max — the largest iPhone display ever. The stunning Super Retina XDR displays with Always-On and ProMotion technologies help users accomplish more. Both models offer industry-leading durability with a strong, lightweight titanium design, as well as the latest-generation Ceramic Shield, which has an advanced formulation that is 2x tougher than glass on any other smartphone. The new mechanical architecture improves heat dissipation and efficiency for up to 20 percent better sustained performance. Along with the new internal design and advanced power management of iOS 18, larger batteries are optimized to offer a huge leap in battery life. Camera Control — a result of thoughtful hardware and software integration — makes the pro camera system more versatile with an innovative new way to quickly launch the camera, take a photo, and start video recording. It has a tactile switch that powers the click experience, a high-precision force sensor that enables the light press gesture, and a capacitive sensor that allows for touch interactions. A new camera preview helps users frame the shot and adjust other control options — such as zoom, exposure, or depth of field — to compose a stunning photo or video by sliding their finger on the Camera Control. With iPhone 16 Pro and iPhone 16 Pro Max, the world’s favorite camera gets even more powerful. Powered by A18 Pro, the upgraded camera system introduces a new 48MP Fusion camera with a faster, more efficient quad-pixel sensor and Apple Camera Interface, unlocking 4K120 fps video recording in Dolby Vision — the highest resolution and frame-rate combination ever available on iPhone, and a smartphone first. The quad-pixel sensor can read data 2x faster, enabling zero shutter lag for 48MP ProRAW or HEIF photos. A new 48MP Ultra Wide camera also features a quad-pixel sensor with autofocus, so users can take higher-resolution 48MP ProRAW and HEIF images when capturing uniquely framed, wider-angle shots or getting close to their subjects with macro photography. The powerful 5x Telephoto camera now comes on both iPhone 16 Pro and iPhone 16 Pro Max, allowing users to catch the action from farther away, no matter which model they choose. Users can capture 4K120 fps in Slo-mo or Video mode, and adjust the playback speed after capture in the Photos app, including a quarter-speed playback, a new half-speed option for a dreamy effect, and a fifth-speed option that corresponds to 24 fps. When coupled with the new image signal processor of A18 Pro, users can do frame-by-frame cinema-quality color grading for 4K120 fps in Dolby Vision. Users can also capture 4K120 fps ProRes and Log directly to an external storage device for efficient pro workflows. The new A18 Pro chip is designed with industry-leading compute power to propel Apple Intelligence, ushering in a new era of pro performance. Built with second-generation 3-nanometer technology and featuring a new architecture with smaller, faster transistors, A18 Pro delivers unprecedented efficiency. The new 16-core Neural Engine is faster and more efficient than the previous generation, powering remarkable on-device performance for Apple Intelligence. A 17 percent increase in total system memory bandwidth — the highest ever in iPhone — enables faster experiences when using Writing Tools and Image Playground, and helps deliver astounding graphics. The bandwidth increase also benefits the 6-core GPU, which is up to 20 percent faster than the previous generation, driving graphics rendering for Apple Intelligence and stunning visuals for gaming. A18 Pro enables Always-On and ProMotion technologies for an exceptional viewing experience on iPhone, as well as faster USB 3 speeds and ProRes video recording. A new ISP and video encoder process 2x the amount of data for faster video encoding and pro workflows. The iPhone 16 Pro lineup features innovative ways to stay connected and provides enhanced safety capabilities for peace of mind. Powered by the same groundbreaking technology as Emergency SOS via satellite, users are able to connect to the nearest satellite to send and receive texts, emoji, and Tapbacks over iMessage and SMS while outside cellular and Wi-Fi coverage.2 Messages via satellite in iOS 18 are end-to-end encrypted. Also new with iOS 18, Emergency SOS Live Video allows users to share a live video feed or photos with participating emergency dispatchers during an emergency call. iPhone 16 Pro and iPhone 16 Pro Max will be available in black titanium, natural titanium, white titanium, and desert titanium, in 128GB, 256GB, 512GB, and 1TB storage capacities. iPhone 16 Pro starts at $999 , and iPhone 16 Pro Max starts at $1,199 . 👉",
        "title": "Apple Unveils iPhone 16 Pro and Pro Max with Larger Display",
        "date/time": "10 Sep 2024, 11:22 am",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    },
    {
        "url": "https://digitalterminal.in/smart-phone/huawei-unveils-2800-tri-fold-smartphone-to-challenge-apples-iphone-16-launch",
        "content": "Huawei Technologies unveiled its latest $2,800 tri-fold smartphone on Tuesday, aiming to strengthen its position in the world’s largest smartphone market and draw attention away from Apple, just hours after Apple's latest iPhone 16 launch. The Chinese technology company exhibited the latest Mate XT, a three-way foldable handset such as an accordion screen door, in the Shenzhen tech hub launch ceremony. The smartphone has already received over 4 million pre-orders that required no deposit, as per the company’s website. According to research organization IDC, the entire global market for foldable phones, in the second quarter, was around 4 million units. \"Today we bring you a product that everyone can think of but could not make. Our team has been working hard for five years and has never given up,\" Richard Yu, Huawei executive director stated at the launch. \"Today we will once again rewrite the history of the industry, turn science fiction into reality, and lead a new era of folding devices.\" AI functions are bolstered with in-house Kylin chips of Huawei, he added. The new phone features an AI assistant alongside translation, text summary, and editing functions, along with AI-boosted image editing capabilities such as removing unwanted parts from the photos, Yu said. The highly anticipated launch follows right hours after Apple introduced its latest lineup - the AI-supported iPhone 16, both smartphones are due to up on sale on 20 September. The Mate XT is available in red and black colours and boasts a 10.2-inch display screen. The company claims that its 3.6mm width makes it the slimmest foldable phone in the world and also has a keyboard attached easy to fit in the pocket. The 256-gigabyte model is priced at 19,999 yuan, with higher memory options available at 21,999 yuan and 23,999 yuan, as per Reuters. The launch, following a string of successful smartphone releases, highlights Huawei's resilience in overcoming U.S. sanctions and strengthens its position over Apple in China, where consumers have criticized the iPhone 16 for lacking AI features. Apple is still in search of an AI partner in China to enhance its iPhone 16 series, while its AI software, Apple Intelligence, will not be available in Chinese languages until next year. 👉",
        "title": "Huawei Unveils $2,800 Tri-Fold Smartphone to Challenge Apple’s iPhone 16 Launch",
        "date/time": "13 Sep 2024, 2:07 pm",
        "author": "NDM News Network",
        "author_url": "https://digitalterminal.in/author/ndm-news-network"
    }
]