[
    {
        "url": "https://www.livemint.com/companies/news/ratings-agencies-warn-of-downgrade-if-boeing-strike-prolongs-11726252873478.html",
        "content": "By Shivansh Tiwary Sept 13 - Fitch and Moody's on Friday joined S&P Global Ratings in warning that a prolonged strike at Boeing's factories in U.S. West Coast may lead to a ratings downgrade, a headache for the planemaker that is saddled with massive debt. \"If the current strike lasts a week or two, it is unlikely to pressure the rating. However, an extended strike could have a meaningful operational and financial impact, increasing the risk of a downgrade,\" Fitch Ratings said. Moody's warned of a downgrade if Boeing issues debt alongside any equity raised to meet its liquidity requirements, including the money it needs to retire about $12 billion of debt maturities between now and the end of 2026. Moody's currently rates the planemaker at \"Baa3\", while Fitch has \"BBB-\" rating — both a notch above the junk status. More than 30,000 workers walked off the job at Boeing on Friday after rejecting a contract deal, halting production of its 737 MAX jet, the company's main cash-cow. CFO Brian West did not directly answer when asked if Boeing may need to raise debt or equity by the year-end or early 2025. \"First of all, we want to prioritize the investment grade credit rating. And secondly, we want to allow the factory and the supply chain to stabilize. That last objective just got harder based on last night,\" he said at a conference organized by Morgan Stanley. \"We are perfectly comfortable to supplement our liquidity position to support these two objectives,\" West said. The first labor strike at Boeing since 2008 coincides with a period of intense scrutiny of the planemaker by U.S. regulators and airline customers after an incident in January when a door panel detached from a 737 MAX jet mid-air. Boeing's management will likely need to access new sources of liquidity in the event of a prolonged strike to adhere to its cash targets and to remain within Fitch's negative rating sensitivity, the ratings agency said. S&P Global Ratings had said on Thursday an extended strike could delay the planemaker's recovery and hurt its overall rating. Boeing's finances are already groaning due to a $60 billion debt pile. Shares of the planemaker were down 4% in afternoon trading, touching over an 18-month low.",
        "title": "Ratings agencies warn of downgrade if Boeing strike prolongs",
        "date/time": "14 Sep 2024, 12:11 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/boeing-strike-poses-challenge-to-max-targets-supply-chain-cfo-says-11726251917325.html",
        "content": "By Allison Lampert and Abhijith Ganapavaram Sept 13 - A strike beginning Friday by more than 30,000 of Boeing's U.S. West Coast factory workers will make it harder for the planemaker to meet a 737 MAX production target and stabilize its supply chain, CFO Brian West said on Friday. West also told the Morgan Stanley Laguna Conference he expects third-quarter margins from the company's defense and space unit to be negative, similar to those in the second quarter. Workers from Seattle and Portland, Oregon, who produce the MAX and other jets walked off the job after overwhelmingly rejecting a contract deal due to demands for higher pay. The workers' first strike since 2008 comes as Boeing is under heavy scrutiny from U.S. regulators and customers after a door panel blew off a 737 MAX jet mid-air in January. West said Boeing had made progress towards ramping production of its strongest selling jet back to 38 a month by year's end, despite earlier skepticism from rating agencies over the target. \"We've been making good progress on stabilizing production and preparing for that 38 per month by the end of the year. Now, obviously that's going to take longer,\" West said. West, however, would not comment on specifics related to the target, which depends on the duration of the strike. The strike is creating more uncertainty and concern for suppliers of parts and components for programs like the 737 MAX. Many were already having difficulty planning production due to Boeing’s repeated changes to internal forecasts for suppliers. West said a company priority was stabilizing its supply chain, but that \"objective just got harder.\" West suggested Boeing would stop taking parts from some suppliers on programs impacted by the strike where the planemaker has ample inventory. The company's 787 widebody jet is not impacted, as it is built in South Carolina by a non-unionized workforce. Asked about supply chain, West said for non-787 programs, if the supplier is not behind and the company has enough stock, \"you know, don't deliver anymore.\" He said this messaging is \"happening overnight and as we speak.\"",
        "title": "Boeing strike poses challenge to MAX targets, supply chain, CFO says",
        "date/time": "13 Sep 2024, 11:55 PM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/adani-group-hcl-tech-infosys-among-top-indian-firms-in-times-worlds-best-companies-of-2024-check-full-list-11726247701528.html",
        "content": "HCL Tech, Infosys, Wipro, and Adani Group, among others, are the top Indian firms that have made it to . Topping among Indian companies to feature in the TIME's list was HCL Tech at the 112 position, followed by Infosys at the 119 position, and Wipro at 134 position. The next Indian firms to feature in the list are - Mahindra Group, Axis Bank, State Bank of India, ICICI Bank, Larsen & Toubro, Kotak Mahindra Bank, ITC Limited, Reliance Industries, Adani Group, NTPC Limited, Yes Bank, Bank of Baroda, Godrej & Boyce, Bajaj Group, Cipla, Bharat Electronics Limited, MRF. The Adani Group is at the 736 position. Coming to the overall list, US-based tech giant Apple has topped the list globally, followed by Ireland-based tech major Accenture. Microsoft, BMW Group, and Amazon featured next in line. The World's Best Companies 2024 list is based on analysis across three dimensions: employee satisfaction, revenue growth, and sustainability. ‘’Companies like Apple, Microsoft, and BMW still appear to be investing in their workers’ happiness, a trait that has put them at the top of the list of a new statistical ranking of 1,000 of the World’s Best Companies by Statista and TIME,'' said TIME. Microsoft, for instance, which came in third in the rankings, was the second highest-rated company in employee satisfaction, after Alphabet, the parent company of Google. Microsoft has said it tries to ensure that employees are thriving, which it defines as “energized and empowered to do meaningful work,” an approach that seems to be working both at keeping employees happy and at powering revenue. The company made $88 billion in its latest fiscal year, up 22 per cent from the prior year, and ranked highly in revenue growth. , coming in fourth in employee satisfaction, but was propelled to the top of the rankings by its ESG rating, which was first out of all the companies. The tech giant has committed to being carbon neutral by 2030 and is making more products with recycled materials; in early 2024, it also became the first big tech company to achieve gender equality on its board of directors, now composed of four men and four women. Though tech companies accounted for six of the top 20 positions and four of the top 10, the German automaker, BMW Group, ranked fourth. Accenture, the consulting firm based in Dublin, scored second overall in all three categories. Its CEO, Julie Sweet, was on the TIME100 list for 2024. Under her, Accenture “had a deeply positive societal impact, using technology to solve pressing issues,” Klaus Schwab, the founder and executive chairman of the World Economic Forum, wrote about Sweet.",
        "title": "Adani Group, HCL Tech, Infosys, among top Indian firms in TIME’s world’s best companies of 2024; Check full list | Mint",
        "date/time": "13 Sep 2024, 10:55 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/companies/news/lagarde-signals-ecb-open-to-october-cut-but-december-more-likely-11726261622742.html",
        "content": "-- The European Central Bank is open to considering an interest-rate cut in October if the economy suffers a major setback — though the next comprehensive set of information will only be available at the following meeting, President Christine Lagarde said. Her remarks, less than a day after the ECB delivered its second quarter-point reduction in the deposit rate since June, offer the clearest signal yet that policymakers are leaning toward waiting until December for their next move. But they’ve vowed to be data dependent and decline to rule out acting already next months. People familiar with their thinking have said it would take a more significant deterioration in the growth outlook or aggressive easing by the Federal Reserve to depart from the quarterly pace of rate-cutting. “We have a lot of data at projections exercises, we also receive data in between,” Lagarde told reporters in Budapest, where she attended a meeting of euro-area finance chiefs. “We look at everything, and if there is a significant change relative to our baseline we reassess.” ECB officials speaking before her on Friday have also been cautious in signaling any future steps. France’s Francois Villeroy de Galhau said policymakers should continue to “gradually” lower rates. “The pace has to be highly pragmatic,” he said. “We’re not pre-committing to any particular rate path, and we keep our full optionality for our next meetings.” Officials, who first loosened policy in June, are responding to the latest retreat in inflation that took the rate within sight of their 2% goal. While some are wary of lingering price pressures in the services sector, others worry that the euro zone’s souring economy could lead to inflation undershooting the target as it did before the pandemic. “The probability of a rate cut in October, if we look at the financial markets, isn’t big,” said Martins Kazaks of Latvia. “But at the same time, if there’s an unexpected hit to the economy, and if the economy feels significantly weaker than is currently expected and inflation also significantly declines, then of course we could also consider a rate cut.” Markets see a chance of a move next month at just 25%. In Lithuania, Gediminas Simkus said policymakers “will need strategic patience” as they plot the course ahead. Inflation is “calming down” and “its trajectory suggests that further rate cuts must happen,” he told Radio LRT on Friday. “Rates will continue declining, but the speed of cuts will depend on data.” For Austria’s Robert Holzmann, there could be “room” for another quarter-point move “in December,” suggesting there may not be sufficient additional data to decide on a step in October, according to an interview published by the Financial Times. Luxembourg central-bank chief Gaston Reinesch said the ECB is likely to cut rates several times if its price outlook proves accurate. Simkus cited services inflation as the “key uncertainty” — a danger that was also stressed by Slovenia’s Bostjan Vasle and Estonia’s Madis Muller. “There still exist pockets of uncertainties, for example around wage dynamics and services prices,” Vasle told Bloomberg. “We will have some new information already at the next meeting, and more in December.” There were some more positive assessments of price trends, with Bundesbank President Joachim Nagel describing the outlook as “very good.” “We assume and the data back us up that we’ll reach our inflation target of 2% by the end of next year,” he told Deutschlandfunk. “The portfolio of data is such that it justified yesterday’s rate cut.” But the quarterly forecasts underpinning those comments — also published Thursday — showed the economy is likely to expand less than previously envisaged in 2024, 2025 and 2026. Indeed, after a brief early-year revival, Europe’s growth momentum is fading, with manufacturers still suffering from higher energy costs and soft demand beyond the 20-nation currency bloc. A long-promised consumer-led recovery is yet to materialize. For some — including Finland’s Olli Rehn and Ireland’s Gabriel Makhlouf — the deteriorating backdrop is a reason to remain nimble. Growth “remains slow in the euro area, and downside risks to growth have increased over the summer,” Rehn said. “We thus maintain full freedom of action and flexibility in making interest rate decisions in future meetings.” Former ECB Chief Economist Peter Praet reckons the “best scenario” for the officials in Frankfurt is to cut in December. But factors such as a larger reduction in borrowing costs next week by the Fed could yet make October possible. “December is far away, many things can happen,” he told Bloomberg Television’s Tom Mackenzie on Friday. “So the ECB tried to keep optionality.” --With assistance from Ott Tammik, Leo Laikola, Milda Seputyte, William Horobin, Aaron Eglitis, Jan Bratanic, Jennifer Duggan and Olivia Fletcher. More stories like this are available on ©2024 Bloomberg L.P.",
        "title": "Lagarde Signals ECB Open to October Cut But December More Likely",
        "date/time": "14 Sep 2024, 02:37 AM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/fed-seen-nearly-as-likely-to-cut-rates-by-50-bps-as-25-bps-11726261343652.html",
        "content": "By Ann Saphir and Howard Schneider Sept 13 - The Federal Reserve is nearly as likely to deliver an outsized interest-rate cut next week as a more-usual-sized reduction, trading in rate-futures contracts suggested on Friday, as financial markets priced in a bigger chance that the Fed will move more aggressively. A quarter-point reduction at the Fed's Sept. 17-18 meeting is still seen as the slightly more likely outcome, but only marginally so. Futures tied to the Fed's policy rate now reflect about a 47% chance that the Fed will cut its policy rate, currently in the 5.25%-5.50% range, by a half of a percentage point. That's up from about 28% on Thursday. The market move reflects increasing bets by traders that the Fed may try to head off deterioration in the labor market, rather than take a slower see-what-happens-next approach with a smaller opening reduction. \"Our view is that the Fed is behind the curve - that it should have been easing from June even, or potentially May - and that now it needs to catch up and may have to front-load some of the rate cuts,\" Parthenon economist Gregory Daco said. Fed Chair Jerome Powell last month said he would not want to see any further cooling in the labor market, and \"the time has come\" to cut rates. Since then, other Fed policymakers have signaled their sympathy with that view, including San Francisco Fed President Mary Daly who said a weakening job market would be unwelcome. Fed Governor Chris Waller said he would support front-loading rate cuts should conditions merit. Typically Powell spends the Thursday and Friday before a policy-setting meeting in half-hour one-on-ones with each of his fellow policymakers to discuss the options on the table and the economic conditions that may warrant one over another. CHANGING SENTIMENT The change in market sentiment amplifies a discussion that began in earnest at the Fed's July 30-31 meeting, when \"several\" policymakers said there was already a \"plausible case\" to cut rates, according to minutes of the session - a fact that may leave some officials now advocating for a bigger increase in September if they think the Fed should have cut already. Within days of that meeting, the case grew even stronger when the employment report for July showed the jobless rate rising to 4.3% and employers adding a fewer-than-expected 114,000 new jobs - a slow pace by recent standards that was subsequently revised down to just 89,000. Revisions to benchmark data also showed job creation for the 12 months ending in March had been slower to the tune of 818,000 positions. The new data fueled sentiment that the Fed was slipping behind the curve in protecting the job market just as it was slow to begin hiking rates when inflation took off in 2021. Data for August showed the unemployment rate easing back to 4.2% but job growth slowing to just 116,000 a month on average since June, well below the rate officials see as necessary to prevent the jobless rate from rising. Powell in comments at the Fed's annual research symposium in Jackson Hole last month made clear that rates would fall at the Fed's September meeting. He was noncommittal, though, on how far or how fast the decline might be, or whether officials would open the door with a conventional quarter-point reduction or something larger. THE CASE FOR BIG OR SMALL Outside of clear economic threats, easing cycles have tended to begin with quarter-point reductions as central bankers try to reset financial conditions to account for easing inflationary pressures - and several Fed officials ahead of this meeting used words like \"gradual\" and \"methodical\" to describe the likely pace. Others are concerned the labor market is weaker than headline data suggest. Fed Governor Adriana Kugler in particular voiced concern that alternate measures of unemployment beyond the headline rate suggest labor market conditions may be eroding faster than thought. Alongside the interest rate decision on Sept. 18, the Fed will issue new economic projections from policymakers that will indicate how far they anticipate reducing rates by the end of the year. Investors currently expect 1.25 percentage points of cuts by then, though markets have jockeyed back and forth between bets for smaller and larger cuts over a volatile month of trading. The way data has evolved does suggest a quicker pace of cuts than suggested not only in June, when Fed policymakers penciled in just one 25 basis point rate cut this year, but also than in March, when the median projection was for three quarter-point rate cuts by the end of the year. In March, policymakers also saw an unemployment rate at 4% at year end and a closely watched inflation measure at 2.6%. That core inflation measure - the Personal Consumption Expenditures price index excluding food and energy costs - hit that year-end projection in July, and the unemployment rate is now higher than they expected it to be at the end of 2024. \"Yes it is an uphill climb, but I think the Federal Reserve will cut its policy rate by 50 basis points at its upcoming meeting,\" wrote Renaissance Macro Head of Economic Research Neil Dutta. \"The case for doing more upfront is strong.\"",
        "title": "Fed seen nearly as likely to cut rates by 50 bps as 25 bps",
        "date/time": "14 Sep 2024, 02:32 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/boeing-strikers-have-leverage-to-extract-meaningful-change-11726252162210.html",
        "content": "-- It’s hard to overstate the damage that a machinists strike could do to Boeing Co. and, more important, to the planemaker’s fragile supply chain. Suppliers had already been whiplashed by the groundings of the 737 MAX and the 787 and then the pandemic. Boeing was just beginning to get back to building planes in an orderly fashion and keeping work steady for its supply base, which is key for their financial health and the production of high-quality parts.The overwhelming support to go on strike — 96% of the 33,000 members of the machinists union in Seattle voted to take to the streets — is an ominous sign for Boeing. This walkout could drag on for weeks, and Boeing will have to pay a high cost it can ill afford to satisfy workers. The company is burning through its $12.6 billion of cash and has a huge $58 billion debt burden, raising concern it could lose its investment-grade ratings. In fact, Moody’s Ratings said on Friday that it had placed the company’s debt rating on review for a potential downgrade to junk. Unfortunately, Boeing’s new chief executive officer, Kelly Ortberg, is reaping what was sown a decade ago when the company thought it was smart to put the screws to union workers with the threat of moving more production to its nonunion South Carolina facility. That 10-year contract extension reached in 2014 froze pension benefits, among other things, planting the seeds of this thorny conflict. The union now has the upper hand because Boeing desperately needs to ramp up production of planes to help heal its supply chain and stem its losses. The company offered a general wage increase of 25% over four years and a $3,000 bonus for approving a new contract. Workers wanted a 40% raise and annual performance bonuses. How does Boeing pay up without breaking its finances? Here’s a quirky suggestion for both sides of the bargaining table: tie an extra bonus to any future share repurchases. The reasoning behind this suggestion is that the aggressive negotiating tactics that Boeing wielded a decade ago coincided with the company’s zeal to maximize returns to stockholders through huge share repurchases. The union has an opportunity to make sure management doesn’t go on another massive stock buyback spree in the future .From 2014 to 2018, Boeing repurchased $38 billion worth of shares. These repurchases had their desired effect of juicing up the stock price. But the spike was temporary, and unless investors sold their shares in that period of high prices, they lost out. That cash, which Boeing could certainly use now, just went up in smoke after the two fatal crashes of the 737 MAX and the quality issues exposed during the pandemic caused shares to plummet. Now, Boeing is the symbol for those who oppose buybacks as solely a financial engineering tool that serves to mask the big payouts in stock that are awarded to C-suite executives. The company clearly lost its focus on making high-quality aircraft and instead made moves such as outsourcing more of its production to drive up its cash earnings. Wall Street, of course, loves share buybacks. The large investment banks are often involved in the repurchases, and the earnings-per-share boost that results from shrinking the number of outstanding shares fits with the short-term mentality that emphasizes the next quarter’s targets rather than the long-term strategy. Company executives also love this financial tool. Without buybacks, the large share-based compensation packages would push up the share count, creating a headwind for earnings per share and making it harder to defend the large stock bonuses. On the flip side, Wall Street isn’t a huge fan of dividends. Those payments carry a higher tax rate than the capital gains from selling shares. Dividends also lock in the use of cash because cutting that payment generates negative publicity. Buybacks give a company much more flexibility on how much and when to return cash to investors. It’s easy to overlook the small investors who depend on dividend payments for real cash that they can spend. Boeing’s story could be much different if the company had sat on a bunch of cash to either plow back into the business to fend off rival Airbus SE, which is now eating Boeing’s lunch, or to hold on to for shelter during a rainy day. Well, Boeing has just gone through a monsoon season without as much as a rain suit. The union should set a precedent and demand that its workers receive a bonus tied to a percentage of share repurchases. It can’t be a small percentage, such as the 1 percent tax on share buybacks that took effect at the start of 2023. That small speed bump hasn’t put the brakes on the buyback frenzy. It would have to be a large percentage, say 5% or 10%, to create a disincentive for Boeing executives to burn up more cash when the good times return, if they ever do. If the board just can’t wean itself off the buyback steroids, then at least the workers would share in the largesse. Yes, this idea is a bit far-fetched. The union likely won’t want to waste its new-found bargaining power on something that doesn’t provide an immediate payout. Boeing’s management would resist at all costs because it would tie its hands on one of Wall Street’s favorite financial tools. Still, the workers are in a rare position to think outside the box and bring important changes to the company. More From Bloomberg Opinion: This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners. Thomas Black is a Bloomberg Opinion columnist writing about the industrial and transportation sectors. He was previously a Bloomberg News reporter covering logistics, manufacturing and private aviation. More stories like this are available on ©2024 Bloomberg L.P.",
        "title": "Boeing Strikers Have Leverage to Extract Meaningful Change",
        "date/time": "13 Sep 2024, 11:59 PM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/brookfield-backed-dit-becomes-indias-largest-mobile-tower-firm-with-atc-india-acquisition-11726213819352.html",
        "content": "Data Infrastructure Trust on Thursday said it has pipped Indus Towers to become India's largest mobile tower company after acquiring American Tower Corporation’s operations in the country. Data Infrastructure Trust is backed by along with affiliates of investors including British Columbia Investment Management Corporation and GIC. The firm acquired 100 per cent of 's operations in India comprising the buyout of approximately 76,000 communications sites in India for an enterprise value of 18200 crore or about USD 2.2 billion. \"With this acquisition, the Brookfield-led consortium reinforces its commitment to connecting India with an expanded portfolio of 257,000 telecom sites,\" DIT said in a statement. DIT's Telecom Infrastructure portfolio will be housed under the new brand name Altius. owned had a portfolio of 2,25,910 as of June 30, 2024. ATC India is Brookfield's third acquisition in the Indian telecommunications space. In 2022, Brookfield acquired a portfolio of 6,300 indoor business solution sites and small cell sites. Brookfield also has a portfolio of approximately 175,000 towers that were acquired in 2020 from Reliance Industrial Investments and Holdings Limited. In , Brookfield has approximately USD 29 billion in assets under management across infrastructure, real estate, renewable power and transition and private equity.",
        "title": "Brookfield backed DIT becomes India’s largest mobile tower firm with ATC India acquisition | Mint",
        "date/time": "13 Sep 2024, 01:34 PM IST",
        "author": "PTI",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/us-steel-surges-on-report-decision-may-come-after-election-11726250424975.html",
        "content": "-- United States Steel Corp. surged the most this year after the Washington Post reported President Joe Biden wouldn’t immediately move to block Nippon Steel Corp.’s takeover bid. While Biden remains opposed to the deal, a decision on blocking it is unlikely in the short term and may not be made until after the presidential election, the newspaper reported, citing people familiar with the matter. US Steel shares surged as much as 10%, the steepest intraday gain since Dec. 18 — the day the deal was first announced. The gain had pared to 5% at 1:03 p.m. in New York, as White House spokeswoman Saloni Sharma disputed that there’d been a change of plans, saying an announcement was never imminent. “The President’s position is that it is vital for US Steel to remain an American steel company that is domestically owned and operated.” Biden was preparing to kill the deal once a referral from the Committee on Foreign Investment in the United States, or CFIUS, reaches his desk, people familiar with the matter said last week. The current deadline for a CFIUS decision is Sept. 23, people familiar with the matter said. An extension would push the latest date for a decision past the election. “The President told our steelworkers he has their backs, and he meant it,” Sharma said. “As we made clear last week, we have not received any recommendation from CFIUS.” Nippon and US Steel have been making last-ditch efforts to win over workers and politicians for the $14.1 billion acquisition. This week, the two companies unveiled their correspondence with the USW to show how union leaders snubbed efforts to negotiate an agreement. That’s after the Pittsburgh-based company came out and warned that plants could be shut down if the sale fell through, prompting some workers to voice their support for a new owner. But the United Steelworkers union said in a memo Thursday it won’t be bullied, calling the deal “doomed” and pledging to fight any foreign ownership. US Steel and Nippon Steel pointed to the $2.7 billion of investments the deal would bring, saying that will benefit workers, local communities and national security. More stories like this are available on ©2024 Bloomberg L.P.",
        "title": "US Steel Surges on Report Decision May Come After Election",
        "date/time": "13 Sep 2024, 11:30 PM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/boeings-737-max-production-faces-fresh-turbulence-as-96-workers-at-us-factories-reject-contract-deal-vote-for-strike-11726214718133.html",
        "content": "Boeing workers at its US West Coast factories have gone on strike, bringing production of the company's best-selling jets to a standstill. The strike, which began early September 13, comes at a challenging time for the aerospace giant as it grapples with ongoing production delays and significant debt, as per a Reuters report. The International Association of Machinists and Aerospace Workers , representing approximately 30,000 employees, voted overwhelmingly in favour of the strike. This marks the first such action since 2008 and occurred just weeks after took the helm as CEO, tasked with rebuilding trust in the company following a serious safety incident in January, the report added. Union leader Jon Holden emphasised the significance of the strike, stating, \"This is about respect, this is about addressing the past, and this is about fighting for our future.\" The decision to strike was met with enthusiasm from union members, who chanted \"Strike! Strike! Strike!\" upon hearing the announcement, as quoted in the report. Union leader Jon Holden emphasised the significance of the strike, stating, \"This is about respect, this is about addressing the past, and this is about fighting for our future.\" The decision to strike was met with enthusiasm from union members, who chanted \"Strike! Strike! Strike!\" upon hearing the announcement, as quoted in the report. CEO Ortberg had proposed a contract deal including a pay rise of 25 per cent over four years, far lower than the 40 per cent workers had demanded. Boeing acknowledged the clear message sent by the vote and expressed a willingness to return to negotiations. The rejected contract deal also included a signing bonus, and a commitment to build Boeing's next commercial jet in the Seattle area under certain conditions. The strike poses multiple challenges for , including how to secure its factories and respond at the bargaining table. If prolonged, the work stoppage could have far-reaching effects on Boeing's finances, as well as impacting airlines and suppliers in the aviation industry. Air India CEO Campbell Wilson noted that deliveries to his airline were already facing delays due to regulatory scrutiny and industry-wide supply chain issues, even before the strike announcement, as per the report. Financial analysts estimate that a 50-day strike could cost Boeing between $3 billion and $3.5 billion in cash flow. The company's last major strike in 2008 lasted 52 days and reportedly cost around $100 million per day in lost revenue, the report added.",
        "title": "Boeing 737 MAX production faces fresh turbulence as 96% workers at US factories vote for strike | Mint",
        "date/time": "13 Sep 2024, 03:02 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/ganpati-2024-mukesh-ambani-visits-lalbaugcha-raja-in-mumbai-with-son-anant-watch-11726244688220.html",
        "content": "Reliance Industries Ltd Chairman visited the popular Lalbaugcha Raja Ganeshotsav, in Mumbai's Lower Parel area to offer his prayers to the deity with his son Anant Ambani, reported the news agency ANI on Friday, September 13, 2024. Apart from the Ambanis, Reserve Bank of India Governor Shaktikanta Das had also visited Lalbaugcha Raja on September 11, according to the agency's report. The Lalbaugcha Raja's iconic Ganesh idol is a \"central attraction\" during the festival in Mumbai. The venue draws huge crowds numbering in the thousands, all of whom seek Lord Ganesha's blessings, as per the report. Lalbaugcha Raja Ganeshotsav is one of the most popular in Mumbai. The Ganeshotsav received more than 48 lakh in donations on the first day, September 8, according to the agency report. “The donation amounted to Rs. 48 lakh 30 thousand,” according to Mangesh Dattaram Dalvi, treasurer at Lalbaugcha Raja Sarvajanik Ganeshotsav Mandal, quoted in the agency's social media post on platform X on September 8. The Ganeshotsav even received in foreign currencies like the US dollar, Singaporean dollar, and the Australian dollar, among others, according to the report. Other than the Ambanis and RBI Governor Shaktikanta Das, even multiple Bollywood celebrities including Shah Rukh Khan, Kartik Aaryan, Vicky Kaushal, Varun Dhawan, Niel Nitin Mukesh and Boman Irani also visited Lalbaugcha Raja Ganeshotsav earlier on Saturday, September 7. On September 6, the local news portal Lokmat reported that and the Reliance Foundation gifted a 20-kilogram gold crown to Lalbaugcha Raja to mark the Ganeshotsav celebrations. Anant Ambani's gold crown contribution took more than two months, as per the news portal report. This reflected a relationship with Lalbaugcha Raja, who has been associated with the Ganeshotsav for more than 15 years, as per the report.",
        "title": "Ganpati 2024: Mukesh Ambani visits Lalbaugcha Raja in Mumbai with son Anant | Watch | Today News",
        "date/time": "13 Sep 2024, 11:05 PM IST",
        "author": "Anubhav Mukherjee",
        "author_url": "https://www.livemint.com/authors/anubhav-mukherjee"
    },
    {
        "url": "https://www.livemint.com/news/india/arvind-kejriwal-gets-bail-in-cbi-case-on-terms-and-conditions-dos-and-donts-supreme-court-reservation-11726208737784.html",
        "content": "Arvind Kejriwal, the Delhi Chief Minister and Aam Aadmi Party national convenor, was granted bail by the Supreme Court in connection with the alleged Delhi excise policy scam case on Friday. The Supreme Court, however, put before him certain conditions he must comply with during his time out on bail. On Friday, September 13, filed by the Central Bureau of Investigation . bail to the Delhi chief minister in a money laundering case linked to the same excise policy case. The Supreme Court had . The Supreme Court dictated that while out on bail. \"Regarding building a public narrative of a case...Arvind Kejriwal shall not make any public comments about this case and be present for all hearings before the trial court unless exempted,\" Justice Surya Kant was quoted by Bar and Bench as saying. The Supreme Court said all the conditions imposed on Kejriwal when he was granted bail in the Enforcement Directorate case linked to the same matter \"shall apply in this case also.\" The He shall furnish bail bonds in the sum of 50,000/- with one surety of the like amount to the satisfaction of the Jail Superintendent; He shall not visit the Office of the Chief Minister and the Delhi Secretariat. He shall be bound by the statement made on his behalf that he shall not sign official files unless it is required and necessary for obtaining clearance/approval of the Lieutenant Governor of Delhi. He will not make any comment with regard to his role in the present case. He will not interact with any of the witnesses and/or have access to any official files connected with the case. However, Justice Bhuyan expressed his reservations with the conditions previously prescribed by the \"I have serious reservations on the conditions which bar Kejriwal from entering Secretariat or signing files, but I am not making a comment due to judicial restraint as it was in a different ED case,\" he was quoted by Bar and Bench as saying.",
        "title": "Arvind Kejriwal gets bail in CBI case on terms and conditions: Do’s and Don’ts | Today News",
        "date/time": "13 Sep 2024, 12:06 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/rg-kar-doctor-rape-murder-case-kolkata-court-turns-down-cbi-request-for-narco-test-of-accused-sanjay-roy-11726229097325.html",
        "content": "A Kolkata court has rejected calls for a narco analysis test on Sanjay Roy — the . The CBI had sought the test to cross-check and verify the version of events narrated by the accused. The development came amid continued outrage over the attack and an ongoing 'cease work' agitation by junior doctors. An individual is injected with sodium pentothal during a narco analysis test in order to induce a ‘hypnotic’ state. CBI officials told PTI that the imagination is neutralised once the drug takes effect and the accused typically divulges true information. Roy — a Kolkata Police civic volunteer — was brought to the Sealdah court on Friday and a judge spoke to him personally in order to ascertain whether he had any objections to the test. CBI sources told PTI that Roy had initially agreed to take the test but later changed his mind. The request was turned down after the accused refused to give his consent for a narco analysis test. Earlier on Thursday, . An official told PTI that the data could play a vital role as evidence in the case. \"There were bite marks on the body of the woman and the post-mortem report has mentioned those. Our idea is to match those with the accused's dental impression,\" he told PTI. . Meanwhile the Mamata Banerjee-led Trinamool Congress government has repeatedly sought the death penalty for the culprits in the case once the CBI investigation was completed. “I am ready to resign from the Chief Minister of West Bengal. I am not concerned about the post. I want justice for the victim, I am only concerned about ordinary people getting medical service,” she told protesting junior doctors on Thursday evening.",
        "title": "RG Kar doctor rape-murder case: Kolkata court turns down CBI request for narco test of accused Sanjay Roy | Today News",
        "date/time": "13 Sep 2024, 06:39 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/port-blair-renamed-sri-vijaya-puram-amit-shah-says-decision-taken-to-free-nation-from-colonial-imprints-11726227791988.html",
        "content": "Port Blair renamed: The central government on Friday announced the decision to rename as ‘Sri Vijaya Puram’. Union Home Minister said Sri Vijaya Puram symbolises the victory achieved in the country's and the Andaman and Nicobar Islands' unique role in it. \"To free the nation from the colonial imprints, today we have decided to rename Port Blair as Sri Vijaya Puram,\" the Union home minister said. Taking to microblogging platform X , Home Minister Shah said have an unparalleled place in India's freedom struggle. It is the place that hosted the first unfurling of Tiranga by . Remembering Veer Savarkar, the home minister said the place also houses the cellular jail in which and other freedom fighters struggled for an independent India. Shah further said the island territory that once served as the naval base of the is today poised to be the critical base for the nation's strategic and development aspirations. It is important to note that Port Blair, the capital city of the Andaman and Nicobar Islands—a union territory—was named after Captain Archibald Blair, a British colonial navy official of the . The city is home to several museums and the major naval base INS Jarawa of the , along with sea and air bases of the Indian Coast Guard, Andaman and Nicobar Police, Andaman and Nicobar Command, the first integrated tri-command between the Indian Armed Forces, and the navy. Earlier in July, the government renamed the 's iconic 'Durbar Hall' and 'Ashok Hall' as 'Ganatantra Mandap' and 'Ashok Mandap', respectively. \"There has been a consistent endeavour to make the ambience of the Rashtrapati Bhavan reflective of the and ethos,\" the President's Secretariat said.",
        "title": "Port Blair renamed Sri Vijaya Puram, Amit Shah says decision taken ’to free nation from colonial imprints’ | Today News",
        "date/time": "13 Sep 2024, 05:20 PM IST",
        "author": "Deepak Upadhyay",
        "author_url": "https://www.livemint.com/authors/deepak-upadhyay"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/personal-loans-is-it-wise-to-borrow-money-to-repay-existing-debts-heres-what-you-need-to-know-credit-score-11725991402977.html",
        "content": "Do you have multiple loans to repay and worry that settling them all will take a long time? While there are several strategies for managing debt, one option is to use a new to pay off . Although this approach may seem risky, and some might warn against it to avoid falling into a debt trap, it can be a practical solution under certain conditions. It might not be as bad an idea as some may make it appear. For example, if you have 2 lakh in with a 24 percent annual interest rate, 3 lakh in a personal loan at a 12 percent annual interest rate, and 1.5 lakh borrowed from a friend, sticking with the status quo may not always be the best choice. Now, the potential benefits are significant if you have an offer for a fresh personal loan at an of 10.5 percent. 1. A new loan with more favourable terms can reduce your overall interest payments. 2. A fresh loan with a lower amount and better terms may result in lower monthly due to a restarted tenure. 3. Consolidating multiple loans into one can ease the burden of handling numerous loan payments. 4. Personal loans are , meaning you do not need to provide collateral. “Sometimes people follow the rule of thumb where they are told to avoid taking a loan to repay a loan. However, there could be certain situations where this may be favourable, particularly when the rate of interest is lower, and the processing fee does not negate the saving,” says Deepak Aggarwal, a Delhi-based chartered accountant and wealth advisor. “However, the borrower must ensure that there are not too many hidden costs or a high cost of . The one-time cost can be staggered to compute the monthly cash outgo. That is the way to do a fair comparison,” he adds. 1. Ensure that the processing fee is nominal and does not wipe out or offset the savings from consolidating your debt. 2. : Some banks may levy hidden fees or costs to woo new clients. Be careful about such charges before committing to a new loan. 3. : Be aware of whether the interest rate is fixed or variable. A variable rate would increase as the interest rates rise, affecting future payments. So, the interest rate ought to be fixed for a fair assessment. 4. : Switching to a smaller financial institution to save little money is not advisable. Consider sticking with established banks with extensive branch networks and efficient customer service unless the cost savings from a smaller institution are substantial.",
        "title": "Personal loans: Is it wise to borrow money to repay existing debts? Here’s what you need to know | Mint",
        "date/time": "12 Sep 2024, 09:48 AM IST",
        "author": "MintGenie Team",
        "author_url": "https://www.livemint.com/authors/mintgenie-team"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/is-your-health-insurance-plan-being-withdrawn-heres-how-to-quickly-adjust-and-stay-protected-tata-aig-hdfc-ergo-11725880669874.html",
        "content": "General Insurance has withdrawn its ‘Medicare Protect Plan’ with effect from September 5. The move will not impact customers who have to renew their policies within 90 days from the date of the withdrawal of the product. Tata joins SBI and HDFC Ergo, which announced withdrawal of its health insurance policies recently. While HDFC Ergo pulled out three variants of its ‘Suraksha’ policy in May, SBI announced in June that it is withdrawing its ‘Arogya Plus’ policy with effect from October 5. The withdrawal of ‘Medicare Protect’, which is a basic that comes with a sum insured of 2 lakh to 5 lakh offering a wide range of benefits including maternity cover, could lead to higher premiums for existing policyholders during migration, industry observers said. Here are a few things that you should know when your health insurance policy is withdrawn. When a policy is withdrawn, it simply means that it is not available for new purchases. Insurance Regulatory Development Authority of India has mandated that existing customers of a withdrawn product shall be provided a one-time option to renew the existing product if renewal falls within 90 days from the date of withdrawal of the product. “Policies due for renewal within 90 days from the date of withdrawal of the product would be eligible for renewal . We request you to renew the policy before the expiry date to enjoy continuity of your insurance coverage,” Tata AIG said in a communication to its policyholders. IRDAI has stipulated that policyholders can also migrate to any other suitable product as per her/his choice. “Policies due for renewal 90 days after the withdrawal of the product will have the option to migrate to a suitable product,” Tata AIG said. “A separate product migration letter providing coverage, terms and conditions and premium details of the product would reach you before the renewal due date,” it said. Policyholders will not lose any of their existing basic benefits due to the withdrawal. “We assure you that your continuity benefits with respect to pre-existing diseases waiting period, specified disease/procedure waiting period, 30 days waiting period and cumulative bonus would be transferred to the suitable health insurance product offered by Tata AIG as per the IRDAI provisions,” the insurer said in its communication. But Medicare Protect's policyholders may not get the same set of features when they migrate/port to a new health insurance plan. Medicare Protect’s family floater plan covers the proposer , spouse, three dependent children and two dependent parents. The policy even covers maternity expenses, which is capped at 50000 and all payments made towards consumables during hospitalisation. The policy does not have co-payment where the has to pay a stipulated percentage of the claim amount. ‘Medicare Protect’ also offers ‘restoration benefits’ wherein an additional amount equivalent to the base sum insured will be restored if the original cover is exhausted due to high claims. The option is available once during the policy period. Medical expenses incurred for in-patient treatment for AYUSH are also covered under the policy. Since the insurer has withdrawn the product, a new product that the chooses will have a different premium. Some experts believe that the migration would result in higher premiums. “Customers will be migrated to other suitable insurance products! Indirect way to move customers to superior products to increase the premiums,” Nikhil Jha, who follows the life and health insurance sectors closely, posted on X . “Same happened with HDFC ergo, suraksha policy moved to optima restore and my premium was increased from 18K to 26K,” a user wrote on X. “I think it's important to look at the bigger picture. Are they really putting their customers first, or are they just trying to boost their bottom line? Apply common sense,” another user said on X.",
        "title": "Is your health insurance plan being withdrawn? Here’s how to quickly adjust and stay protected | Mint",
        "date/time": "12 Sep 2024, 12:27 PM IST",
        "author": "Allirajan Muthusamy",
        "author_url": "https://www.livemint.com/authors/allirajan-muthusamy"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/best-credit-cards-2024-these-are-the-best-cards-offered-by-top-banks-reward-points-benefits-hdfc-icici-kotak-11726057490988.html",
        "content": "If you are planning to subscribe to a new credit card, it is recommended to first compare the features of different offered by a number of banks. These key features include the reward points, eligibility, renewal fee and other benefits such as . There could be some features which are common among most of the credit cards. Here we give a lowdown on some of the features of top credit cards 2024 by the top banks which are , ICICI Bank, and . Let us find out more on this here: These are some of the best credit cards in 2024: 1. Joining/ renewal membership fee: 1,000 plus taxes. 2. If you spend one lakh or more in one year before the renewal date to get your fee waived off. 3. Cashback will be given in the form of reward points which can be redeemed against the statement balance. 4. The minimum reward points balance required for redemption against the statement balance is 500 reward points. 5. Reward points can be redeemed into air miles at the conversion rate of 1RP = 0.30. 6. The redemption against the statement balance will be at the rate of 1 reward point = Re 1. 7. Unredeemed reward points will expire after two years of accumulation. You can access more details of Diners Club Millennia Credit Card : The private bank offers a number of credit cards which include Emerald Private Metal Credit Card, Emeralde Credit Card, Sapphiro Credit Card, Rubyx Credit Card, Coral Credit Card, Manchester United Platinum Credit Card, Manchester United Signature Credit Card and Platinum Credit Card. Here, we share some of the key features of ICICI Bank’s different credit cards: These are the key features of Emeralde Private Metal Credit Card: 1. The joining fee is 12,500 + GST. There is one complimentary night stay with Epicure plus membership . 2. Card holders are also offered a complimentary EazyDiner Prime Membership every year. 3. The card holders are also given 12,500 ICICI Bank Reward Points as joining bonus and annual bonus. 4. Card holders are also entitled to receive two EaseMyTrip Air Travel Vouchers worth 3,000 each on first 4,00,000 spends and next 4,00,000 spends. The key features include the following: 1. The joining fee is 12,000 plus GST. 2. Unlimited complimentary domestic and international lounge access. 3. Unlimited complimentary spa access at airports in India. 4. BOGO offer on movie & event tickets: Up to four times every month on tickets worth up to 750 5. Up to four rounds of complimentary golf basis the applicable spends on the previous month. The key features include the following: 1. The joining fee is 6,500 plus GST. 2. Welcome vouchers worth Rs. 9000 are offered. 3. Buy one movie ticket, get 500 off on second ticket, on BookMyShow, twice per month 4. Two complimentary International Airport Lounge Access, per year 5. Four Complimentary Domestic Airport Lounge Access, per quarter The key features include the following: 1. The joining fee is 3,000 plus GST. 2. Welcome vouchers worth 5,000. 3. 25 per cent discount on movie tickets, on BookMyShow and Inox, twice per month. 4. Air Accident insurance of 1 crore and lost card liability 50,000. 5. Two complimentary rounds of golf per month. The key features include the following: 1. The joining fee is 500/ NIL. Annual fee is also the same. 2. 25 per cent discount on movie tickets, on BookMyShow and Inox, twice per month. 3. One complimentary railway and domestic airport lounge access, per quarter. 4. One percent fuel surcharge waiver at HPCL Petrol Pumps. The key features include the following: 1. The joining fee is 499 plus GST. Annual fee is also the same. 2. Complimentary Manchester United Football 3. Up to 3 reward points per Rs. 100 spent 4. 25 per cent off up to 100 on selected cinema ticket retailers 5. One complimentary Airport Lounge Access per quarter The key features include the following: 1. The joining fee is 2499+GST, and so is the annual fee. 2. Complimentary Manchester United Football and Holdall 3. Up to five reward points per Rs. 100 spent 4. 25 per cent off up to 150 on selected cinema ticket retailers 5. Two Complimentary Airport Lounge Access/quarter 1. There is no joining or annual fee. 2. Two Rewards Points per Rs. 100 spent, except Fuel 3. One percent fuel surcharge waiver at HPCL petrol pumps You can get more details about these credit cards offered by ICICI Bank . Kotak Mahindra Bank offers Kotak 811 Credit Card online. 1. 500 bonus reward points on spending 5,000 within 45 days of card set up. 2. Two reward points against every 100 spent online. 3. Annual fee waiver on retail spends of 50,000 in the previous anniversary year. 4. 750 cashback on spending 75,000 in the previous anniversary year. You can get more details about the credit card offered by Kotak Mahindra Bank . Standard Chartered Bank offers a number of credit cards. These include the following: 1. There is no joining fee. 2. Get four times rewards on all retail spends plus bonus 4 times rewards on monthly spends over 20,000. 3. You stand to get lounge access per calendar quarter. 1. Flat 20 per cent off on hotels and 10 percent off flights. 2. You stand to get 10 times rewards for 100 spent at standalone hotel and airline websites/apps/outlets. 3. Free lounge access -- one domestic per calendar quarter and two international per year. These are the key features: 1. There is 2 percent cashback on all online spends and 1 percent cashback on all other spends. 2. You can convert your eligible transactions into a three-month EMI and pay a special interest rate of 0.99 per cent per month with no processing fee. 3. You stand to get an extended 90-day interest free period after issuance by paying the minimum due. These are the key features: 1. Complimentary domestic airport lounge access per quarter. 2. 5 percent cashback on all duty free spends. 3. 5 reward points for every 150 spent. Each reward point is worth Re 1. You can get more details about the credit cards offered by Standard Chartered Bank . These are some of the credit cards offered by IDBI Bank These are the key features: 1. You will earn 3 Delight Points for every Rs. 100 spent. 2. You will earn a welcome gift of 750 Delight Points on first usage of the card within 30 days or 400 Delight Points on usage between 31 to 90 days from the card issuance date. 3. The minimum eligible transaction value for the welcome gift is 1,500. These are the key features: 1. Euphoria World Credit Card caters to card holder's travel needs. 2. You can earn six Delight Points for every 100 you spend on travel related expenses viz. Hotels, Airlines, IRCTC, Bus Bookings etc. or earn 3 Delight Points on every other spent, which can be redeemed against a wide range of handpicked gifts and souvenirs to suit your lifestyle and preferences. 3. You can also choose to redeem your Delight Points as cash back in your account. 1. You will earn 2 Delight Points for every 150 spent by you using your Aspire Platinum Card; so enjoy travelling, shopping, dining-out or watching movies, and get rewarded for all your spends. 2. Additionally, you will earn a welcome gift of 500 Delight Points on first usage of the card within 30 days or 300 Delight Points on usage between 31 to 90 days from the card issuance date. 3. The minimum eligible transaction value for the welcome gift is 1,500. 1. You will earn two Delight Points for every 150 spent on shopping, watching movies, travelling etc. 2. Earn Delight Points which can be redeemed against irresistible offers from globally renowned brands. 3. The card comes with a welcome bonus of 500 Delight Points. 4. Earn your free Delight Points with a minimum single transaction of Rs. 1500 using your Imperium Platinum Credit Card within 30 days or 300 points between 31 - 90 days from the date of receiving your card. 5. Enjoy a credit limit as high as 85 per cent of your Fixed deposit. 1. You will earn 2 Delight Points for every Rs. 100 spent on your card. 2. Get irresistible offers from globally renowned brands redeemable against your Delight Points. 3. You can also earn 500 more Delight Points with just 5 transactions of value Rs. 1000 each per month. 4. Get double Delight points on your Birthday month. You can get details about IDBI Bank credit cards .",
        "title": "Best Credit Cards 2024: These are the best cards offered by the top banks based on reward points | Mint",
        "date/time": "12 Sep 2024, 09:57 AM IST",
        "author": "MintGenie Team",
        "author_url": "https://www.livemint.com/authors/mintgenie-team"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/credit-cards-banks-offer-these-latest-offers-and-deals-check-details-here-hdfc-bank-icici-idbi-bank-sbi-axis-bank-11726209688030.html",
        "content": "If you own a , you can explore a number of offers given by banks. These include the offers at eateries and restaurants in your city and beyond. It is recommended to check these offers before they expire. These offers are given by the cards issued by almost all top banks such as , , and . Here we present a listicle of sorts of offers to help you decide whether you wish to avail one or more of these. But remember that almost all of these offers are time bound. So, you wouldn’t want to avail any of these unless you were, anyway, planning to buy a similar product or service during this time. Otherwise, spending 100 to save 20 doesn't make sense at all, ain't it? Before much ado, we share specific details of which credit card is offering what. So, here it goes. Here are the offers that you may want to explore: These offers will expire on Oct 30, 2024 1. Hometown: 5 percent off on furniture and 15 percent off on modular kitchen 2. Mad over donuts: 15 percent off on minimum billing of 700. 3. Lookwell Salon: 15 percent off on total bill. 1. 10 percent off up to 3000 on Kotak credit card EMI 2. 40 percent off on shopping worth 400 and above at Organic Harvest using Kotak Mahindra Bank credit card. 3. Get 15% additional off on shopping using Kotak Mahindra Bank credit card. 4. 8000 Instant cashback on Kotak Credit Card EMI. 5. You can get 15% off on gym and accessories shopping at the Cube club using Kotak Mahindra Bank credit card. This card comes with no joining fee and no annual fees. You are entitled to save money when refuelling by getting a discount on fuel surcharge. You can earn ICICI Bank reward points for gifts and vouchers. Axis Bank credit card offers these deals: 1. 5% off on Max Fashion. It expires on Nov 3, 2024 2. Instant discount upto 8,000 on iPhone. The deal expires on Oct 2, 2024. 3. 20 percent instant discount on flights and hotels on Goibibo. The deal expires on Sept 25, 2024. 4. EMI offer is given by Samsung. The deal expires on Sept 30, 2024. 5. Flat 300 instant discount on Amazon Fresh. It expires on Sept 25, 2024. SBI card offers these special discounts and offers: 1. Flat 100 instant discount on Swiggy. 2. Up to 7.5 percent on Ather. 3. 5% extra cashback on Blackberrys 1. Up to 20 percent on Swiggy Instamart upto 150. The offer will be valid till Nov 30, 2024. The coupon code is IDBI150. 2. Upto 20 percent off on Swiggy Food up to 150. The coupon code is IDBI150 and the offer is valid till Nov 30, 2024. 3. On BookMyShow, the IDBI Bank credit card offers an instant discount of 25 percent up to 300 on purchase of tickers through app or web. 4. Flat 25 percent instant discount on PVR, INOX upto 150 on platinum and signature cards, and upto 75 on other cards.",
        "title": "Credit Cards: Banks offer these latest offers and deals; check details here | Mint",
        "date/time": "13 Sep 2024, 12:34 PM IST",
        "author": "MintGenie Team",
        "author_url": "https://www.livemint.com/authors/mintgenie-team"
    },
    {
        "url": "https://www.livemint.com/companies/news/state-department-diplomatic-security-officer-pleads-guilty-to-storming-capitol-11726259912216.html",
        "content": "WASHINGTON — A man who worked as a U.S. State Department diplomatic security officer pleaded guilty on Friday to joining a mob's attack on the U.S. Capitol over three years ago, court records show. is scheduled to be sentenced on Feb. 12 by U.S. District Judge Randolph Moss. Alstrup pleaded guilty to disorderly conduct and parading, demonstrating or picketing in a Capitol building. Both counts are misdemeanors carrying a maximum prison sentence of six months. An attorney who represented Alstrup at his plea hearing didn't immediately respond to an email seeking comment. A State Department spokesperson said Alstrup was a contractor who worked as a uniformed guard for the State Department starting in 2010. He no longer works at the department, the spokesperson said in an email. Alstrup that he entered the Capitol building through the Senate Wing doors after other rioters had forced them open and broken windows aside them. He took photographs with a camera before leaving the building roughly 28 minutes after entering. Alstrup was arrested in February in Washington, D.C., where he lived on Jan. 6. The judge allowed him to remain free until his sentencing. The FBI determined that Alstrup, through his State Department work, “is familiar with providing security and protection for high-ranking government officials or sensitive locations, like embassies.” One of Alstrup's supervisors identified him in a photograph of the riot, the FBI said. At a press briefing on Friday, State Department spokesman Matthew Miller said that \"we fully support the work by our colleagues at the Department of Justice to hold anyone responsible for violations of law on that horrific day accountable for those violations.” Approximately 1,500 people have been charged with Capitol riot-related federal crimes. More than 900 of them have pleaded guilty. Over 200 others have been convicted by judges or juries after trials. ___ Associated Press reporter Matt Lee in Washington contributed.",
        "title": "State Department diplomatic security officer pleads guilty to storming Capitol",
        "date/time": "14 Sep 2024, 02:08 AM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/business-loans-7-game-changing-factors-that-determine-your-interest-rate-credit-score-credit-card-11726126624938.html",
        "content": "Funding is one of the biggest requirements for most businesses to survive or sustain. Funding can come from equity, debt, or other sources. Many organisations rely on for their various needs. Lenders consider several parameters to decide whether the business is eligible for a loan and what should be the interest rate charged. Let us look at some factors lenders consider to determine the interest rate on business loans. Factors considered for determining the interest rate on business loans: Banks and NBFCs use the credit score to determine the borrower's creditworthiness. Based on the , they decide whether the loan should be given and at what interest rate. A credit score of 750 and above is considered healthy for a loan. The higher the credit score, the better. If the credit score is higher than a specified number, some banks may offer a loan at a lower interest rate and better terms. The bank may consider a low credit score as a sign of poor credit history. Such profiles are considered risky. The bank may either decline the loan proposal or insist on collateral or offer the loan at a higher interest rate. To improve your credit score, always pay all loan and bills on time. Apart from timely repayments, maintain a credit utilisation ratio of 30% or lower, maintain a healthy mix of secured and unsecured credit, don’t apply for a loan with multiple banks/NBFCs simultaneously or within a short duration, etc. The security against which the loan is availed is known as collateral. If your business loan is secured with , the interest rate charged will be lower than an unsecured loan. The security offered can be related to your business, such as machinery, stock, etc., or personal, such as your residential property, etc. The type of loan influences the interest rate. For example, a secured loan is offered at a lower interest rate, and an unsecured loan is offered at a higher interest rate. Similarly, whether the business loan comes under priority sector lending or not influences the interest rate. For example, business loans related to agriculture, MSMEs, education, housing, social infrastructure, renewable energy, etc., come under priority sector lending. Banks have targets for priority sector lending. Hence, if your business comes under priority sector lending, your business loan may get some preference and may come at a lower interest rate than other business loans. Another important consideration in the business loan interest rate is the type of loan: fixed or floating. In a fixed-interest rate loan, the EMI stays constant. A floating interest rate is linked to a benchmark like the repo rate. As the repo rate changes, the interest rate on the loan will be revised. A fixed-rate business loan comes at a higher interest rate than a floating interest rate business loan. The current economic environment plays an important role in determining the market interest rates and, thereby, the on your loan. In a high inflation period, the market interest rates will be high, and hence, the interest rate on your business loan will be high. Similarly, in a low inflation period, the market interest rates will be low. Hence, you may get a business loan at a low interest rate. The bank will check the nature of the business to see if it is seasonal or speculative. Such businesses are considered riskier than others. Business loans to such firms come at a higher interest rate than others. The business history, i.e., the number of years it has existed, also plays an important role. The longer the business has existed, the more the number of business cycles it has survived. The long history of existence shows the business is resilient and can survive adverse economic conditions. The bank will analyse the business financials to determine the loan and interest rate. They will check the business balance sheet , profit and loss account, margins, cash flows, etc. If the business is profitable and generates healthy cash flows, the probability of getting a loan at a lower interest rate increases. The bank will also check the existing leverage, i.e. existing loans, and how much more leverage the business can handle. Along with the loan application, the bank may ask you to submit a business plan. The plan should have details like the purpose of the loan, the revenue and margin targets, the expected cash flows, etc. Make sure the business plan is robust. Do you have an existing relationship with the lender in the form of current accounts, deposits, or loans? If yes, the lender may give you the benefit of the existing relationship by offering a business loan at a lower interest rate than other borrowers. Business-related and external factors influence the business loan interest rate. You have no control over external factors like the current economic environment. If inflation is high, the interest rates will be higher. However, business-related factors like credit score, collateral, loan tenure, business financials, etc., are in your control. You can work on these factors and put your best foot forward to get a business loan at the lowest possible rate. When applying for a business loan, it is recommended that you compare the interest rate and loan features of various banks and NBFCs. You can do this online. Based on this comparison, you can shortlist 2-3 banks/NBFCs. You can meet their executives and take the discussion forward. You can then compare the loan offers from these banks/NBFCs and choose the one that suits your business requirements.",
        "title": "Business Loan: 7 game-changing factors that determine your interest rate | Mint",
        "date/time": "13 Sep 2024, 11:55 AM IST",
        "author": "Gopal Gidwani",
        "author_url": "https://www.livemint.com/authors/gopal-gidwani"
    },
    {
        "url": "https://www.livemint.com/money/ask-mint-money/can-a-single-coparcener-maintain-huf-status-tax-implications-explored-11726128494483.html",
        "content": "Since the mother was entitled to get a share equal to that of her son in the event of the partition and as required under the , a notional partition was assumed to have occurred upon her death. So her share would have been devolved on the husband and the son in their capacity, and the same would have become their individual property. Only the father was left after the son parted ways to get his share in the HUF assets. Since a single member can not constitute a , the incidence of the son getting his shares of assets in the HUF amounted to and resulted in the complete dissolution of the HUF. The father should have informed the income tax officer to recognise the complete partition that was consequent to the HUF partition. Though two coparceners are needed to initially constitute a HUF, an existing HUF may continue with one copier and other members. Please note that a HUF cannot continue with the sole copier alone; thus, it ends. As per the income tax laws, the full fact of the complete partition must be recorded by the income tax officer by passing an order. Until the order is passed, the HUF with the combined assets will continue in the status of the HUF. The income accruing to the son on the properties given away to him will continue to be taxed in the hands of the HUF. The father cannot continue with the assets left under the status of a HUF. After the partition, the assets left in the HUF belong to him, and income arising and accruing concerning such assets should be included in his personal ITR along with his regular income. After the father's death, all the assets owned by him, along with the assets devolved on him from the HUF, will be inherited by the son unless the father makes a valid will bequeathing the assets to someone else.",
        "title": "Can a single coparcener maintain HUF status? Tax implications explored | Mint",
        "date/time": "12 Sep 2024, 02:52 PM IST",
        "author": "Balwant Jain",
        "author_url": "https://www.livemint.com/authors/balwant-jain"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/bluechip-stocks-vs-sme-ipos-which-is-better-for-whom-explained-11726115208227.html",
        "content": "Amid the growing excitement surrounding Small and Medium Enterprises Initial Public Offerings , investors are increasingly drawn to the high-growth potential these offerings present. SME IPOs have recently captured significant attention due to their substantial listing day gains. When evaluating investment options for long-term growth, choosing between blue-chip stocks and SME IPOs is critical. Blue-chip stocks are shares of large-cap companies renowned for their stability and reliability. These established companies have a strong track record of steady growth, making them a preferred choice for long-term investors who do not have the stomach for risk. In contrast, can be a good option for those willing to accept higher risks in exchange for greater returns. Market experts say that blue-chip stocks have the potential to deliver alpha returns—returns that exceed the average market performance, whereas investing in SME IPOs during a bull market can be advantageous, especially if you are making a significant investment. In a bullish market, high-quality SME IPOs can offer substantial short-term gains. Ultimately, the choice between blue-chip stocks and SME IPOs hinges on an investor's risk tolerance and financial objectives. To clarify which option might be better suited for different types of investors, consulted market experts. \"Blue-chip and SME stocks offer different opportunities for long-term investing. Blue-chip stocks, or , are ideal for conservative investors seeking stability and consistent performance. They are less volatile and provide a reliable path to capital appreciation, even though they might not deliver the rapid growth seen with SME stocks. On the other hand, with their significant growth potential, SMEs carry higher risks due to their susceptibility to market fluctuations and operational challenges. Fundamentally strong SME stocks can be highly rewarding for those willing to accept these risks. However, conservative investors may prefer the stability and resilience of blue-chip stocks,\" said Dr Ravi Singh, SVP - Retail Research at Religare Broking. \"The stability of large-cap companies, as evidenced by the success of investors like Warren Buffett, highlights their value for long-term capital growth. Blue-chip stocks, though slower-growing compared to SME IPOs, offer steady gains and a strong foundation for a resilient investment portfolio. While SME IPOs can provide exciting opportunities, blue-chip stocks remain essential for investors looking to weather economic downturns and achieve reliable long-term returns,\" added Siddharth Maurya, Founder & Managing Director of Vibhavangal Anukulakara Private Limited. Several companies have achieved exceptional listing day gains in the SME IPO market, showcasing strong investor enthusiasm. Winsol Engineers Limited topped the list with a remarkable 411.00% gain on its debut, which took place on May 14, 2024. Close behind, Kay Cee Energy & Infra Limited saw a notable listing day gain of 343.33% when it was listed on January 5, 2024. Medicamen Organics Limited followed with a significant gain of 325.59% on June 28, 2024. GP Eco Solutions India Limited also performed exceptionally well, with a listing day gain of 318.88% on June 24, 2024. Rounding out the top five, Maxposure Limited achieved a 317.42% gain on its first trading day, January 23, 2024. These substantial gains reflect the strong market reception and investor interest in these SME IPOs.",
        "title": "Blue-chip stocks vs SME IPOs: Which is better for whom— Explained | Mint",
        "date/time": "12 Sep 2024, 11:16 AM IST",
        "author": "Sangeeta Ojha",
        "author_url": "https://www.livemint.com/authors/sangeeta-ojha"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/what-is-auto-top-up-of-upi-lite-key-details-of-new-feature-to-be-added-from-oct-31-npci-rbi-digital-payments-11726142635168.html",
        "content": "If you are using UPI Lite for small-value transactions, then there is good news for you. Starting October 31, you will be able to use for reloading the amount of your choice in your account. By issuing a circular dated August 27, the ) has announced that this UPI Lite feature will soon go live with effect from October 31 this year. The UPI Lite balance will be automatically reloaded by an amount chosen by the user. This is meant to facilitate the PIN-less transactions below 500 with a maximum UPI Lite balance limit of 2,000 at any point of time. However, it is vital to note that the reloading will not lead to exceeding of UPI Lite balance limit, which is 2,000. Additionally, the users will also be able to revoke the auto top-up mandate at any time, reads the NPCI circular. It is a that enables users of UPI to make small-value transactions without entering the PIN. These transactions take place without using the remitter’s bank’s core banking systems, thus leading to uncluttered passbook for users. On UPI Lite, user can simply open the app and make the payment without having to enter the PIN. 1. NPCI has directed that the issuer banks will support the functionality of auto top-up on UPI Lite wherein the banks should allow creation of UPI Lite mandate and allow debits whenever the request comes from the PSP/App. 2. NPCI has also directed that the UPI apps will support the necessary functionality and interface on their app in order for customers to use auto top-up on UPI Lite. 3. Additionally, members are supposed to ensure that the mandate created are executed successfully. All the necessary validation should be present at the time of mandate creation. 4. But the number of auto-replenishment transactions are to be restricted to five in a day for each UPI Lite account. NPCI is projecting UPI Lite as a customer-friendly approach to enable low-value transactions without utilising a remitter bank’s core banking systems in real-time, while providing adequate risk mitigation.",
        "title": "What is auto top-up of UPI Lite? New feature to be rolled out from Oct 31 — all you need to know | Mint",
        "date/time": "12 Sep 2024, 06:30 PM IST",
        "author": "MintGenie Team",
        "author_url": "https://www.livemint.com/authors/mintgenie-team"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/how-to-protect-yourself-from-financial-scams-here-are-7-ways-financial-frauds-investments-11725880432004.html",
        "content": "These are some of the classic hooks used by fraudsters to lure unsuspecting investors with promises of extraordinary returns. Sadly, these scams often target regions with low , like the Northeastern parts of India. Recently, Guwahati Police arrested several individuals who scammed people out of thousands of crores. These fraudsters, disguised as stock market experts, convinced people to invest with them by promising guaranteed . Let’s take a closer look at some of the tactics these scammers use, and most importantly, how you can safeguard yourself from falling into their trap. The first red flag is when these ‘so-called’ experts ask you to money into individual bank accounts instead of creating an investment account. These people will claim that direct payments will bypass middlemen and reduce fees which makes it sound appealing. However, when they take money in their personal accounts, it makes it easier for them to disappear with your money easily. Hence, it is essential to verify the credibility of the financial institution and ensure you're paying into a legitimate account. Before transferring any money, do thorough research on the company or individual you’re dealing with. A quick search for reviews, complaints, or negative experiences could save you from being scammed. Remember, legitimate companies will never ask you to make payments into an individual’s bank account. One of the most common tactics used by scammers is guaranteeing high monthly returns—often as much as 10-12%. They also mention that they don’t have to take any of the risk associated with stock market and trading. Investments that promise high returns with little to no risk are almost always fraudulent. However, most of us are aware that every investment including low risk investment options carry risk. Hence, it is important to ask detailed questions about where the money will be invested and how such returns will be generated. Be especially cautious if the answers seem vague or overly complex. Fraudsters often ask for large sums of money, presenting the opportunity as a once-in-a-lifetime chance that is only available to serious . This sense of exclusivity and urgency is a deliberate tactic to make you feel pressured into acting quickly. You may be told that the opportunity is only available to a limited number of people, increasing the fear of missing out . In such cases, it’s vital to take a step back and assess the situation logically. Ask why this opportunity requires such a large amount of money and compare it with similar investment opportunities. If others don’t require such a high commitment, this should raise concerns. Avoid making decisions in haste, especially when large sums of money are involved. Scammers know that creating a sense of urgency can lead people to make impulsive decisions. By using phrases like “limited-time offer” or “act now before it’s too late,” they put pressure on investors to act quickly without fully understanding the investment. The fear of missing out can push individuals to make hasty decisions, often leading them straight into a scam. It's important to remember that legitimate investment opportunities don't require immediate decisions. Take your time to review the investment, consult with trusted financial advisors, and weigh the pros and cons carefully. If the opportunity is genuine, it will still be available after you've done your research. Scammers, on the other hand, rely on people rushing into decisions. Another common tactic is showcasing fake success stories of people who have supposedly made substantial profits. Fraudsters will often provide glowing testimonials from people who don’t even exist or who are actually part of the scam. These stories are designed to make you believe that others have profited, encouraging you to follow suit. It’s essential to verify any success stories by asking for documentation, credentials, and contact information that can be cross-checked. If you're unable to fact-check these individuals, you should be extremely cautious. These people often use images of a luxurious lifestyle to attract investors. They may flaunt expensive cars, exotic vacations, and lavish homes to create the illusion that their leads to extraordinary wealth. And, who doesn’t want that? Instead of focusing on the lifestyle being portrayed, focus on understanding the investment itself. How does it generate returns? What is the risk involved? Analyzing the investment on its merits, rather than being dazzled by the promise of luxury, will help you avoid falling into this common scam. These people are skilled at preying on human weaknesses, particularly greed and vanity. They know their victim’s trigger points and focus on that. If you find yourself eager to show off your supposed future investment gains, it may be a sign that you’re being manipulated. It’s essential to remain level-headed when considering any opportunity. Don’t let emotions cloud your judgment. Instead, always research the opportunity and consult a financial expert to ensure it’s legitimate. In conclusion, the best way to protect yourself from financial scams is to remain vigilant. Always conduct thorough research before making any investments, follow your instincts, and seek out reviews from credible sources. If you’re ever in doubt, consult a professional financial advisor before transferring any money.",
        "title": "How to protect yourself from financial scams? Here are 7 ways | Mint",
        "date/time": "12 Sep 2024, 10:41 AM IST",
        "author": "Rahul Agarwal",
        "author_url": "https://www.livemint.com/authors/rahul-agarwal"
    },
    {
        "url": "https://www.livemint.com/money/why-have-tcs-employees-received-tax-demand-notices-and-what-to-do-if-you-get-one-11726226302775.html",
        "content": "Employees of India’s largest IT services company, Tata Consultancy Services , have received income tax notices about discrepancies in their tax deduction at source . Several employees received income due to discrepancies between the TDS credit in their Form 26AS, Annual Information Statement and the amount they claimed while filing their income tax return , according to a report by informed employees that the tax department would reprocess their ITRs to resolve the issue, the report added. Form 26AS is a statement of all tax-related information associated with the taxpayer’s Permanent Account Number . It includes details of tax deducted at source, tax collected at source, advance tax paid, self-assessment tax paid, or any refunds issued. The Annual Information Statement summarises a taxpayer's information mentioned in Form 26AS. Additionally, it shows data on shows interest, dividends, stock market transactions, transactions etc. Form 16 is the TDS certificate issued by the employer to certify the amount of tax deducted from the taxpayer’s salary. According to the report, if the TDS amount in Form 26 AS and AIS does not match with Part A of Form 16, the TDS amount must be corrected in Form 26AS and AIS. Taxpayers can only claim the TDS amount mentioned in Form 26AS. If the TDS amount is less than what is mentioned in Part A of Form 16, the taxpayer should contact the tax deductor to rectify the TDS return filed by the deductor to correct Form 26AS, the report added. The income tax department only credits the TDS amount shown in Form 26AS.",
        "title": "Why have TCS employees received tax demand notices, and what to do if you get one | Mint",
        "date/time": "13 Sep 2024, 05:44 PM IST",
        "author": "Riya R Alex",
        "author_url": "https://www.livemint.com/authors/riya-r-alex"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/tax-laws-explained-how-rent-payments-and-receipts-affect-your-tax-liability-11726121825990.html",
        "content": "Many investors are comfortable with equity and channel their surplus funds into real estate to gain the twin benefits of appreciation and rental income on such property. On the other hand, some people do not prefer to invest in a house for personal use and instead opt to pay rent for their accommodation. I discuss income tax laws around and rent received in this article. The higher of either the rent received, or the amount the property could reasonably be rented for is treated as annual value. The municipal taxes you've paid are first deducted from this annual value to determine the A flat deduction of 30 percent of the annual value , is allowed in respect of all rented properties. Under the old tax regime, you could claim a deduction for full interest paid on loans used for the property's purchase, construction, repair, or reconstruction under Section 24 for rented property. Please note that you can only set off a loss under the ‘house property’ head upto 2 lakh against other income. Any remaining unabsorbed loss during the current year can be carried forward against house property income for eight subsequent years. Under the new tax regime, you can claim interest paid on loans up to the taxable amount of rental income. No losses can be removed under the ‘house property’ head. As per the recent budget, rental income from house property can only be taxed under the “income from house property” head. If you sublet the property, the income becomes taxable under “Income from other sources.” Regarding loans taken on the under-construction property, interest deductions are allowed starting from the year in which the possession of the house is taken, with the deduction covering the full year even if possession is taken on the last day of the financial year. Interest paid during the construction period can be claimed in five equal annual instalments beginning from the year construction was completed and possession taken. So, if you transfer the house within five years from the end of the year in which possession was taken, you lose your right to claim interest for that period. For jointly owned property, the rental income is taxed based on each owner's share of contribution towards the property's purchase. This doesn't have to be an equal split. So, if your spouse’s name is added as a joint holder for smooth succession purposes without contributing to the property, no rental income can be taxed in her name. Many taxpayers incorrectly attribute rental income to their wife because she is listed as a joint holder of the property without any contribution—this is patently wrong. All salaried persons who receive House Rent Allowance from their employer can claim deductions on rent paid for accommodation they occupy but do not own. The deduction is restricted to the lowest of the following three: 1. HRAreceived 2. 50 percent of the basic salary for metro city residents, 40 percent for non-metro 3. Excess of rent paid over 10 percent of basic salary. This deduction is also available only under the old tax regime. As per the tax laws, there is no restriction on a person claiming both benefits, provided they satisfy the conditions prescribed in the respective sections. For example, if you stay in a house far away from your workplace and pay both EMI on your own house and rent for a separate residence, you can claim both deductions, even if your own house is not rented out. Like salaried people, self-employed individuals can claim a rent deduction under Section 80GG for rent paid that exceeds 10 percent of their total income, subject to a limit of Rs. 5,000 per month or 25% of total income, whichever is lower. This deduction is not available if the taxpayer owns any self-occupied property anywhere or if he, his spouse, his HUF, or dependent members own a house in the same place where he is staying. For individuals and HUF engaged in business or profession, with an annual turnover exceeding 1 crore or 50 lakh , they must deduct tax at 10 per cent on rent payments during the year if the total rent paid exceeds 2.40 lakh annually. Other individuals must deduct tax at 2 percent if the monthly rent exceeds 50,000. A TAN number is not required, but the landlord's PAN must be used to file the TDS return online. For rent paid to non-residents, there is no minimum threshold limit for rent, and tax must be deducted from the first rupee of rent paid. Tax is deducted at 30 percent on 70 percent of the rent paid to a non-resident. Please note that if you are paying rent to a non-resident, you must obtain a TAN number and deduct tax at source even if the monthly rent payable is below 50,000, as there is no threshold limit for payment to a non-resident.",
        "title": "Tax laws explained: How rent payments and receipts affect your tax liability | Mint",
        "date/time": "12 Sep 2024, 01:28 PM IST",
        "author": "Balwant Jain",
        "author_url": "https://www.livemint.com/authors/balwant-jain"
    },
    {
        "url": "https://www.livemint.com/money/ask-mint-money/understanding-capital-gains-tax-exemptions-for-esop-share-sales-11726119414058.html",
        "content": "Please note that the exemption under Section 54EC by investing the capital gains in capital gains bonds of specified financial institutions is available only for arising from land or buildings and not for any other assets. Secondly, as you mentioned, you can claim exemption from tax on long-term capital gains arising from the sale of any asset other than a residential house by investing in a residential house under Section 54F, not Section 54. To claim an exemption under Section 54F, you must invest the sale proceeds, not the capital gains you mentioned. So, for claiming exemption for long-term capital gains of Rs. 80 lakh, you will have to invest the full sale consideration received on the sale of ESOP shares for buying or constructing a residential house within the prescribed period. The residential house has to be bought within two years from the date of sale of the shares. If it is under construction, it must be completed within three years, and possession must be obtained. Please note that if the money is not used to acquire a residential house before the due date for filing the , 31 July 2025, you will have to deposit the balance amount in a Capital Gains Account in a scheduled bank. The money deposited in the Capital Gains Account can be used to make payments for the house within the prescribed time period.",
        "title": "Understanding capital gains tax exemptions for ESOP share sales | Mint",
        "date/time": "12 Sep 2024, 11:24 AM IST",
        "author": "Balwant Jain",
        "author_url": "https://www.livemint.com/authors/balwant-jain"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/credit-card-fees-exposed-can-you-be-charged-before-your-card-is-even-activated-credit-score-11726204625977.html",
        "content": "Can banks charge you a joining fee even before your credit card is activated? They cannot as the credit card account will not be created unless the card is activated. With complaints about banks charging a joining fee even before the card is activated, unsolicited cards being issued and the undue delay in closing the card account even after a formal request from the customer, here are a few things that you must know about credit card activation and related rules. A credit card is activated only when the customer does an authentication confirming her/his willingness in owning the card through an sent to her/his mobile number. The card will be considered activated even if you do not do any financial transaction. For instance, if you just set a PIN for the card, but do not use the card, it will be considered activated. “In addition to financial transactions, any process initiated by the cardholder such as generation of statement, change of PIN, change in transaction controls, etc., shall be considered for treating a card as ‘used’,” said in its circular on credit cards. However, any calls made to the customer care centre, for reasons other than those cited above, shall not be considered towards usage of a card, it said. “Customer-initiated processes indicating intent to use a credit card such as PIN generation, modification of transaction control, Interactive Voice Response, recorded call to the customer care centre and SMS may be considered as activation,” RBI said. Yes. If you do not activate your for more than 30 days from the day it was issued, card issuers will seek an OTP-based consent. “If the card is not activated by the cardholder for more than 30 days from the date of issuance, card-issuers shall seek OTP based consent,” RBI said. “If the cardholder does not provide consent, the card issuer has to close the credit card account within seven days of seeking consent,” it said. Any request to close the credit card should be processed within seven working days if there are no outstanding dues. Unsolicited credit cards are a dime a dozen these days. But you have to be careful with such cards as any unintentional act will activate the card. You should never give a consent for activating the unsolicited card either through an OTP or other modes. “If the customer receives an unsolicited card, she/he should refrain from activating or providing consent for activation of the card through OTP or any other means. If no consent is received for activating the card, the card-issuer is required to close the credit card account without any cost to the customer within seven working days from the date of seeking confirmation from the customer and shall also intimate the customer that the credit card account has been closed,” RBI said in its circular. “Subsequent to receiving the intimation from the card-issuer that the card account has been closed, the customer shall destroy the card. Further, the customer may file a complaint with the card-issuer against the issuance of unsolicited card and escalate it to the RBI Ombudsman as per ‘Integrated Ombudsman Scheme’,” the apex bank said. No. Unused cards will not have any impact on your . But there have been cases of information on unused cards being reported to credit bureaus. The RBI has said that card issuers should pull out such information within a month. “Credit card issuers can report information of a new credit card to credit bureaus only after the card is activated. Any information related to inactive reported to credit bureaus has to be withdrawn within 30 days from the date of sharing the details,” the apex bank said. No. The two are completely different. Deactivation and blocking of the card is a temporary measure done to shield the customer from any unauthorised usage due to loss/theft or other reasons. “De-activation/Blocking of a credit card temporarily curtails the ability of a cardholder to make any transaction in a credit card account while still maintaining the credit/account relationship with the card-issuer,” RBI said. “Closure of a credit card on the other hand amounts to termination of the account-based relationship between the cardholder and the card-issuer,” it said. If you have unpaid dues on your credit card but still want to close it, there is a prescribed procedure. “In case payment towards dues is outstanding, the card-issuer shall provide details regarding such outstanding dues to the cardholder upon receipt of the closure request without waiting for completion of the billing cycle and accordingly advise her/him to make payment in order to complete the closure process,” RBI said. “In such cases, the prescribed timeline of seven working days shall be calculated after excluding the number of days taken by the cardholder to clear the outstanding dues,” it said.",
        "title": "Credit card fees exposed: Can you be charged before your card is even activated? | Mint",
        "date/time": "13 Sep 2024, 12:23 PM IST",
        "author": "Allirajan Muthusamy",
        "author_url": "https://www.livemint.com/authors/allirajan-muthusamy"
    },
    {
        "url": "https://www.livemint.com/news/india/govt-to-form-golden-city-club-to-encourage-others-after-indore-named-cleanest-city-for-7-straight-years-11726232050500.html",
        "content": "New Delhi: The government will set up a ‘golden city club’ to give more states a change to rank top among those with the cleanest cities, Union housing and urban affairs minister Manohar Lal Khattar said on Friday. Indore won the title of India's cleanest city for the seventh consecutive year in 2023. “Indore has managed to hold the top position for years. Hence, we have decided that whoever comes first this time, we will fit it into a different category called ‘golden city club’. We will then keep the winning city aside and consider the next one on the list for the golden city club, thus creating a different competition to enter this club,” Khattar told reporters before the launch of the Swabhav Swachhata Sanskaar Swachhata campaign. In his Independence Day speech, Prime Minister Narendra Modi had said that the government's cleanliness efforts were driving significant changes across the nation. Taking this forward, the Jal Shakti ministry will launch the 4S campaign on the 10th anniversary of the Swachh Bharat Mission . It will be rolled out from 17 September to 2 October. Also read: Khattar also said an online portal would be developed to track the status of SBM and a that a cleanliness drive would be conducted before the start of the beginning of 4S campaign. About 85,000 places have already been identified for cleaning of garbage. Khattar added that 427 dumpsites across 4,500 acres have been cleaned up and will be transformed into urban areas. Under SBM-Urban 2.0, the Indian government plans to transform garbage dumps in urban areas to protect the environment and reduce health risks. Many states are taking steps to transform and beautify these garbage dumps. Also read: Under SBM-Gramin, more than 587,000 villages across India have achieved open defecation free-plus status as of September, with over 392,000 villages implementing solid waste management systems and about 495,000 setting up liquid waste management systems. In the case of SBM-Urban, about 6.3 million household toilets and more than 630,000 public toilets have been built, according to an official statement. The approved financial outlay 62,009 crore is for SBM-U phase 1 and 1.41 trillion for phase 2. The government also aims to clean 200,000 difficult and dirty spots during the 4S campaign, the theme of Swachh Bharat Mission this year, Union Minister for Housing and Urban Affairs, Khattar and Union minister for Jal Shakti C.R. Patil announced on Friday, informing that these spots will be mapped digitally. So far, about 85,000 such places have been identified, Khattar told reporters. At the launch event of the 4S campaign, both the ministers informed that central public sector undertakings, industry partners and non-profits were being encouraged to adopt cleanliness target units. The campaign includes mega cleanliness drives at various sites such as tourist locations, public buildings, commercial areas, community toilets, public toilets, water bodies, zoos, and sanctuaries. Khattar informed that about 2,300 dumpsites in urban areas with 220 million tonnes of waste had been identified, of which 427 dumpsites with 90 million tonnes of waste had been completely remediated, and 4,500 acres of land reclaimed.",
        "title": "Govt to form ‘golden city’ club to encourage others after Indore named cleanest city for 7 straight years | Today News",
        "date/time": "13 Sep 2024, 07:40 PM IST",
        "author": "Puja Das",
        "author_url": "https://www.livemint.com/authors/puja-das"
    },
    {
        "url": "https://www.livemint.com/news/india/usruled-bankruptcy-of-byju-s-units-countered-by-indian-official-11726250149406.html",
        "content": "-- A US court ruled that it will grant creditors’ request to put several units tied to struggling Indian education technology company Byju’s into bankruptcy, according to court papers filed on Thursday. The decision, made at a Tuesday hearing, will lead to involuntary Chapter 11 bankruptcy of Byju’s units including Neuron Fuel Inc., Epic! Creations Inc. and Tangible Play Inc., the papers showed. The order was made as a default judgment for discovery sanctions. The creditors, led by HPS Investment Partners, filed the petition in June, accusing company founder Byju Raveendran of violating their debt contracts by refusing to give them financial details about the three units. Judge Brendan Shannon also granted lenders’ request to appoint an independent Chapter 11 trustee to manage the Byju units in bankruptcy. Epic and the other Byju units opposed the forced bankruptcy. In a September court filing, they claimed that the lenders lacked legal standing to initiate the bankruptcy and argued the filings were an improper “tactical maneuver“ meant to get an edge over the Byju units in related litigation. The development was “surprising” and “in conflict” with Think & Learn Private Limited’s insolvency proceedings in India, wrote Pankaj Srivastava in a letter following the decision. Srivastava, Byju’s Interim Resolution Professional, appointed earlier this year is requesting to stay the effect of the bankruptcy. The “Resolution Professional has the duty to take control of the corporate debtor’s assets,” Srivastava wrote, citing Indian insolvency law. He didn’t appear at the hearing, court papers showed. The Indian official and the US creditors have been in dispute with each other in the complicated cross-border bankruptcy procedures. US lenders to Byju’s were removed from an influential creditors committee in India — a decision made by Srivastava. It’s unclear whether the request from the Indian official will change the ruling. Byju’s petitioning creditors said they “disagree with the letter” and asked the judge to sign the order so that the bankruptcy could take effect, adding that the letter is informal. As of Friday at noon, there’s been no public disclosure of an order being signed by the judge. --With assistance from Jonathan Randles and Reshmi Basu. More stories like this are available on ©2024 Bloomberg L.P.",
        "title": "US-Ruled Bankruptcy of Byju’s Units Countered By Indian Official",
        "date/time": "13 Sep 2024, 11:25 PM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/india/top-news-on-sept-13-sensex-nifty-end-marginally-lower-kejriwal-released-from-jail-sebi-chief-counters-congress-more-11726236700190.html",
        "content": "Delhi Chief Minister walked out of Tihar jail on Friday evening following a Supreme Court order granting him bail. The Narendra Modi-led central government announced the renaming of Port Blair as Sri Vijaya Puram while Sebi chief Madhabi Puri Buch countered Congress allegations about a ‘conflict of interest’. Other news included the renaming of Port Blair, RBI's cancellation of NBFC registrations, and TCS employees receiving tax notices for TDS issues. amid widespread exultation on Friday evening. The AAP supremo held a roadshow from the Chandgiram Akhara to his official residence after his release. He said the country was going through a critical phase as some \"anti-national forces\" are trying to weaken it. Foreign exchange reserves have risen by $5.248 billion to hit a new record high of $689.235 billion on September 6. Data collected from the Reserve Bank of India website on Friday also showed a $129 million increase in gold reserves to $61.988 billion. India's reserve position with the International Monetary Fund rose $9 million to $4.631 billion. The government on Friday decided to rename Port Blair as Sri Vijaya Puram. said the name also symbolises the victory achieved in the country's freedom struggle and the unique role played by the Andaman & Nicobar islands. Several potential investors failed to receive UPI mandates after applying for the Bajaj Housing Finance IPO on Friday. Some users also complained on social media that their had seen the amount get blocked but no corresponding updates on the phone banking app. Sebi chief Madhabi Puri Buch issued a joint statement with her husband after Congress leader Pawan Khera flagged a potential conflict of interest. Buch dubbed the claims ‘baseless’ and insisted that she had recused herself from cases involving prominent companies including Mahindra Group, ICICI Group, and Pidilite Industries, which have a significant presence in the stock exchanges. “Madhabi has complied with all the disclosure and recusal guidelines of Sebi, and in fact, maintained a proactive continuing recusal list with Sebi over and above the requirements under the guidelines,” they said in the statement. Sensex and the Nifty 50 closed in the red on Friday even as 327 stocks — including Bharti Airtel, HCL Tech, Bajaj Finserv and JSW Steel — hit fresh 52-week highs in intraday trade on BSE. The Sensex and the Nifty 50 ended with mild losses on Friday due to profit booking following a steep rise of almost 2 per cent in the previous session. Several Tata Consultancy Services employees have reportedly received income tax notices about discrepancies in their TDS. The missives flagged discrepancies between the TDS credit in their Form 26AS and the amount they claimed while filing their income tax returns. The company has told workers the tax department would reprocess their ITRs to resolve the issue. The Reserve Bank of India cancelled the registration certificates of four non-banking financial companies on Friday under under Section 45-IA of the RBI Act. Thirteen other NBFCs have surrendered their licenses to the central bank.",
        "title": "Top News on Sept 13: Sensex, Nifty end marginally lower, Kejriwal released from jail, Sebi chief counters Congress, more | Today News",
        "date/time": "13 Sep 2024, 08:22 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/best-fd-rates-these-five-banks-offer-the-highest-interest-rates-on-fixed-deposits-check-details-here-11726110773781.html",
        "content": "Best FD rates: Fixed Deposits are a popular investment option in India due to their safety and guaranteed returns. For investing in FDs, comparing the rates to maximise returns is essential. Here’s a detailed comparison of the top 5 banks offering the highest , per the latest data from banks' respective websites. Small finance banks in India provide competitive interest rates on Fixed Deposits compared to larger, traditional banks like . Here’s a detailed comparison of the top 5 small finance banks offering the highest FD rates in India, with information sourced from the banks' respective websites. : 6 Months - 201 Days: 8.50% 501 Days: 8.75% 1001 Days: 9.00% 701 Days: 8.75% 6 Months - 201 Days: 9.00% 501 Days: 9.25% 1001 Days: 9.50% 701 Days: 9.25% 546 - 1111 Days: 9.00% 1112 - 1825 Days: 8.00% 546 - 1111 Days: 9.50% 1112 - 1825 Days: 8.50% Above 2 Years to 2 Years 1 Day: 8.60% 2 Years & 2 Days: 8.65% 2 Years 3 Days up to 3 Years: 8.60% Above 2 Years to 2 Years 1 Day: 9.10% 2 Years & 2 Days: 9.10% 2 Years 3 Days up to 3 Years: 9.10% 18 Months to 24 Months: 8.55% 18 Months to 24 Months: 9.05% 444 Days: 8.50% 444 Days: 8.77% North East Small Finance Bank: 9.00% for deposits maturing in 546 - 1111 Days. Unity Bank: 9.50% for deposits maturing in 1001 Days. North East Small Finance Bank: 9.50% for deposits maturing in 546 - 1111 Days. The Deposit Insurance and Credit Guarantee Corporation provides insurance for fixed deposits held with small finance banks, covering up to 5 lakh per depositor. What Is the maximum deposit amount insured by the DICGC? The DICGC insures up to 5 lakh per depositor for the principal and interest amounts held in the same right and capacity. Banks covered by the DICGC are provided with printed leaflets detailing the insurance protection, which should be displayed at the bank branches. If you have any doubts, you can ask a branch official for confirmation regarding the bank’s insurance status with the DICGC.",
        "title": "Best FD rates: These five banks offer the highest interest rates on fixed deposits. Check details here | Mint",
        "date/time": "12 Sep 2024, 09:48 AM IST",
        "author": "Sangeeta Ojha",
        "author_url": "https://www.livemint.com/authors/sangeeta-ojha"
    },
    {
        "url": "https://www.livemint.com/news/india/bath-in-river-turns-tragic-eight-drown-in-gujarats-gandhinagar-during-ganesh-visarjan-11726241255775.html",
        "content": "At least eight people were killed on Friday while bathing in the Meshwo river of Gujarat — with rescue operations continuing till late into the evening. The incident took place in Vasna Sogathi village with locals sounding the alarm after coming to the site in Gandhinagar to immerse a Ganapati idol. “Nine youths from Vasna Sogathi village came to the dam on Meshwo River at noon. They were bathing here when an idol of Lord Ganesh came for Visarjan. Out of those nine people, one was drowning while bathing. So, other people also came to save him,” recounted DT Gohil – the Gandhinagar Deputy SP. Officials have recovered eight bodies so far — in line with eyewitness accounts. SDRF and NDRF teams however remain deployed in the area to ensure that no other person is missing from the area. Meanwhile Sub Divisional Magistrate BB Modiya said the authorities were alerted after a group of villagers came to the waterbody to immerse Ganesh idols and learnt about the drowning. \"After getting a message, police and fire brigade personnel rushed to the site. We recovered eight bodies from the river. One person who was assumed to be missing was later found moving about in the village. So the rescue operation, which continued till late evening, was called off,\" he said. “The deceased were locals who had come to bathe in the river. They may have misjudged the river's depth since its water level has risen recently due to an under-construction check dam a little distance away,” he told PTI. The 10-day-long Ganesh Chaturthi festival commenced last week on Friday. It is slated to continue till Anant Chaturdashi. Many opt for shortened versions of the festival with the immersion done after 1.5 days or on the third day. Other alternatives include the fifth day visarjan and the seventh day visarjan.",
        "title": "Bath in river turns tragic! Eight drown in Gujarat’s Gandhinagar during Ganesh Visarjan | Today News",
        "date/time": "13 Sep 2024, 09:33 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/delhi-coaching-centre-deaths-four-co-owners-get-interim-bail-directed-to-deposit-rs-5-crore-to-red-cross-11726224983602.html",
        "content": "The to four individuals in the coaching centre deaths case. A bench of Justice Dinesh Kumar Sharma directed the co-owners to deposit a sum of 5 crore to the Red Cross and dubbed their conduct an ‘unpardonable act of greed’. The High Court also directed to form a committee headed by a retired HC judge to ensure that no coaching centre runs without sanction. The committee will also be tasked with carving out a place from where the centres should run. Three civil services aspirants had drowned in a flooded coaching basement at the end of July this year as heavy rain caused waterlogging in the Old Rajinder Nagar area of Delhi. The High Court had previously transferred the case from the Delhi Police to the CBI. The probe agency had opposed the bail pleas and said the investigation was an initial stage. It insisted that the accused should remain in custody until independent witnesses had been quizzed. The indulged in by any person, including officials of the local authorities. Six people were arrested in connection with the deaths and currently remain in judicial custody. Basement co-owners Parvinder Singh, Tajinder Singh, Harvinder Singh and Sarbjit Singh however contend that their only role was that of a landlord. The space was let out on a rental basis to the coaching centre and as such they did not play any role in the unfortunate event. “It was an act of god which happened and it could have been avoided had the civic agencies performed their onerous duties which they have miserably failed to do,” an advocate for the accused had insisted last month.",
        "title": "Delhi coaching centre deaths: Four co-owners get interim bail, directed to deposit  ₹5 crore to Red Cross | Today News",
        "date/time": "13 Sep 2024, 04:34 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/money/personal-finance/why-are-health-plans-sold-by-paytm-and-phonepe-cheaper-11726142660653.html",
        "content": "Health insurance plans offered by banks or mobile apps are often cheaper because they are typically group plans. These plans are available exclusively to members of a specific group, such as bank account holders or KYC-approved app users. While these plans may appear attractive due to their lower cost, it is important to be aware of their limitations and potential drawbacks: In summary, while group plans may seem like an attractive option due to their lower cost, it’s important to be aware of their limitations and risks. Ensure you understand the full implications before committing to a plan. The moratorium period for health insurance policies in India, which was reduced to 60 months in April 2024, plays a crucial role in claim acceptance. During this period, insurers cannot deny a claim based on non-disclosure or incorrect information, except in cases where fraud is proven. Meaning, insurers can still deny a claim if they can prove fraud. What constitutes fraud? Well, under the Indian Contract Act of 1872, fraud is defined as any act intended to deceive or induce someone into a contract. This includes: In essence, fraud involves intentionally deceiving someone for personal benefit. So, for an insurer to reject a claim after the moratorium period, they will need to provide documentary evidence proving: If an insurer denies your claim alleging fraud after the 60-month moratorium period, you might need to challenge their decision in court. And, the insurer will have to prove their fraud claims with solid evidence.",
        "title": "Why are health plans sold by Paytm and PhonePe cheaper? | Mint",
        "date/time": "13 Sep 2024, 06:30 AM IST",
        "author": "Aayush Dubey",
        "author_url": "https://www.livemint.com/authors/aayush-dubey"
    },
    {
        "url": "https://www.livemint.com/news/india/from-shampoo-chair-to-inverter-set-rahul-gandhi-sends-gift-to-raebareli-barber-shop-he-visited-months-ago-11726248707912.html",
        "content": "Three months after visiting a barber's shop in his Lok Sabha constituency Raebareli, has sent a gift to him, reported on 13 September. During his Lok Sabha campaigning, Rahul Gandhi got his beard and hair trimmed at the barber shop. Upon receiving the gift, barber Mithun expressed happiness. On 13 May, and Congress MP from the Rae Bareli parliamentary seat attended a public meeting in Lalganj. While leaving the place, Rahul Gandhi stopped at barber Mithun's shop in Brijendra Nagar and got his beard trimmed. Mithun on Friday said that had talked to him for a long time. \"After more than three months, suddenly on Thursday, a vehicle stopped near my shop. Two people unloaded two chairs, a shampoo chair, inverter set, etc. from that vehicle and handed them over,\" quoted Mithun as saying. Mithun was told that these goods were sent by Rahul Gandhi, a party office bearer said, and added that Mithun was happy at this and expressed gratitude towards Gandhi. Spokesperson of UP Congress Anshu Awasthi said, \"Rahul Gandhi always meets different sections of the people, understands their needs and their work on the ground. During the Lok Sabha elections, Rahul Gandhi got his hair and beard trimmed at Mithun's salon in Lalganj, Raebareli.\" \"Rahul Gandhi sent Mithun the barber the things he needed for his work, including a shampoo chair, two hair-cutting chairs and an inverter battery. He does this work, so that people in politics, the social sector and Congress leaders and workers also promote this kind of support and encouragement. It is a matter of pride for us,\" Awasthi said. District Congress unit's president of Raebareli, Pankaj Tiwari said, “The information about the goods being sent by the MP was received through social media. If the goods have arrived, then it is a very good thing.” On 26 July, Rahul Gandhi had made an unscheduled surprise visit to Ram Chet's shop in Vidhayak Nagar on the outskirts of Sultanpur, while he was on his way back to Lucknow from Sultanpur after appearing in a district court in connection with a defamation case. He also made a brief halt at his shop, cobbler Ram Chet, where, on 27 July, the Congress leader gave him a sewing machine.",
        "title": "From shampoo chair to inverter set: Rahul Gandhi sends gift to Raebareli barber shop he visited months ago | Today News",
        "date/time": "13 Sep 2024, 11:04 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/nurse-narrowly-escapes-gangrape-bid-in-bihar-hospital-cuts-doctors-private-parts-11726217012094.html",
        "content": "with a nurse in Bihar fending off a gang-rape attempt on Wednesday night. The incident took place at the RBS Health Care Centre in Gangapur while a doctor and two of his associates were in an inebriated condition. The nurse managed to escape after cutting her attacker with a blade and called the police from a nearby field. According to reports, the accused have been identified as hospital administrator Dr Sanjay Kumar and his associates Sunil Kumar Gupta and Awadhesh Kumar. The police said the trio had locked the hospital from inside and turned off CCTV cameras before attacking the nurse. They had also been drinking before the sexual assault — an additional offense in dry Bihar. The nurse was wrapping up work on Wednesday evening when the drunken trio began harassing her. The situation escalated swiftly with the doctor attempting sexual assault. The nurse had grabbed a surgical blade and cut his private parts in a bid to free herself from his grip. The two others had chased her while she fled the scene. The victim had called the police while hiding in a field outside the hospital — leading to the arrest of the would-be rapists. The doctor is reportedly undergoing medical treatment for his injuries while in police custody. Investigators have recovered several key pieces of evidence including blood-stained clothes and multiple mobile phones. The development comes . West Bengal Chief Minister insisted on Thursday that she was \"ready to resign\" for the \"sake of people\" as an impasse with protesting junior doctors continued. \"For the sake of the people, . We have tolerated a lot of canards and insults for the last 33 days. I thought the junior doctors would engage in talks for the sake of the patients and on humanitarian grounds,\" she said on Thursday evening.",
        "title": "Nurse narrowly escapes gangrape bid in Bihar hospital, cuts doctor’s private parts | Today News",
        "date/time": "13 Sep 2024, 02:36 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/delhi-news-man-shot-dead-in-public-outside-gym-in-greater-kalish-lawrence-bishnoi-link-suspected-video-11726205762866.html",
        "content": "Delhi news today: A 35-year-old gym owner was shot dead in public view in South Delhi's Greater Kailash-1 on Thursday night. The victim, Nadir Shah, was immediately admitted to a hospital, where he later passed away. According to a report by TOI, Shah was coming out of the gym when he was shot. The police got a call around 10:40 pm at night, and the case is currently being investigated. According to ANI, the District Commissioner of Police , , Ankit Chauhan, said that seven to eight bullet rounds were fired. Five teams have also been formed for surveillance and other purposes. Rohit Godara, a close aide of Goldy Brar of the Lawrence Bishnoi gang, has taken responsibility for the murder in a social media post. Rohit Godara said he ordered the killing of Nadir Shah after his aide Samir Baba, who is in Tihar Jail, sent him a message that Shah was obstructing their business deals. “If anyone else should dare to do the same, they will meet the same fate,\" read the post. In the CCTV footage of the incident, a man wearing a chequered shirt is seen approaching Nadir Shah and firing. The shooter then hops onto a motorcycle parked a few metres away and escapes. Bullet projectiles and empty cartridges were also found at the spot, stated reports. “The attackers came on a two-wheeler, fired on him and ran away. He was immediately rushed to the hospital by his friends but was declared brought dead,” DCP Ankit Chauhan told . According to the police, Nadir Shah, who owned a business in , had several criminal cases against him. He also worked as an informer who knew senior officers in Delhi Police, reported. Check for the latest updates.",
        "title": "Delhi news: Man shot dead in public, outside gym in Greater Kailash; Lawrence Bishnoi link suspected | Video | Today News",
        "date/time": "13 Sep 2024, 11:57 AM IST",
        "author": "Sudeshna Ghoshal",
        "author_url": "https://www.livemint.com/authors/sudeshna-ghoshal"
    },
    {
        "url": "https://www.livemint.com/news/india/india-ready-to-offer-maldives-emergency-financial-support-as-sukuk-default-risk-looms-11726221366791.html",
        "content": "India has reiterated its willingness to help as the . The emergency funding would help the Maldives meet its external debt payments due next month. The developments came even as the island nation pledged to meet debt obligations — helping its dollar-denominated sukuks recover from a record low. According to a Bloomberg report quoting people in the know, Malé can immediately tap $400 million available under the currency swap program. The country can also seek long-term loans under a $800 million line of credit extended to the government in 2019. It was not immediately clear whether the Maldives had officially asked Indian authorities for help. However Maldives authorities said in a statement last month that officials were working to arrange a $400 million foreign-currency swap with India’s central bank and a green bond sale. The matter is likely to be discussed during President Mohamed Muizzu’s upcoming visit to India. Moody’s downgraded the nation into junk territory on Wednesday in light of default risks over eroding foreign reserves. Sukuk is a Sharia-compliant financial certificate that is used in much of the Islamic world. With double-digit losses this year, the debt is the worst performer on the Bloomberg EM Sovereign Total Return Index. The Observer Research Foundation in Delhi found that the country’s debt stood at 110% of gross domestic product as of March 2024. Data compiled by Bloomberg indicates that the Maldives faces a $25 million payment on its roughly $500 million of outstanding sukuk debt in October. A foreign-currency swap and other interim measures will however not fix the crisis — offering temporary relief and buying the island nation some time to find an actual remedy. and promptly sought to improve ties with China.",
        "title": "India ready to offer Maldives emergency financial support as Sukuk default risk looms | Today News",
        "date/time": "13 Sep 2024, 04:19 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/sustainable-food-system-indias-trade-agri-exports-think-tank-icrier-phytosanitary-standards-quality-control-11726227834912.html",
        "content": "New Delhi: Despite being one of the leading exporters of agri-food and organic products, India has yet to fully prioritize exports and address trade challenges linked to the sustainable food system , according to think tank Indian Council for Research on International Economic Relations . A sustainable food system , as defined by the UN's Food and Agriculture Organisation, ensures food security and nutrition without compromising the ability of future generations to meet their needs, balancing economic, social, and environmental aspects. The issues concerning SFS impacting trade include sporadic bans on exports of products due to global shortages or domestic price increases, rejection of exports in key markets for not adhering to sanitary and phytosanitary standards, lack of a single nodal agency for export quality control, limited discussions and collaborations on SFS through trade agreements, and lack of product specific export strategy and data, ICRIER said in its September policy brief. \"Despite the growing emphasis by the centre and state governments on transitioning to a sustainable food system in India, significant gaps and challenges remain,\" said the policy brief titled, 'Sustainable Food Systems and India's Trade Agreements'. \"To advance towards a sustainable food system, India must address these challenges, examine its policies and policy gaps, align policies with the United Nations Sustainable Development Goals and replicate success stories to boost the global competitiveness of India’s agri-food sector,\" it said. : \"Cross–border collaborations through MRAs and under trade agreements focused on sustainable food systems are essential to expand India’s agri-food exports and strengthen the resilience of the food system,\" the think tank added. During April-June quarter, India's agri-exports stood at $8.44 billion, up from $8.39 billion during the same quarter of the previous year, according to the commerce ministry data. Overall, India's agri-exports stood at $33.24 billion in FY24, up from $32.43 billion in the same period of the previous year. ICRIER also recommended a vision document or roadmap for SFS for an integrated food system, ensuring sustainability across the entire food supply chain, from production to consumption and waste management. Also Read: \"Since SFS is in the domain of multiple regulatory agencies at the centre and the states, a master policy document laying down the vision of the country and a roadmap towards achieving it in the short, medium and long term will help in budget allocation, ensure co-ordinated efforts and comprehensive solutions,\" it said. ICRIER's September policy brief also recommended streamlining processes for smooth co-ordination across multiple regulators, addressing regulatory gaps, implementing farm-to-fork product traceability, facilitating easy access to data and information, reducing trade barriers by strengthening quality testing and certification, allocating higher budget for SFS, and implementing a targeted tax incentive or subsidy programme for nutritious foods. \"There is a need for India to discuss cooperation on SFS in international forums, including its trade agreements. While many measures have been taken by the Indian government on SFS, the country seems to have a defensive positive in trade agreements,\" it said.",
        "title": "Sustainable food system challenges hurting India’s trade, says think tank | Today News",
        "date/time": "13 Sep 2024, 06:04 PM IST",
        "author": "Rhik Kundu",
        "author_url": "https://www.livemint.com/authors/rhik-kundu"
    },
    {
        "url": "https://www.livemint.com/news/india/arvind-kejriwal-released-from-tihar-jail-supreme-court-bail-order-excise-liquor-policy-scam-case-aap-bjp-11726219491504.html",
        "content": "was released from Tihar jail on Friday following a Supreme Court order granting him bail in the excise policy-linked money laundering case filed by the CBI. He has already got bail in another case registered by the Enforcement Directorate in July. “I want to thank people who prayed for my release…you have braved rain to come here. Every drop of my blood dedicated to nation. I faced difficulties, but God has always been with me. God helped me because I was truthful,” the AAP leader told party workers. Kejriwal emerged from Tihar jail in a car alongside his security convoy as rain-soaked supporters chanted slogans. Visuals shared online also showed supporters and party workers bursting firecrackers outside Tihar jail — despite a recently imposed cracker ban order in Delhi to check air pollution. \"They put me in jail, they thought putting Kejriwal behind the bars will break his morale. Today, I want to tell you that I have come out of jail, my morale has boosted 100 times. My strength has increased 100 times,\" added the Delhi CM. Top lieutenants including Bhagwant Mann and Manish Sisodia let the sloganeering from atop a truck. Calls such as ‘ and ‘ rent the air. The two-judge SC Bench had deemed his arrest lawful but insisted that prolonged incarceration amounts to unjust deprivation of liberty. A , and accepted a request to send it through special messenger. Special Judge Rakesh Syal passed the order after the advocates for Kejriwal filed a bail bond of 10 lakh with two sureties of the like amount before the court. The unless absolutely necessary to obtain the Lieutenant Governor's sanction. It also said completion of trial was unlikely to occur in the immediate future and rejected the apprehension of tampering by Kejriwal. Several AAP leaders and workers have gathered outside the jail and party headquarters to welcome the Delhi CM. They also distributed sweets and burst crackers after the news broke on Friday afternoon. “Today, all those under trial, except one, in the so-called excise policy case, have been granted bail. The comments made by the SC in today's hearing, are exactly the same as what we had been saying for the last 2 years... The SC even said that the country's premier investigative agency, the CBI, is a caged parrot. The SC called CBI a caged parrot even when UPA was in power... Towards the end, the SC said that the CBI needs to be an uncaged parrot,” said AAP leader Saurabh Bharadwaj. AAP leaders also assured that the party would fight the upcoming Haryana Assembly elections with 'double energy'. State party chief Sushil Gupta said Kejriwal would will campaign in the state following his release. The news has also prompted a flurry of exultant messages from members of the INDIA bloc. “The bail of Delhi's popular and public welfare Chief Minister Shri Arvind Kejriwal is a 'victory of the Constitution'. Only those who are against the Constitution misuse the Constitution. The knock on the door of justice is always heard. The world has moved forward on this tradition till now and will continue to do so,” Samajwadi Party chief Akhilesh Yadav posted in Hindi on X. “The bail granted to Delhi Chief Minister Arvind Kejriwal makes one thing clear that the foundation of democracy in the country is still strong. The long fight has ended with the victory of truth. Kejriwal's bail reaffirmed the feeling that the conspiracy to vanquish someone through illegitimate means will never succeed in a democratic country,” Sharad ,\" Pawar wrote on X. “The court has given a good decision. It is a well-known fact that the BJP is misusing agencies like CBI and ED against opposition leaders,” added DMK spokesperson TKS Elangovan.",
        "title": "Arvind Kejriwal walks out of Tihar Jail as SC grants bail in excise policy case: ‘My strength has increased 100 times’ | Today News",
        "date/time": "13 Sep 2024, 06:27 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/delhi-metro-news-now-avoid-buying-daily-qr-tickets-with-this-new-feature-check-how-it-works-cost-and-discounts-11726214472698.html",
        "content": "The Delhi Metro Rail Corporation introduced the \"Multiple Journey QR Ticket \" on Thursday, September 12. This new feature aims to offer passengers convenience \"by eliminating the need to purchase daily QR tickets\". It provides an efficient way to manage multiple journeys on the Delhi Metro. Delhiites can avail this service on . The \"Multiple Journey QR Ticket \" feature is now available exclusively on DMRC’s Delhi Metro Sarathi app. To avail the MJQRT, users must register on the DMRC Momentum Sarthi 2.0 app and can start with an initial amount of 150, which can be used for metro travel. \"There is no security deposit required for the MJQRT,\" the DMRC said in a post on X on Thursday. A to travel using the MJQRT. It also offers flexible recharge options. \"Users can easily add value in multiples of 50 through digital payment methods such as UPI, credit cards, and debit cards, with a maximum balance limit of Rs. 3,000,\" the DMRC said. Multiple Journey QR Ticket feature and a 20% discount during off-peak hours. Tap the multiple journey QR ticket button on the phone screen. Read through the terms and conditions, then click accept to proceed You first need to add balance to start using the multiple journey QR ticket feature Enter the amount that you wish to top up and click on pay now You will be redirected to the payment page. Choose your desired payment option to complete the payment. Once the payment is completed, you will see the payment successful message Now you are ready to use the Multiple Journey QR Ticket Now, to use the QR code, simply click on QR code In case a person's mobile phone is stole, lost or gets damaged, the remaining balance will remain intact, and passengers can continue using the MJQRT by logging in on another device.",
        "title": "Delhi Metro News: Now avoid buying daily QR tickets with THIS new feature; Check how it works, cost and discounts | Today News",
        "date/time": "13 Sep 2024, 01:41 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/india/pul-bangash-sikh-killings-1984-case-congress-leader-jagdish-tytler-denies-charges-claims-trial-11726209729872.html",
        "content": "Congress leader Jagdish Tytler denied on Friday charges framed against him in connection with the 1984 Pul Bangash Sikh killings case. He claimed trial instead. Delhi's Rouse Avenue Court listed the Tytler's matter for trial and recording of evidence on October 3. This case pertains to the killings of three Sikhs near Gurudwara Pul Bangash on November 1, 1984. The court news agency ANI reported. Tytler was charged with murder and instigating violence in the 1984 anti-Sikh riots that saw over the killing of over 6,000 practitioner of the Sikh religion. In its charge sheet filed in May 2023, the Central Bureau of Investigation had accused Tytler, a former Union minister, of “inciting, instigating and provoking the mob” which had assembled near the Pul Bangash gurdwara on November 1. He was . The acceptance of bail bond by the Rouse Avenue Court in Delhi saw protests by Delhi Sikh Gurdwara Management Committee outside the court premises. The 1984 anti-Sikh riots had begun as a consequence of the assassination of incumbent Prime Minister and Congress leader Indira Gandhi by her Sikh bodyguards – Satwant Singh and Beant Singh. , 1984 at her residence in Safdarjung Road, New Delhi. She was killed by her bodyguards Satwant Singh and Beant Singh in the aftermath of Operation Blue Star. Operation Blue Star was an Indian military action carried out between June 1 and 8, 1984, ordered by Indira Gandhi to remove Jarnail Singh Bhindranwale and his followers from the Golden Temple of Harmandir Sahib in Amritsar, Punjab. In August 2024, the Rouse Avenue Court in Delhi had directed the in a 1984 anti-Sikh riots case that resulted in the death of three persons. The court said that there is sufficient material to frame the charges against the accused Congress leader. It found that the trial against Jagdish Tytler can be proceeded under sections 143, 147 153A, 188, 295, 436, 451, 380, 149, 302 and 109 of the Indian Penal Code.",
        "title": "1984 anti-Sikh riots case: Congress leader Jagdish Tytler denies charges, claims trial | Today News",
        "date/time": "13 Sep 2024, 12:31 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/world/us-locks-in-steep-china-tariff-hikes-some-industries-warn-of-disruptions-11726261763021.html",
        "content": "* USTR maintains tariffs of 100% on Chinese EVs, 50% on chips, 25% on batteries, steel * USTR doubles duties on Chinese face masks, surgical gloves, syringes * China tariff exclusions added on five machinery categories * Industry groups warn of higher tariffs disrupting supply chains By David Lawder Sept 13 - The Biden administration on Friday locked in steep tariff hikes on Chinese imports, including a 100% duty on electric vehicles, to boost protections for strategic industries from China's state-driven industrial practices. The U.S. Trade Representative's office said that many of the tariffs, including a 100% duty on Chinese EVs, 50% on solar cells and 25% on steel, aluminum, EV batteries and key minerals, would take effect on Sept. 27. The USTR determination, published on Friday and first reported by Reuters, showed that a 50% duty on Chinese semiconductors, now including two new categories - silicon wafers and polysilicon used in solar panels - is due to start in 2025. The action, which marks the end of a more than two-year review of tariffs that had been imposed by former president Donald Trump, mostly left unchanged the top-line duty increases announced in May by President Joe Biden. These include a new 25% tariff on lithium-ion batteries, minerals and components, with those for EVs taking effect on Sept. 27, and those for all other devices on Jan. 1, 2026. The Biden administration also left in place Trump's tariffs on over $300 billion worth of Chinese goods ranging from toys and t-shirts to internet routers and industrial machinery at rates of 7.5% to 25%. The final decision largely disregarded pleas from automakers for lower tariffs on graphite and critical minerals used in EV battery production because they are still dependent on Chinese supplies. The action drew industry complaints that the increases would disrupt supply chains, including for semiconductor-intensive products, and do little to stop China's technology transfer and industry domination practices that have led to excess factory production now flooding global markets. \"Since implementation, the tariffs have cumulatively cost American businesses and consumers $221 billion, while failing to alter Chinese trade policies and practices of concern,\" Information Technology Industries Council President Jason Oxman said in a statement. \"With today's announcement, USTR once again relies on the blunt and ineffective tool of tariffs with no support for their effectiveness.\" 'TOUGH, TARGETED' Lael Brainard, the top White House economic adviser, told Reuters the decision was made to ensure that the U.S. EV industry diversifies away from China's dominant supply chain. She said such \"tough, targeted\" tariffs are needed to counter China's state-driven subsidies and technology transfer policies that have led to over-investment and excess production capacity. Washington is investing hundreds of billions of dollars worth of its own tax subsidies to develop domestic EV, solar and semiconductor sectors. \"The 100% tariff on electric vehicles here does reflect the very significant unfair cost advantage that Chinese electric vehicles in particular are using to dominate car markets at a breathtaking pace in other parts of the world,\" Brainard said. \"That's not going to take place here under the vice president's and the president's leadership.\" China has vowed retaliation against the \"bullying\" tariff hikes and argued that its EV industry's success is due to innovation, not government support. A spokesperson for China's embassy in Washington did not immediately respond to a request for comment. The higher U.S. tariffs take effect as Trump and Vice President Kamala Harris are both courting voters in auto and steel producing states, trying to position themselves as tough on China ahead of the November presidential election. Trump has vowed to impose 60% tariffs on all Chinese imports. The European Union and Canada also are imposing new tariffs on Chinese EVs, the latter matching the 100% U.S. duties. PORT, MEDICAL RELIEF The final tariff decision does provide some temporary relief for U.S. port operators who were facing a new 25% tariff on massive ship-to-shore cranes, an industry that China dominates with no U.S. producers. The duty would add millions of dollars to the cost of each crane. USTR said it will allow exclusions from the tariffs for any Chinese port cranes that were ordered prior to the May 14 initial tariff announcements, as long as they are delivered by May 14, 2026. USTR raised tariffs to 50% on medical face masks and surgical gloves, from an initially proposed 25%, but delayed their start to allow a shift to non-Chinese suppliers. The planned duty on Chinese syringes, which were in short supply during the COVID-19 pandemic, will immediately rise to 100% from a previously planned 50%, but USTR will allow a temporary exclusion for enteral syringes, used to feed infants, for a year. The agency also said it will consider requests for tariff exclusions for five Chinese industrial machinery categories, including those for machinery for purifying or filtering liquids, industrial robots and printing machinery.",
        "title": "US locks in steep China tariff hikes, some industries warn of disruptions ",
        "date/time": "14 Sep 2024, 02:39 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/india/arvind-kejriwal-gets-bail-message-to-bjp-to-stop-dictatorship-says-aap-leader-manish-sisodia-11726211546945.html",
        "content": "Aam Aadmi Party leader Manish Sisodia said on Friday that the Supreme Court while granting bail to Delhi Chief Minister Arvind Kejriwal has given a message to Bhartiya Janata Party despite all its evil plans. “This is an emotional moment for all of us that our brother and political Guru Arvind Kejriwal is going to be out after all the evil plans designed by the BJP. The SC has given a message to the BJP that they have to stop their dictatorship,” told reporters after the Friday's verdict. The Supreme Court on Friday granted bail to with a case filed by Central Bureau of Investigation in the excise policy case. The top court pronounced the verdict in the petitions filed by Kejriwal challenging his arrest and seeking bail in the case registered by the CBI over the alleged excise policy case. \"The SC has said that the BJP is misusing the agencies and has made them their caged parrot... The SC said in very clear words that the CBI is working as a caged parrot... The SC's order has given an assurance that if someone is a dictator or misusing the agencies, then the Constitution of India is there to protect,\" Sisodia said. During the hearing on Friday, Justice Ujjal Bhuyan recalled Supreme Court's comments comparing it to a . \"It is imperative that CBI dispels the notion of it being a caged parrot. Rather, the perception should be that of an uncaged parrot, Justice Bhuyan said. \"The Supreme Court said today that the way the CBI arrested Arvind Kejriwal, it became clear that the CBI arrested him intending to keep him jailed... And as Kejriwal has not done anything wrong, then who's intention was this? . The CBI did not arrest him because of any corruption but because the BJP wanted it... The Supreme Court has also approved of this today... The BJP got exposed in the SC today,\" Sisodia said. Sisodia is also accused in the excise policy scam. The former Deputy Chief Minister of Delhi was released on bail in both ED and CBI cases linked to the case in August this year.",
        "title": "Arvind Kejriwal gets Bail: ‘Message to BJP to stop dictatorship,’ says AAP leader Manish Sisodia | Today News",
        "date/time": "13 Sep 2024, 01:43 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/world/biden-to-make-first-africa-visit-with-angola-trip-in-coming-weeks-sources-say-11726261850786.html",
        "content": "By Andrea Shalal WASHINGTON, Sept 13 - President Joe Biden is planning a trip to Angola in coming weeks, fulfilling an earlier promise that would make him the first U.S. head of state to visit sub-Saharan Africa since Barack Obama in 2015, three sources familiar with the plans said. The trip, which is still being finalized, is likely to occur after the United Nations General Assembly meeting in September and before the Nov. 5 presidential election, one of the sources said. The White House declined to comment on the trip plans. Biden had hoped to visit Angola late last year but the trip was postponed after the outbreak of the Israel-Hamas war in October. Biden has pledged closer U.S. partnership with democracies on the African continent, as Beijing invests heavily in the region. The Democratic president hosted Angolan President Joao Lourenco at the White House last November and raised the prospect of a visit during their Oval Office meeting. In May, he said he planned to make an official visit to Africa in February if he won the U.S. presidential election. Biden would be the first U.S. president to visit the oil- and resource-rich African country, one of the sources said, following a first-ever visit by a U.S. defense secretary, Lloyd Austin, in September 2023. Keen to counter China's massive investments in Africa, the U.S. has been supporting a project that links resource-rich Democratic Republic of Congo to Angola's Lobito port by rail to bypass road congestion on the copper and cobalt route. Biden, who took office in 2021, has faced some criticism for not visiting the African continent earlier in his term after hosting a U.S.-African leaders summit in Washington in December 2022. Treasury Secretary Janet Yellen and Vice President Kamala Harris visited Africa in 2023, and Secretary of State Antony Blinken this year. Biden's trip would come weeks before a U.S. presidential election that remains razor-tight, with recent polls showing Democratic candidate Harris virtually tied with her Republican rival, former President Donald Trump, whose derogatory reference to African nations as \"shithole countries\" continues to reverberate in African diplomatic circles.",
        "title": "Biden to make first Africa visit with Angola trip in coming weeks, sources say",
        "date/time": "14 Sep 2024, 02:40 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/india/railway-employee-beaten-to-death-by-passengers-for-allegedly-molesting-girl-on-train-11726229093526.html",
        "content": "Amid the rising protest over the , a railway employee was beaten to death in a train to New Delhi early on Thursday after the kin alleged the employee the 11-year-old. According to a report by , on Wednesday a family from Siwan had boarded the Humsafar Express from Bihar's Barauni Bihar to New Delhi. By 11.30 pm, the Group D railway employee Prashant Kumar asked to 11-year-old girl to sit on his seat. Later when the minor's mother went to the washroom, the Group D railway employee allegedly molested the girl. When the girl's mother returned from the washroom, she ran to her and started crying. After being asked why, the girl described the incident to her mother in the train washroom. The report added that following this, the woman informed her husband, father-in-law, and other passengers in the M1 coach on the train about the whole incident. When the train reached the Aishbagh junction in Lucknow, the girl's kin grabbed Kumar and took him near the coach's doors. Until the train reached Kanpur Central, Kumar was thrashed by the girl's kin. At 4.35 am, when the train reached to Kanpur Central, the Government Railway Police took Kumar to a hospital, but he was declared dead. The girl's kin have complained of against the railway employee, while his kin have filed a complaint of murder against the minor's family. Meanwhile, Kumar's uncle Pawan – who lives in Bihar's Samastipur – claims he was not that kind of man and alleges conspiracy. \"Prashant was not that kind of man. It seems he was killed as part of a conspiracy. He was beaten for so long, were there no personnel from the Railway Police Force around,\" quoted him as saying. Superintendent of Police, GRP , Abhishek Yadav said, as quoted by , \"When the train crossed Aishbagh, the girl said she had been molested. Her family members and other passengers beat up the accused. At Kanpur Central, the accused was handed over to the GRP and a complaint was filed. When he was taken to the hospital, he was declared dead.\"",
        "title": "Railway employee beaten to death by passengers for allegedly molesting girl on train | Today News",
        "date/time": "13 Sep 2024, 05:48 PM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/world/trump-says-he-is-not-selling-his-shares-of-media-company-11726261724982.html",
        "content": "By Alexandra Ulmer RANCHO PALOS VERDES, California -Donald Trump is not selling any of his majority stake in the company that owns Truth Social, and he will not leave the social media platform he created, the Republican U.S. presidential candidate told reporters on Friday. Shares of Trump Media & Technology Group surged as much as 30% following his comments before closing with a 12% gain for the day. Trump owns about 57% of Trump Media, which saw its shares slump this week following his televised debate with Democratic rival Vice President Kamala Harris. Friday's leap in the stock follows weeks of steady declines ahead of key dates this month when Trump and other company insiders will be allowed to sell their shares. \"No, I’m not selling,\" the former president said in answer to a question asked by Reuters. \"I’m not leaving. I love it. I think it’s great.\" Trump Media saw its value balloon to nearly $10 billion following its stock market listing in March. Trump Media's stock is popular among retail traders and is seen as a speculative bet on his chances of securing a second four-year term as president. However, since its listing, Trump Media shares have lost most of their value, with losses accelerating in recent weeks after President Joe Biden gave up his reelection bid and Trump lost a lead in opinion polls ahead of the Nov. 5 presidential election. According to provisions related to Trump Media's listing, Trump and other insiders will be allowed to sell stock beginning later this month, potentially flooding the market with additional shares. If the stock price remains at or above $12 for any 20 trading days commencing Aug. 22, then Trump will be free to sell shares beginning on Sept. 20. Otherwise, he is eligible to sell shares beginning on Sept. 26. The stock ended at $17.97 on Friday following Trump's comments, making his stake worth about $2 billion. Forbes values Trump's wealth at $3.7 billion. Trump Media's revenue is equivalent to two Starbucks coffee shops, and strategists say its $3.6 billion stock market value is detached from its day-to-day business. It lost $869,900 in its most recent reported quarter ended June 30. \"There are no fundamentals behind this company. It doesn't have a path to profitability. It's just driven by commentary, and by hopes and dreams,\" said Dennis Dick, a trader at Triple D Trading. The upcoming lock-up expiry related to Trump's shares is \"something a lot of people on the street have been watching for weeks, if not since its inception now,\" said Jay Woods, chief global strategist at Freedom Capital Markets, ahead of Trump's statement that he would not sell. A New York judge earlier this month delayed Trump's sentencing in his hush money criminal case to Nov. 12, after the election, months after the U.S. Supreme Court's landmark decision on presidential immunity, easing at least for the short term pressure over legal fees.",
        "title": "Trump says he is not selling his shares of media company",
        "date/time": "14 Sep 2024, 02:38 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/prince-harry-meghan-markle-hit-with-100k-property-tax-for-their-us-mansion-days-before-duke-inherits-millions-11726239481493.html",
        "content": "The Duke of Sussex, and his wife, , have reportedly been hit with a hefty property tax bill of more than $14.5 million for their seven-bedroom and 15-bathroom sprawling Montecito mansion in California suburb just days before he is set to inherit a substantial royal fortune, media reports claimed. The reports said the British Royals purchased the lavish California mansion for an estimated £11 million in 2020 to live in with their two young children, . The luxury Montecito mansion, which comes with a swimming pool and impressive views of the surrounding Santa Ynez Mountains, is located in Santa Barbara County. The local government is now said to be charging the property a hefty new property tax bill. The British royal couple reportedly paid a property tax of $146,600 last year, which was in two instalments. The Sun reported that the royal couple paid $144,000 in in 2022 and $141,000 in 2021 for their Montecito mansion. The new of property tax bill comes just before Prince Harry’s 40th birthday, where he is expected to inherit a significant sum of money from the late Queen Mother. The Times reports that Prince Harry's late great-grandmother established a trust estimated at £19 million in 1994, intended to provide a tax-free lump sum to her great-grandchildren. The money was to be divided among her younger relatives, with an initial payment on their 21st birthdays and a second payment when they turned 40, reports the Express. \"There was a trust fund set up at the time. It was a way in which the Queen Mother could set aside money for when her great-grandchildren were older and a way of passing a slice of her estate down in a tax-efficient way. It was a way in which some of her estate could be ring-fenced for them,\" The Times reported citing a former Palace aide. While the precise amount Prince Harry will get remains under wraps, it's thought that he'll pocket a cool £7 million once he turns 40 this Sunday. Meanwhile, some royal experts, citing insiders, have suggested that Prince Harry is exploring ways to stage a “comeback” from his relative exile in the Increased time in the UK could potentially help him mend his strained relationship with his father, The tension between the father and son has been a topic of public interest since Harry and Meghan stepped down from their royal duties in 2020.",
        "title": "Prince Harry, Meghan Markle hit with £100k property tax for their US mansion days before Duke inherits millions | Today News",
        "date/time": "13 Sep 2024, 08:33 PM IST",
        "author": "Deepak Upadhyay",
        "author_url": "https://www.livemint.com/authors/deepak-upadhyay"
    },
    {
        "url": "https://www.livemint.com/news/world/eam-s-jaishankar-gcc-india-china-relations-moscow-russia-quad-g7-galwan-valley-clash-geopolitics-mea-11726198974489.html",
        "content": "External Affairs Minister S. Jaishankar highlighted that 75 percent of disengagement issues with have been resolved in their border talks. Nonetheless, he recognized that some issues remain unresolved. Jaishankar also pointed out that the relationship between India and China has historically been challenging. “We did not have an easy relationship in the past. What happened in 2020 was in violation of multiple agreements, the Chinese moved a large number of troops to the Line of Actual Control. We, in response, moved our troops up.. Some progress on border talks with China. 75 per cent of disengagement problems are sorted out. We still have some things to do,” Jaishankar said during his conversation with Ambassador Jean-David Levitte at the Geneva Centre for Security Policy on Thursday. Also Read: “If there is a solution to disengagement and there is a return to peace and tranquillity, we can look at other possibilities. That is the immediate issue,” he further added. Jaishankar said that the two countries had a difficult relationship in the past and spoke about 2020 when the Indian and Chinese troops clashed at . He also described the India-China relationship as “complex” and highlighted the long-standing struggle in the trade issues between the two nations and said that the economic relationship with China has been “unfair and imbalanced.” The EAM said, “It is a very complex relationship... They had bad periods in history. Both of them are reviving and are rejuvenating in a way... They are the only two countries that have a population of more than a billion. And what happens normally when any country rises is that it has a ripple effect on the neighbourhood. These two countries also have the honour of being each other's neighbours. So each one's rise has a ripple impact... So if you take the totality of this, you can understand why I selected a safe expressive word like complex.” Also Read: Notably, India and China held the 31st meeting of the WMCC in Beijing on August 29, and the two sides had decided to jointly uphold peace and tranquillity on the ground in border areas in accordance with relevant bilateral agreements and protocols. The two sides had a “frank, constructive and forward-looking” exchange of views on the LAC situation and also agreed to intensify contact through diplomatic and military channels, according to the Ministry of External Affairs. Meanwhile, the EAM further said that apart from border issues, the two nations also face difficulties in other sectors, including technology, telecom, and digital. Also Read: “I think there are larger issues in respect of India-China. We have a long struggle with the trade issue... The economic relationship with China has been very unfair. It has been very imbalanced that we don't have market access there. They have much better market access here in India. We have many concerns today in various areas, like technology, telecom, and digital.” Jaishankar arrived in Switzerland on September 12 following his visits to Germany and Saudi Arabia. Earlier on Wednesday, he met with German Chancellor Olaf Scholz in Berlin and delivered personal greetings from Prime Minister Narendra Modi.",
        "title": "Jaishankar says ‘75% of disengagement problems sorted out in ‘complex relationship’ with China’ | Today News",
        "date/time": "13 Sep 2024, 09:51 AM IST",
        "author": "Livemint",
        "author_url": "https://www.livemint.com/authors/livemint"
    },
    {
        "url": "https://www.livemint.com/news/world/trump-says-he-is-not-selling-his-shares-of-media-company-11726261724352.html",
        "content": "By Alexandra Ulmer RANCHO PALOS VERDES, California, Sept 13 - Donald Trump is not selling any of his majority stake in the company that owns Truth Social, and he will not leave the social media platform he created, the Republican U.S. presidential candidate told reporters on Friday. Shares of Trump Media & Technology Group surged as much as 30% following his comments before closing with a 12% gain for the day. Trump owns about 57% of Trump Media, which saw its shares slump this week following his televised debate with Democratic rival Vice President Kamala Harris. Friday's leap in the stock follows weeks of steady declines ahead of key dates this month when Trump and other company insiders will be allowed to sell their shares. \"No, I’m not selling,\" the former president said in answer to a question asked by Reuters. \"I’m not leaving. I love it. I think it’s great.\" Trump Media saw its value balloon to nearly $10 billion following its stock market listing in March. Trump Media's stock is popular among retail traders and is seen as a speculative bet on his chances of securing a second four-year term as president. However, since its listing, Trump Media shares have lost most of their value, with losses accelerating in recent weeks after President Joe Biden gave up his reelection bid and Trump lost a lead in opinion polls ahead of the Nov. 5 presidential election. According to provisions related to Trump Media's listing, Trump and other insiders will be allowed to sell stock beginning later this month, potentially flooding the market with additional shares. If the stock price remains at or above $12 for any 20 trading days commencing Aug. 22, then Trump will be free to sell shares beginning on Sept. 20. Otherwise, he is eligible to sell shares beginning on Sept. 26. The stock ended at $17.97 on Friday following Trump's comments, making his stake worth about $2 billion. Forbes values Trump's wealth at $3.7 billion. Trump Media's revenue is equivalent to two Starbucks coffee shops, and strategists say its $3.6 billion stock market value is detached from its day-to-day business. It lost $869,900 in its most recent reported quarter ended June 30. \"There are no fundamentals behind this company. It doesn't have a path to profitability. It's just driven by commentary, and by hopes and dreams,\" said Dennis Dick, a trader at Triple D Trading. The upcoming lock-up expiry related to Trump's shares is \"something a lot of people on the street have been watching for weeks, if not since its inception now,\" said Jay Woods, chief global strategist at Freedom Capital Markets, ahead of Trump's statement that he would not sell. A New York judge earlier this month delayed Trump's sentencing in his hush money criminal case to Nov. 12, after the election, months after the U.S. Supreme Court's landmark decision on presidential immunity, easing at least for the short term pressure over legal fees.",
        "title": "Trump says he is not selling his shares of media company",
        "date/time": "14 Sep 2024, 02:38 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/iraqi-and-us-forces-kill-a-top-is-commander-and-other-militants-in-joint-operation-11726261863074.html",
        "content": "BAGHDAD — Iraqi forces and American troops have killed a senior commander with the Islamic State group who was wanted by the United States, as well as several other prominent militants, Iraq's military said on Friday. The operation in Iraq's western Anbar province began in late August, the Iraqi military said, and involved also members of the Iraqi National Intelligence Service and Iraq’s air force. Among the dead was an IS commander from Tunisia, known as Abu Ali Al-Tunisi, for whom the U.S. Treasury Department had offered $5 million for information. Also killed was Ahmad Hamed Zwein, the IS deputy commander in Iraq. Despite their defeat, attacks by IS sleeper cells in Iraq and Syria have been on the rise over the past years, with scores of people killed or wounded. Friday's announcement was not the first news of the operation. Two weeks ago, official has said that the United States military and Iraq launched a joint raid targeting suspected IS militants in the country’s western desert that killed at least 15 people and left seven American troops hurt. Five of the American troops were wounded in the raid itself, while two others suffered injuries from falls during the operation. One who suffered a fall was transported out of the region, while one of the wounded was evacuated for further treatment, a U.S. defense official said at the time, speaking on condition of anonymity to discuss details of the operation that had not yet been made public. In Friday's announcement, the Iraqi military said the operation also confiscated weapons and computers, smart phones and 10 explosive belts. It added that 14 IS commanders were identified after DNA tests were conducted. It made no mention of the 15th person killed and whether that person had also been identified. The Islamic State group seized territory at the height of its power and declared a caliphate in large parts of Iraq and Syria in 2014 but was defeated in Iraq in 2017. In March 2019, the extremists lost the last sliver of land they once controlled in eastern Syria. At its peak, the group ruled an area half the size of the United Kingdom where it enforced its extreme interpretation of Islam, which included attacks on religious minority groups and harsh punishment of Muslims deemed to be apostates. Despite their defeat, attacks by IS sleeper cells in Iraq and Syria have been on the rise over the past years, killing and wounding scores of people. The U.S. military has not commented on the August raid. Earlier Friday, the U.S. Central Command said its forces killed an IS attack cell member in a strike in eastern Syria. It added that the individual was planting an improvised explosive device for a planned attack against anti-IS coalition forces and their partners, an apparent reference to Syria’s Kurdish-led Syrian Democratic Forces. In August last year, the U.S. had agreed to enter into talks to transition U.S. and anti-IS coalition forces from their long-standing role in assisting Iraq in combating IS. There are approximately 2,500 U.S. troops in the country, and their departure will take into account the security situation on the ground, and the capabilities of the Iraqi armed forces. ____ Mroue reported from Beirut.",
        "title": "Iraqi and US forces kill a top IS commander and other militants in joint operation",
        "date/time": "14 Sep 2024, 02:41 AM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/pope-makes-new-overture-to-china-calling-beijing-a-promise-and-hope-for-the-church-11726261765064.html",
        "content": "ABOARD THE PAL PLANE — Pope Francis declared Friday that China was “a promise and a hope” for the Catholic Church, offering extensive praise for Beijing at the end of a four-nation tour through Asia and again expressed hope to one day visit. Francis’ comments, during an in-flight press conference en route home from Singapore, came as the Vatican enters into the final weeks of negotiations to renew a 2018 agreement over the contentious issue of bishop nominations. Francis declared himself “happy” with the process, saying both sides were engaging in negotiations in a spirit of good will. “I’m happy with the dialogue with China,” he said. “The result is good.” “China for me is an illusion, in the sense that I want to visit China,” he said. “A great country. I admire China. I respect China. It’s a country with a millennial culture, with a capacity for dialogue and understanding that goes beyond other systems of democracy.” The Vatican has been working for years to try to improve relations with China that were officially severed over seven decades ago when the Communists came to power. The aim is to unite the country’s estimated 12 million Catholics, who were divided into an official, state-recognized church and an underground church that stayed loyal to Rome. Relations had long been stymied over China’s insistence on its exclusive right to name bishops as a matter of national sovereignty, while the Vatican insisted on the pope’s exclusive right to name the successors of the original Apostles. The 2018 deal sought to find a middle ground, although the Vatican has flagged repeated violations and Rome has acknowledged it was a bad deal but the only one it could get. It was signed at a time when China was tightening controls on all religions, especially Christianity and Islam, which are viewed as foreign imports and potential challengers to Communist authority. The Holy See under Francis has gone out of its way to extend overtures to China. But its position has drawn criticism especially from American conservatives, who have accused the Vatican of selling out the faithful who have been forced underground. Francis nevertheless was upbeat and seemed grateful for the opportunity to speak about China on his return from Asia, a region where Beijing wields so much influence. “I think China is a promise and a hope for the church,” he added. Associated Press religion coverage receives support through the ’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The is solely responsible for this content.",
        "title": "Pope makes new overture to China, calling Beijing ‘a promise and hope’ for the church",
        "date/time": "14 Sep 2024, 02:39 AM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/musks-starlink-in-talks-with-south-africa-to-start-service-11726261621923.html",
        "content": "Elon Musk’s Starlink is holding talks with the South African government to introduce the satellite service in Africa’s biggest and most developed economy, President Cyril Ramaphosa said. Musk and Ramaphosa held talks over potential investments, the president told reporters on Friday. Musk, who was born in South Africa, is the world’s richest person. Last week, Zimbabwe became the 16th nation in Africa to get access to the high-speed Internet service, according to a map published on Starlink’s website. “I have had discussions with him and have said, Elon, you become so successful and you’re investing in a variety of countries, I want you to come home and invest here,” Ramaphosa told reporters in Pretoria. “He and I are going to have a further discussion.” Sign up for the twice-weekly Next Africa newsletter for the latest business and economic news from the continent. The president said Starlink made the approach. A spokesperson for Starlink didn’t respond to an earlier request for comment. Last Sunday, in response to a post on X about how South Africa needs Starlink, Musk said that it is “waiting for regulatory approval.” Starlink delivers broadband internet beamed down from a network of roughly 5,500 satellites that SpaceX started deploying in 2019. The service has 2.6 million customers globally. However, Starlink remains absent in some major economies, including Taiwan, due to local ownership requirements. Companies operating in South Africa also require a degree of Black ownership in an effort to redress inequities stemming from apartheid. Alternative arrangement can be made after talks with the government. On Friday United Airlines Holdings Inc. announced a deal for Starlink to power its inflight Wi-Fi, becoming the first major US carrier to use the satellite system and giving the Musk-run company a marquee customer. Subscribe to Business of Space: The inside stories of investments beyond Earth, from satellite networks to moon landings. Delivered weekly.",
        "title": "Musk’s Starlink in Talks With South Africa to Start Service",
        "date/time": "14 Sep 2024, 02:37 AM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/a-strike-at-boeing-extends-a-new-era-of-labor-activism-long-in-decline-at-us-work-places-11726246671736.html",
        "content": "Aircraft assembly workers walked off the job at at Boeing factories near Seattle and elsewhere early Friday after union members voted overwhelmingly to go on strike. Organized labor has made itself heard over the past year and the number of actions taken by unions has soared. There were 470 work stoppages involving approximately 539,000 workers last year, according to Cornell University's School of Industrial and Labor Relations. The nearly 500 work stoppages resulted in approximately 24,874,522 strike days. While the number of work stoppages increased by only 9% between 2022 and 2023, the number of workers involved in those work stoppages skyrocketed 141% to well over a half million workers, according to Cornell. Unions including the UAW, the Teamsters and this week the International Association of Machinists and Aerospace Workers, say they made the sacrifices asked of them by their companies during the pandemic and rough economic economic conditions. Now, they say, it is time for pay and benefits to catch up and workers appear more willing to strike. Here's a look at some recent company negotiations with their unions. Late last year the United Auto Workers union overwhelmingly ratified new contracts with Ford and Stellantis, along with a similar deal with General Motors, that would raise pay across the industry and force automakers to absorb higher costs. The agreements, which run through April 2028, ended contentious talks that began in the summer of 2022 and led to six-week-long strikes at all three automakers. The new contract agreements were widely seen as a victory for the UAW. The companies agreed to dramatically raise pay for top-scale assembly plant workers, with increases and cost-of-living adjustments that would translate into 33% wage gains. Top assembly plant workers were to receive immediate 11% raises and would earn roughly $42 an hour when the contracts expire in April of 2028. Under the agreements, the automakers also ended many of the multiple tiers of wages they had used to pay different workers. They also agreed in principle to bring new electric-vehicle battery plants into the national union contract. UPS workers that are members of the Teamsters union approved a tentative contract with the package delivery company last year. The run up to the approval was not smooth though, with contentious labor negotiations that threatened to disrupt package deliveries for millions of businesses and households nationwide. After negotiations broke down in early July 2023, Atlanta-based UPS reached a tentative contract agreement with the Teamsters just days before an Aug. 1 deadline. At the time the tentative agreement was struck, full- and part-time union workers were set to get $2.75 more per hour in 2023, and $7.50 more in total by the end of the five-year contract. Starting hourly pay for part-time employees also got bumped up to $21, but some workers said that fell short of their expectations. UPS said at the time that by the end of the new contract, the average UPS full-time driver would make about $170,000 annually in pay and benefits. It was not clear how much of that figure benefits accounted for. As part of the deal, the delivery company also agreed to make Martin Luther King Jr. Day a full holiday, end forced overtime on drivers’ days off and stop using driver-facing cameras in cabs, among a host of other issues. It eliminated a two-tier wage system for drivers and tentative deals on safety issues were also reached, including equipping more trucks with air conditioning. Earlier this month video game performers reached agreements with 80 individual games that have signed interim or tiered budget agreements with the performers’ union and accepted the artificial intelligence provisions they have been seeking. The performers had been striking for over a month. Members of the Screen Actors Guild-American Federation of Television and Radio Artists began striking in July after negotiations with game industry giants that began more than a year and a half ago came to a halt over AI protections. The interim agreement secures wage improvements, protections around “exploitative uses” of artificial intelligence and safety precautions that account for the strain of physical performances, as well as vocal stress. The tiered budget agreement aims to make working with union talent more feasible for independent game developers or smaller-budget projects while also providing performers the protections under the interim agreement. Last month thousands of hospitality union workers on the Las Vegas Strip reached a tentative deal with the Venetian and Palazzo resorts, a first for employees at the sprawling Italian-inspired complex that opened 25 years ago. The Culinary Workers Union announced on the social platform X that the deal came together after a year of negotiations. It covers over 4,000 hotel and casino workers, from housekeepers and cocktail servers to bartenders and porters. Bethany Khan, a union spokesperson, said the deal mirrors the major wins secured in recent contracts awarded to 40,000 hospitality workers at 18 Strip properties owned or operated by casino giants MGM Resorts International, Caesars Entertainment and Wynn Resorts. Those wins included a 32% pay increase over five years, housekeeping workload reductions and improved job security amid advancements in technology and artificial intelligence. The bump in pay under those contracts will amount to an average $35 hourly wage by the end of the contracts, according to the union. Workers at these properties were making about $26 hourly with benefits before winning their latest contracts in November. Unions representing 85,000 health care workers reached a tentative agreement with industry giant Kaiser Permanente in October 2023 following a strike over wages and staffing levels. The deal included setting minimum hourly wages at $25 in California, where most of Kaiser’s facilities are located, and $23 in other states. Workers would also see a 21% wage increase over four years. The lead up to the tentative agreement included a three-day strike involving 75,000 workers in multiple states. The tentative agreement also included protective terms around subcontracting and outsourcing, as well as initiatives to invest in the current workforce and address a staffing crisis. Hollywood’s actors voted to ratify a deal with studios in December 2023 that ended their strike after nearly four months, bringing an official finish to a labor strife that shook the entertainment industry for most of last year. Members of the Screen Actors Guild-American Federation of Television and Radio Artists approved a three-year contract. Control over the use of artificial intelligence was the most hard-fought issue in the long, methodical negotiations. The contract called for a 7% general pay increase with further hikes coming in the second and third years of the deal. The agreement also included a hard-won provision that temporarily derailed talks: the creation of a fund to pay performers for future viewings of their work on streaming services, in addition to traditional residuals paid for the showing of movies or series. In a little over two weeks, it’s likely that about 45,000 dockworkers along the U.S. East and Gulf coasts will go on strike and shut down as many as 36 ports that handle almost half of the nation’s cargo from ships entering and exiting the nation. While consumers probably won’t see much of an impact if the strike isn’t long, there could be shortages that would hurt the U.S. economy if the walkout by the International Longshoremen’s Association goes for more than a month.",
        "title": "A strike at Boeing extends a new era of labor activism long in decline at US work places",
        "date/time": "13 Sep 2024, 10:27 PM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/israelhamas-war-latest-oct-7-mastermind-thanks-hezbollah-leader-for-his-help-attacking-israel-11726261777128.html",
        "content": "Hamas leader Yahya Sinwar thanked Lebanon’s Hezbollah chief Hassan Nasrallah for his support in the ongoing war with Israel in a letter released Friday by Hezbollah’s media office. In the letter, dated Monday, Sinwar thanks Nasrallah for the “blessed acts” of Iran-backed groups in their support for Hamas since Oct. 7, when Hamas-led militants killed some 1,200 people, mostly civilians, and abducted another 250. Sinwar called the war “one of the most honorable battles for the Palestinian people.” On Oct. 8, Hezbollah started attacking Israeli military posts along the border, triggering an ongoing exchange of fire that has left hundreds dead. Gaza's Health Ministry says more than 41,000 Palestinians have been killed in the territory since the Israel-Hamas war began. It does not differentiate between fighters and civilians in its count. The war has caused vast destruction and displaced about 90% of Gaza’s population of 2.3 million, and the United Nations reported the Palestinian economy is in a free fall. The report from the U.N. Trade and Development also warned of “rapid and alarming economic decline” in the West Bank, citing expanded Israeli settlements, land confiscations, demolition of Palestinian buildings and violence by settlers as dampening economic prospects. Here's the latest: JERUSALEM — The U.N. agency helping Palestinian refugees says that one of its staffers was shot and killed during an Israeli military raid in the West Bank, the first such shooting of an agency staffer in the occupied territory in more than a decade. The United Nations Relief and Works Agency said Friday that a sniper fatally shot one of the agency’s sanitation workers on the roof of his home in the Faraa urban refugee camp in the northern West Bank during an Israeli military operation early Thursday. The UNRWA identified the worker as Sufyan Jawwad. Israeli military spokesman Lt. Col. Nadav Shoshani confirmed that Israeli forces had killed the UNRWA employee in Faraa, saying that he had been throwing explosive devices at Israeli troops when he was shot. Shoshani also alleged that Jawwad had a past record of militant activity, without providing evidence. “This is yet another example of an UNRWA employee taking active part in terrorist activities against Israel,” Shoshani said. UNRWA did not immediately respond to the Israeli army allegations. UNRWA was thrown into crisis earlier this year when Israel accused a dozen UNRWA employees of participating in Hamas’ devastating Oct. 7 attacks. The relationship between UNRWA and Israel has long been tense because of the agency’s mission to care for Palestinian refugees and their descendants — now estimated at 6 million spread across the Middle East — who fled or were pushed from their homes during the 1948 war over Israel’s creation. CAIRO — Israeli airstrikes continued to hit Gaza overnight and early Friday, killing at least 12 people in their homes, the Palestinian territory's Civil Defense said. The strikes hit homes in Deir al Balah’s Nuseirat Camp as well as in Rafah, it said. In Nuseirat, three people died, including a woman and a child, and eleven others were injured by the strikes. In Rafah, strikes killed five people, including two children, Civil Defense spokesperson Mahmoud Bassal said. Israeli strikes resumed Friday afternoon, killing another person in Nuseirat and three people in Gaza City. Bassal said a day earlier that 16 people were killed by airstrikes on Gaza City on Thursday. The strikes come nearly a day after health workers wrapped up the first round of the polio vaccination campaign during which hundreds of thousands of children were vaccinated. The second dose of the vaccine is expected to be provided in the coming weeks, according to the United Nations Relief and Works Agency for Palestine Refugees . Gaza’s health ministry said Thursday that 41,119 Palestinians were killed, and 95,125 others were injured since the Israel-Hamas war broke out last October. BEIRUT — The leader of the Palestinian Hamas group thanked Lebanon’s Hezbollah chief for his support in the ongoing war with Israel in a letter released Friday by Hezbollah’s media office. Yahya Sinwar’s letter came in response to a message sent earlier by Hezbollah leader Hassan Nasrallah in which he paid his condolence for the July killing of top Hamas official Ismail Haniyeh during a visit to Iran. In the letter, dated Monday, Sinwar thanks Nasrallah for the “blessed acts” of Iran-backed groups in their support for Hamas since the Israel-Hamas war started Oct. 7, calling the war “one of the most honorable battles for the Palestinian people.” A day after the militants' bloody incursion into Israel that started the war, Hezbollah started attacking Israeli military posts along the border, triggering an ongoing exchange of fire. More than 500 people have been killed in Lebanon by Israeli strikes since Oct. 8, most of them fighters with Hezbollah and other armed groups, but also more than 100 civilians. In northern Israel, 23 soldiers and 26 civilians have been killed by strikes from Lebanon. ISTANBUL — Turkish officials held a brief ceremony Friday at Istanbul International Airport where the body of a Turkish American activist killed by Israeli gunfire arrived ahead of her funeral and burial in a town on the Aegean coast. Istanbul Gov. Davut Gul and other officials held prayers in front of Aysenur Ezgi Eygi’s coffin, which was draped in the Turkish flag, before helping carry it to another plane for the city of Izmir. Her funeral is expected to be held Saturday in the town of Didim, near Izmir. The 26-year-od activist from Seattle was killed Sept. 6 following a demonstration against Israeli settlements in the occupied West Bank, according to an Israeli protester who witnessed the shooting. The Israeli military said Tuesday that Eygi was likely shot “indirectly and unintentionally” by Israeli forces. Turkey announced it will conduct its own investigation into her death.",
        "title": "Israel-Hamas war latest: Oct. 7 mastermind thanks Hezbollah leader for his help attacking Israel",
        "date/time": "14 Sep 2024, 02:39 AM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/trump-pledges-to-deport-haitians-from-ohio-city-biden-calls-for-attacks-to-stop-11726261683547.html",
        "content": "By Alexandra Ulmer and Nandita Bose RANCHO PALOS VERDES, California/WASHINGTON, Sept 13 - Republican presidential candidate Donald Trump pledged to conduct mass deportations of Haitian immigrants from the Ohio city of Springfield shortly after President Joe Biden on Friday called on the attacks on the community to cease. The city for days has found itself at the center of a social media maelstrom after right-wing agitators latched onto false claims that Haitian arrivals were eating household pets. \"We will do large deportations in Springfield, Ohio,\" Trump said at a press conference at his golf resort near Los Angeles. Trump did not repeat the assertion he made during Tuesday's presidential debate with Democrat Kamala Harris that immigrants were eating dogs and cats, remarks that have been widely mocked. The majority of the 15,000 Haitians in Springfield are there legally . Trump's longstanding pledge to conduct mass deportations usually refers to those in the country illegally. Two elementary schools were evacuated and one middle school in Springfield was closed on Friday after anonymous bomb threats were made against the community for the second day in a row, according to ABC News. At the White House, Biden urged the attacks on the Haitian community to stop. \"It's simply wrong. There's no place in America. This has to stop - what he's doing. It has to stop,\" Biden said. Trump has cited the tensions in Springfield as another example of the need for hardline immigration polices. The influx of Haitians has boosted the economy but also has strained social services. Haitian community leaders across the United States said the Republican candidate's remarks could put lives at risk and further inflame tensions in Springfield. \"We need help, not hate,\" Springfield's mayor, Rob Rue, told ABC News. City officials say they have received no credible reports of anybody eating household animals. Karen Graves, a city spokesperson, said she was not aware of recent hate crimes targeting Haitian residents but that some had been victims of \"crimes of opportunity,\" such as property theft.",
        "title": "Trump pledges to deport Haitians from Ohio city; Biden calls for attacks to stop",
        "date/time": "14 Sep 2024, 02:38 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/brazil-withdraws-3-3-million-from-musk-companies-accounts-11726261776468.html",
        "content": "Brazil withdrew 18.35 million reais from the bank accounts of Elon Musk’s X and Starlink to pay for fines imposed by the Supreme Court, continuing a dispute that’s led to the blackout of the billionaire’s social-media service in the country. The court ordered the transfer of funds on Wednesday and the accounts have since been unfrozen, according to a statement from the judicial body released Friday. Musk is mired in a bitter standoff with Brazil’s top judge, who is leading a campaign against fake news and hate speech in Latin America’s largest nation. Justice Alexandre de Moraes ordered the platform formerly known as Twitter be banned last month and blocked Starlink’s accounts in a bid to force the US technology impresario’s company to pay the penalties imposed for ignoring a previous order. “The blocking of the accounts occurred because the justice considered the joint liability between X Brasil Internet Ltda., Starlink Brazil Holding Ltda. and Starlink Brazil Internet Services Ltda. for payment of fines,” the court said Friday. Representatives for Musk’s companies didn’t immediately respond to a request for comment. X remains banned in Brazil as it has yet to comply with orders from Moraes to block certain user accounts and to appoint a legal representative in the country. The judge’s campaign is being portrayed as a dangerous example of state overreach and an attack on free speech, with the issue becoming a rallying cry for the billionaire’s right-leaning allies around the world.",
        "title": "Brazil Withdraws $3.3 Million From Musk Companies’ Accounts",
        "date/time": "14 Sep 2024, 02:39 AM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/osama-bin-ladens-dead-son-is-alive-hatching-another-9-11-style-attack-from-afghanistan-says-report-hamza-bin-laden-11726234310582.html",
        "content": "Hamza bin Laden—the supposedly dead son of al-Qaeda chief —is alive and is leading the evil network of the terror outfit, The Mirror reported citing experts. The report claimed that Hamza, 43-year-old, not only survived CIA attempts to kill him in 2019, but is secretly running from Afghanistan along with his brother, Abdullah bin Laden. Both the brothers have developed 10 major al-Qaeda terror training camps in Afghanistan and have forged global links with other West-hating groups. Analysis suggests Hamza spends most of his time in Jalalabad, 100 miles east of Afghanistan’ capital city Kabul, under the constant protection of 450 snipers. A report seen by the Mirror says: “ is not only alive but actively involved in al-Qaeda’s resurgence, a fact well-known among senior leaders. These leaders... engage with him, holding regular meetings and securing him and his family. It highlights a deep connection between al-Qaeda and the Taliban, one that is crucial for Western governments to understand. [Hamza] has ascended to the leadership of al-Qaeda, steering [it] towards its most potent resurgence since the Iraq War.” “Under his command, al-Qaeda is regrouping and preparing for future attacks on Western targets. Hamza is driven by a powerful determination to continue the legacy of his father, which adds a symbolic and strategic weight to his actions. Moreover, Hamza’s brother, Abdullah bin Laden, plays a critical role in this revival,” the Mirror claimed. Hamza is believed to have worked closely with , who took over the affairs of Al Qaeda after Osama's killing. In 2019, then US President claimed he had ordered a successful hit on Hamza in an airstrike believed to be in Ghazni Province in south east Afghanistan. No DNA proof was acquired by the CIA. In a statement issued by the White House, Trump said \"The loss of Hamza bin Laden not only deprives al-Qa’ida of important leadership skills and the symbolic connection to his father, but undermines important operational activities of the group.\" The National Mobilisation Front , an anti-Taliban military alliance, has also carried a report detailing the operations of Hamza and his associates. \"Hamza bin Laden has been moved to Dara Abdullah Khel district , where 450 Arabs and Pakistanis are protecting him,\" NMF said, warning that \"under his command, Al Qaeda is regrouping and preparing for future attacks on Western targets\". The NMF has warned that since the 2021 fall of Kabul, Afghanistan has become a \"training centre for various terror groups\". A latest assessments say al-Qaeda is working with sparking growing fears of another 9/11-style attack on the West. “The parallels between the current situation and the prelude to the 9/11 attacks are alarming. The lack of a legitimate government and the ideological alignment between the ruling Taliban regime and these groups have turned Afghanistan into a haven for extremism. Terrorists from outside flock to the country for training,” the Mirror said citing intelligence analysis documents.",
        "title": "Osama Bin Laden’s ’dead’ son is alive, hatching another 9/11-style attack from Afghanistan, says report | Today News",
        "date/time": "13 Sep 2024, 07:09 PM IST",
        "author": "Deepak Upadhyay",
        "author_url": "https://www.livemint.com/authors/deepak-upadhyay"
    },
    {
        "url": "https://www.livemint.com/news/world/three-us-citizens-sentenced-to-death-in-congo-over-role-in-failed-coup-11726261757467.html",
        "content": "* Three Americans sentenced to death in Congo * They are among 37 defendants sentenced for their role in a failed coup in May * US State Department monitoring the case, defendants can appeal By Sonia Rolley and Jessica Donati Sept 13 - Three U.S. citizens are among 37 defendants sentenced to death by a military court on Friday for their role in a May failed coup in Democratic Republic of Congo. Armed men briefly occupied an office of the presidency in capital Kinshasa on May 19 before their leader, U.S.-based Congolese politician Christian Malanga, was killed by security forces. His son, Marcel Malanga, was among the Americans on trial, along with Marcel's friend, Tyler Thompson, who played high school football with him in Utah. Both are in their 20s. The third American, Benjamin Zalman-Polun, was a business associate of Christian Malanga. All three were found guilty of criminal conspiracy, terrorism and other charges, and sentenced to death in a ruling read on live TV. Malanga had previously told the court that his father had threatened to kill him unless he participated. He also told the court it was his first time visiting Congo at the invitation of his father, whom he had not seen in years. The Americans are among some 50 people, including U.S., British, Canadian, Belgian and Congolese citizens, standing trial following the failed coup. A total of 37 defendants were sentenced to death. The verdict was read out under a tent in the yard of Ndolo military prison on the outskirts of Kinshasa. The defendants were seated in front of the judge, wearing blue and yellow prison-issued tops. The trial began in July. In Washington, State Department spokesperson Matthew Miller said embassy staff had attended the proceedings and would continue to follow developments closely. \"We understand that the legal process in the DRC allows for defendants to appeal the court's decision,\" he told a briefing. The 37 defendants include Belgian-Congolese citizen Jean-Jacques Wondo. Wondo's family released video messages addressed to Congo President Félix Tshisekedi ahead of the trial to ask for his release. \"I beg you, intervene, he is innocent,\" Nathalie Kayembe Wondo, his wife, said in the message. Relatives of Marcel Malanga and Thompson did not respond to requests for comment. Marcel Malanga's mother, Brittney Sawyer, has previously said her son is innocent. Thompson's stepmother, Miranda Thompson, has previously said her stepson travelled to Congo on vacation to explore the world. Thompson is feeling lonely and isolated in prison, according to the fundraising site that his family set up to support his defense.",
        "title": "Three US citizens sentenced to death in Congo over role in failed coup",
        "date/time": "14 Sep 2024, 02:39 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/us-presidential-candidate-donald-trump-plans-to-launch-his-sons-crypto-business-aims-to-make-us-the-crypto-capital-11726193955561.html",
        "content": "Former President Donald Trump plans to deliver remarks next Monday about cryptocurrency and the launch of the company , a crypto platform controlled by the Republican nominee's sons Donald Jr. and Eric. His speech will come , an extraordinary use of dwindling campaign time to promote a personal business. The Republican former president has long mixed his political and business interests and marketed sneakers, photo books and Trump-branded Bibles during his 2024 campaign. “We're embracing the future with crypto and leaving the slow and outdated big banks behind,” Trump said in a video posted Thursday to X, the social media site that will also host his address on the subject at 8 p.m. EDT on Monday from his Mar-a-Lago home. As part of his Trump has pledged to turn the United States into the “crypto capital of the planet,” raising red flags that he could use the federal government to help support a business tied to his family. Cryptocurrencies are forms of digital money that can be traded over the internet without relying on the global banking system. The trading often depends on online marketplaces that charge fees for transactions, so that the cryptocurrencies can be exchanged for U.S. dollars and other currencies. Trump opposed crypto during his presidency, but he has since warmed to the sector. He has suggested the government create a strategic reserve of Bitcoin and has vowed to block the creation of a Federal Reserve-administered Central Bank Digital Currency, a digital form of central bank money that would be available to the public.",
        "title": "US Presidential candidate Donald Trump plans to launch his sons’ crypto business; aims to make US the ‘Crypto Capital’ | Today News",
        "date/time": "13 Sep 2024, 08:00 AM IST",
        "author": "PTI",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/election-2024-latest-harris-concentrates-on-pennsylvania-while-trump-stumps-in-the-west-11726259416912.html",
        "content": "Former President Donald Trump will hit the campaign trail in Western states on Friday as his opponent, Vice President Kamala Harris fixes her attention on the battleground state of Pennsylvania in the East. Trump held what was billed as a news conference at his Los Angeles-area golf club in the morning, but took no questions. He was expected to head to northern California for a fundraiser afterward, followed by a rally in Las Vegas, the largest city in swing state Nevada. Harris, meanwhile, heads to Johnstown and Wilkes-Barre on Friday as she tries to capitalize on her momentum after Tuesday night’s debate. It’s her second day of back-to-back rallies after holding two events in North Carolina, another swing state, on Thursday. Follow the ’s Election 2024 coverage at: /hub/election-2024. Here’s the latest: Pope Francis on Friday slammed both U.S. presidential candidates for what he called anti-life policies on abortion and migration, and he advised American Catholics to choose who they think is the “lesser evil” in the upcoming U.S. election. “Both are against life, be it the one who kicks out migrants, or be it the one who kills babies,″ Francis said. The Argentine Jesuit was asked to provide counsel to American Catholic voters during an airborne news conference while he flew back to Rome from his four-nation tour through Asia. Francis stressed that he is not an American and would not be voting. Neither Trump nor Harris was mentioned by name. ▶ Read more on the Pope’s remarks Vice President Kamala Harris will join Oprah Winfrey for an online event called “Unite for America” on Thursday. Winfrey, who spoke at the Democratic National Convention, said in a statement that she’s hoping to drive turnout in this year’s election. “My goal is to get people excited about the privilege and power of the vote,” she said. The event will bring together a number of identity-focused grassroots gatherings that sprung up behind Harris, including “White Dudes for Harris,” “South Asians for Harris” and “Out for Harris.” Also involved is the organization called Win With Black Women. Vice President Kamala Harris is spending time Friday in two patches of Pennsylvania that have been trending Republican over the last several elections. Harris arrived this afternoon in Johnstown in Cambria County, a once Democratic-leaning county that Republicans have won by an increasingly wide margin over the last three elections. Later, she’ll hold a rally in Wilkes-Barre in Luzerne County. Trump took Luzerne by 14 points in 2020 over President Joe Biden and 19 points in 2016 over the Democratic nominee Hillary Clinton. Without Pennsylvania, the path to victory for Harris is extraordinarily difficult. To that end, her campaign is trying to narrow the margins in parts of the commonwealth that might seem on paper less receptive to her message. During a visit to the Johnstown bookstore and cafe Classic Elements, Harris alluded to her commitment to hunt for votes in parts of the state that appear less hospitable to a Democrat, saying there were “a lot of people who deserve to be seen or heard” throughout Pennsylvania. Vice President Kamala Harris says she’s “feeling good” about carrying the swing state of Pennsylvania during a stop in Johnstown on Friday. Harris dropped in to meet with owners and supporters at Classic Elements, a bookstore and cafe, to discuss her plans to support small businesses if elected. “Small businesses are so much part of the fabric of a community,” she told the shop owners. Harris said she would be in the state a lot and that “we got to earn every vote.” Trump is refusing to condemn right-wing provocateur Laura Loomer, who traveled with him earlier this week to the debate and several 9/11 memorial events. “Laura’s been a supporter of mine,” Trump told reporters in response to questions about Republican allies who have expressed concern about his decision to associate with her. “I don’t control Laura,” he said. “I can’t tell Laura what to do. She’s a supporter.” Trump acknowledged Loomer has “got strong opinions,” but said he was unaware of her recent comments. Loomer has posted a string of vile posts on the social platform X in recent days about Harris, including one in which she wrote that “the White House will smell like curry & White House speeches will be facilitated via a call center” if Harris wins. Trump on Friday said “crime is at record numbers,” seizing on an annual survey released by the Justice Department on Americans who have been a victim of a crime. However, the survey shows there has been an overall decline over the past three decades in the rate of people or households who were victims of violent crime. The rate is down dramatically from the 1990s. Regarding the government’s recent revision of job gains by 818,000, Trump on Friday said, “They had a whistleblower who released the numbers.” But that is false: The preliminary revision occurred as part of a normal annual process and was released on a previously disclosed date. Every year the Labor Department issues a revision of the number of jobs added during a 12-month period from April through March in the previous year. The adjustment is made because the government’s initial job counts are based on surveys of businesses. The revision is then based on actual job counts from unemployment insurance files that are compiled later. The revision is compiled by career government employees with little involvement by politically-appointed officials. Trump on Friday claimed that the United States has “thousands of people being killed by illegal migrants.” But the suggestion that there has been a spike in violent crime nationally as a result of the influx is not supported by facts. FBI statistics do not separate crimes by the immigration status of the assailant, nor is there any evidence of a spike in crime perpetrated by migrants, either along the U.S.-Mexico border or in cities seeing the greatest influx of migrants, like New York. In fact, national statistics show violent crime is on the way down. President Joe Biden sat down for an interview with the Washington Blade, an LGBTQ news organization, this week and congratulated Sarah McBride, who is on track to become the first transgender member of Congress. McBride recently won the Democratic primary in Delaware, Biden’s home state. She’s close with the Biden family, having previously worked for Beau, the president’s late son who served as Delaware attorney general.“I called her and I said, ‘Sarah,’ I said, ‘Beau’s looking down from heaven, congratulating you,’” Biden said in his interview. Although Delaware used to be more conservative, the president said, “Sarah is going to be, I pray to God, a congresswoman.” On Friday, Trump said prices “have gone up like no one’s ever seen before,” but that’s not entirely true. Inflation did soar in 2021-22, though it rose by much more in 1980 when inflation topped 14%. It peaked at 9.1% in June 2022. Economists largely blame the inflation spike on the pandemic’s disruptions to global supply chains, which reduced the supply of semiconductors, cars and other goods. Russia’s invasion of Ukraine also pushed up gas and food prices. Inflation has now fallen to 2.5%, not far from the Federal Reserve’s 2% target. Prices are still about 19% higher than they were before the pandemic, but the Census Bureau reported Tuesday that household incomes have risen by a similar amount, leaving inflation-adjusted incomes at roughly the same level in 2019. Trump in his press conference repeated his claim that crime has skyrocketed under the Biden administration. FBI data has shown a downward trend in violent crime since a spike during the coronavirus pandemic. Violent crime surged during the pandemic, with homicides increasing nearly 30% between in 2020 over the previous year — the largest one-year jump since the FBI began keeping records. FBI data released in June shows that the overall violent crime rate declined 15% in the first three months of 2024 compared to the same period last year. One expert has cautioned, however, that those figures are preliminary and may overstate the actual reduction in crime. Trump’s campaign has cited the National Crime Victimization Survey recently released by the Justice Department, which shows that the number of times people or households were victims of violent crime increased by about 40% from 2020 to 2023. The report notes, however, that while the rate of violent victimizations in 2023 was higher than it was in 2020 and 2021, it was not statistically different from the rate in 2019, when Trump was president. That survey aims to capture both crimes reported to police and crimes that are not reported to police and is conducted annually through interviews with about 150,000 households. It doesn’t include murders or crimes against people under the age of 12. President Joe Biden says the Haitian community is “under attack” right now and it has to stop. Biden was referring to comments made by Republican former President Donald Trump and his running mate JD Vance about Haitian immigrants in Springfield, Ohio. The Republicans have falsely claimed immigrants are eating people’s pets and Vance on Friday suggested immigrants in the area were responsible for rising crime and rent, among other claims. In the wake of the onslaught of online insults, bomb threats were sent to multiple agencies in the city, and two elementary schools were evacuated and a middle school was closed on Friday. Biden, speaking at a luncheon at the White House, didn’t call out anyone by name, but he said: “There’s no place in America ... It has to stop what he’s doing. It has to stop.” He said it was “simply wrong.” Trump once again described Harris as the “border czar.” But that was never her formal title, and she was never specifically given the responsibility for security on the border. She was tasked by Biden in March 2021 to tackle the “root causes” of migration from the Northern Triangle — the Central American countries of Honduras, Guatemala and El Salvador — and pushing leaders there and in Mexico to enforce immigration laws. Trump on Friday claimed he “completely won” the classified documents prosecution against him. But that assessment leaves out the fact that the judge dismissed the case not because she found that Trump had done nothing but rather because she concluded that the prosecutor who brought the charges, Jack Smith, had been unlawfully appointed. The decision from U.S. District Judge Aileen Cannon is a departure from rulings by other federal judges across the country, creating a strong possibility that it will be overturned on appeal — in which case, the prosecution would be revived and the case reinstated. After a significant delay, former President Donald Trump's press conference at his Los Angeles-area golf club got underway on Friday just before 1:30 p.m. ET. He began with comments from the mayor of Rancho Palos Verdes, John Cruikshank, who was talking about issues with recent landslides. ATLANTIC CITY, N.J. — People began betting Thursday on which political party would win control of Congress in the November elections after a judge’s ruling allowing the wagers — the only ones to be legally approved by a U.S. jurisdiction. New York startup company Kalshi began taking what amounts to bets on the outcome of the November congressional elections after a judge refused to block them from doing so. The ruling by U.S. District Court Judge Jia Cobb in Washington enabled the company, at least temporarily, to offer prediction contracts across the country — essentially yes-or-no bets — on which party will win control of the Senate and the House in November. “The Kalshi community just made history, and I know we are only getting started,” said Tarek Mansour, a co-founder of the company. “Now is finally the time to allow these markets to show the world just how powerful they are at providing signal amidst the noise, and giving us more truth about what the future holds.” ▶ Read more about the endeavor Former President Donald Trump plans to deliver remarks next Monday about cryptocurrency and the launch of the company World Liberty Financial, a crypto platform controlled by the Republican nominee’s sons Donald Jr. and Eric. His speech will come 50 days before Election Day, an extraordinary use of dwindling campaign time to promote a personal business. The Republican former president has long mixed his political and business interests and marketed sneakers, photo books and Trump-branded Bibles during his 2024 campaign. “We’re embracing the future with crypto and leaving the slow and outdated big banks behind,” Trump said in a video posted Thursday to X, the social media site that will also host his address on the subject at 8 p.m. EDT on Monday from his Mar-a-Lago home. ▶ Read more about Trump’s stance on cryptocurrencies Former President Donald Trump will campaign Friday in Western states as his opponent, Vice President Kamala Harris keeps her focus on one of the biggest battleground prizes in the East, Pennsylvania. Trump is scheduled to hold what’s being billed as a news conference in the morning at his Los Angeles-area golf club before heading to northern California for a fundraiser, followed by a rally in Las Vegas, the largest city in swing state Nevada. Harris, meanwhile, heads to Johnstown and Wilkes-Barre on Friday as she tries to capitalize on her momentum after Tuesday night’s debate. It’s her second day of back-to-back rallies after holding two events in North Carolina, another swing state, on Thursday. While speaking in Charlotte, Harris took a victory lap for her debate performance in which she needled Trump and kept him on the defensive. Recounting one moment while campaigning in North Carolina, she mocked Trump for saying he had “concepts of a plan” for replacing the Affordable Care Act. ▶ Read more here. NEW YORK — When her husband turns on the television to hear news about the upcoming presidential election, that’s often a signal for Lori Johnson Malveaux to leave the room. It can get to be too much. Often, she’ll go to a TV in another room to watch a movie on the Hallmark Channel or BET. She craves something comforting and entertaining. And in that, she has company. While about half of Americans say they are following political news “extremely” or “very” closely, about 6 in 10 say they need to limit how much information they consume about the government and politics to avoid feeling overloaded or fatigued, according to a new survey from the Associated Press-NORC Center for Public Affairs Research and USAFacts. Make no mistake: Malveaux plans to vote. She always does. “I just get to the point where I don’t want to hear the rhetoric,” she said. ▶ Read more here. WASHINGTON — Even as she promoted her efforts to boost clean energy, Vice President Kamala Harris said in Tuesday’s debate that the Biden-Harris administration has overseen “the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over-rely on foreign oil.″ The comment by Harris, a longtime climate hawk who backed the original Green New Deal, surprised supporters and opponents alike — and conflicted with frequent boasts by Harris and President Joe Biden that they are champions in the fight to slow global warming. After former President Donald Trump withdrew the U.S. from the Paris Agreement on climate change, the Biden-Harris administration reentered the global pact aimed at reducing emissions. The administration also set a target to slash U.S. greenhouse gas emissions by 50% by 2030 and moved to accelerate renewable energy projects and shift away from fossil fuels. ▶ Read more here. Trump said Thursday in Arizona that as president he’d seek to end taxes on overtime wages. It’s his latest appeal to the working-class voters he’s counting on to return him to the White House. Trump has also pledged to end taxes on tips and Social Security wages. The proposals would take a significant bite out of federal revenue, ballooning the deficit unless accompanied by significant spending cuts. “It’s time for the working man and woman to finally catch a break,” Trump said. Harris has announced her own proposal to stop taxing tips. More on Trump’s plan to end taxation of tips here.",
        "title": "Election 2024 Latest: Harris concentrates on Pennsylvania while Trump stumps in the West",
        "date/time": "14 Sep 2024, 02:00 AM IST",
        "author": "AP",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/nazara-moonshine-technology-poker-fantasy-gaming-business-cricket-pokerbaazi-sportsbaazi-baazi-games-nitish-mittersain-11726221546362.html",
        "content": "Moonshine Technology, in which Nazara Technologies is set to invest 982 crore in the next two months for its poker gaming business, reported a strong financial growth with a combined revenue of 414.9 crore for fiscal year 2024 across its businesses. This figure represents a substantial 55% increase from FY23’s 268 crore, according to Nazara's filings with the BSE, and a leap from FY22’s 102.3 crore. Moonshine Technology Pvt. Ltd is the parent of several key subsidiaries and operates PokerBaazi and SportsBaazi, a brand offering sports, casual and fantasy gaming, including cricket. The subsidiaries under which these brands are housed are Ross Technologies Pvt. Ltd, Baazi Networks Pvt. Ltd, Baazi Games Pvt. Ltd and SBN Gaming Network Pvt. Ltd. Both its revenue and Ebitda data for FY24 are provisional and unaudited, the company said. Ebitda stood at 41.2 crore, reflecting a 52.5% rise over FY23's 27 crore. Ebitda stands for earnings before interest, taxes, depreciation and amortization, and is a measure of profitability. Nazara Technologies, a publicly traded gaming and sports media company, will acquire a significant majority of 47.7% in MTPL for 832 crore. It will do this by buying shares that are already owned by others in Moonshine and will also invest another 150 crore into the company through special shares or compulsory convertible preference shares. The payment will be made partly in cash— 592.26 crore—and the balance of 239.25 crore through a share swap issuance of fully paid-up equity shares of the company on a preferential basis. The acquisition makes sense, considering that PokerBaazi generated approximately 87% of the group’s revenue, while SportsBaazi contributed 12% in FY24. PokerBaazi said it had around 340,000 monthly active users till May. Nazara Technologies chief executive officer Nitish Mittersain said in a statement that the investment is a strategic move to solidify its own position in the gaming sector. He said PokerBaazi will further grow both within India and internationally. Nazara’s current portfolio includes esports companies, interactive gaming businesses and sports media. It owns Nodwin Gaming, and Sportskeeda and Pro Football Network in the sports media space. Navkiran Singh, CEO and founder of Baazi Games, said the government’s recognition of the gaming sector was a crucial component in the country’s digital economy. “Our combined efforts will foster innovation, create new jobs, and further India’s place in the global digital economy.” India’s gaming industry is expected to grow by 20% until the end of 2024-25, reaching a value of 23,100 crore, according to the E-Gaming Federation. Over the last five years, the online gaming sector has raised $2.8 billion from domestic and global investors. reached out to representatives of Moonshine, but they declined to comment on any financial details.",
        "title": "PokerBaazi parent Moonshine’s revenue grows over 50% ahead of Nazara’s  ₹982 crore investment | Mint",
        "date/time": "13 Sep 2024, 05:10 PM IST",
        "author": "Varuni Khosla",
        "author_url": "https://www.livemint.com/authors/varuni-khosla"
    },
    {
        "url": "https://www.livemint.com/companies/news/reliance-capital-resolution-nclat-hindujas-iihl-lender-plea-to-forfeit-equity-lic-epfo-11726214733572.html",
        "content": "Mumbai: The National Company Law Appellate Tribunal has issued notice to IndusInd International Holdings Ltd on a plea filed by lenders of insolvent Reliance Capital seeking forfeiture of 2,750 crore in equity component in case the Hinduja group company fails to implement the resolution plan. NCLAT's Delhi bench, led by justices Ashok Bhushan and Arun Baroka, has asked IIHL to file a reply within two weeks. The bench will hear the matter on 30 September. The lenders are primarily seeking a modification of the NCLT order of 23 July, which allowed IIHL to take over Reliance Capital for 9,861 crores. Since then, the lenders have been at odds with the Hinduja Group regarding the implementation of the resolution plan. In a plea before the NCLAT, the lenders have sought interest payment on the debt component of 7,300 crores from August 2023 until the actual date of the payment from IIHL. The counsel for the lenders said that if the applicant fails to implement the resolution plan within the extended period, it will be treated as a default, and the committee of creditors will be entitled to take all requisite steps against the applicant . In case of a default, the amount deposited in the escrow account will be returned to the lenders, the counsel added. “Lenders are not opposing the extension for plan implementation, but the interest should have been granted to us. We have been losing 125 crores worth of interest every month,” counsel Pooja Dhar said. The counsel for IIHL Bhoomika Batra to be added in 7 th para said the monies have been deposited in the escrow account in accordance with the NCLT order. “We are almost in the last leg of implementing the resolution plan,” Batra added. Under the approved plan, IIHL was to deposit the initial equity amount of 250 crore in a domestic escrow account and 2,500 crore in an offshore escrow account of the Committee of Creditors by 31 July. Subsequently, with the deadline nearing, IIHL last week filed an application before the NCLT, seeking modification of the tribunal’s order. The administrator has opposed granting any relief to IIHL. NCLT had partly granted IIHL an extension till 10 August for implementation of the resolution plan. Experts said the forfeiture of monies was appealed to secure the lenders' interest and protect them from further losses that would accrue due to IIHL’s delay in implementing the NCLT-approved resolution plan. The petition said a significant amount of public money was involved in this case as a huge amount of debt is owed to pension funds, retail bondholders, insurers, including Life Insurance Corp of India, EPFO and Army welfare fund. Earlier, the CoC pleaded in the NCLT that they were deprived of the timely payout of money owed to them by the corporate debtor under the resolution plan. The resolution plan binds IIHL to pay the lenders within a period of 90 days from the date of the order. “In the event IIHL fails to make the payments within this period and defaults, then it is liable to pay interest to the CoC for the delayed payment and should also be asked to put monies in escrow account which will be forfeited if there are further delays in implementation of the resolution plan”, the petition said.",
        "title": "RCap resolution: NCLAT seeks Hinduja’s reply on lenders’ plea to forfeit equity | Mint",
        "date/time": "13 Sep 2024, 03:22 PM IST",
        "author": "Priyanka Gawande",
        "author_url": "https://www.livemint.com/authors/priyanka-gawande"
    },
    {
        "url": "https://www.livemint.com/news/world/oil-eases-as-us-production-resumes-after-storm-rig-count-rises-11726255467450.html",
        "content": "By Laila Kearney NEW YORK -Oil prices edged lower on Friday as U.S. Gulf of Mexico crude production resumed following disruptions caused by Hurricane Francine, while the country's rig count jumped this week. Brent crude futures lost 26 cents, or 0.3%, to $71.71 a barrel by 1:30 p.m. EDT . U.S. West Texas Intermediate crude As U.S. Gulf Coast production and refining activity resumes, investors have opted to offload oil contracts going into the weekend, said Bob Yawger, director of energy futures at Mizuho in New York. \"You could come back Monday and everything is fine - the refineries are running at 100%, everyone is back on the platform, oil comes back and gasoline is coming out of the refinery - and the market could potentially pull back exponentially,\" Yawger said. Still, oil futures are expected to break a streak of weekly declines following sharp storm-related increases earlier in the week. Brent is on track for a weekly increase of about 1% while WTI is poised to register a roughly 1.5% gain. Official data showed as of Thursday, the storm nearly shut in 42% of oil production in the region that accounts for about 15% of U.S. output. \"These cuts are expected to prove brief and within the broader context are unlikely to spur much movement in the crude balances given the importance of shale production that accounts for the major portion of U.S. output,\" Ritterbusch said. Crude prices also took a hit from the U.S. rig count from energy services group Baker Hughes, which reported the biggest weekly rise in oil and natural gas rig in a year. [RIG/U] The oil and gas rig count rose by eight in the week to Sept. 13 to 590, returning to mid-June levels. The increase was the biggest since the week to Sept. 15, 2023.. Crude oil rigs rose by five to 488 this week, while gas rigs rose by three to 97. Both the Organization of the Petroleum Exporting Countries and the International Energy Agency lowered their demand growth forecasts this week, citing economic struggles in China, the world's largest oil importer. U.S. oil stockpiles also rose across the board last week as crude imports grew and exports dipped, while fuel demand weakened, the Energy Information Administration said on Wednesday. Investors are looking ahead now to the U.S. Federal Reserve's two-day policy meeting next week. It is widely expected to cut interest rates on Wednesday.",
        "title": "Oil eases as US production resumes after storm, rig count rises",
        "date/time": "14 Sep 2024, 12:54 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/news/world/oil-eases-as-us-production-resumes-after-storm-rig-count-rises-11726255466851.html",
        "content": "* Brent and WTI both set for weekly gains * US offshore oil industry reawakens after Francine shut-ins * Benchmarks hit multi-year lows this week on demand fears By Laila Kearney NEW YORK, Sept 13 - Oil prices edged lower on Friday as U.S. Gulf of Mexico crude production resumed following disruptions caused by Hurricane Francine, while the country's rig count jumped this week. Brent crude futures lost 26 cents, or 0.3%, to $71.71 a barrel by 1:30 p.m. EDT . U.S. West Texas Intermediate crude shed 31 cents, or 0.3%, to $68.66. Both benchmarks rose by more than $1 a barrel earlier in the session. As U.S. Gulf Coast production and refining activity resumes , investors have opted to offload oil contracts going into the weekend, said Bob Yawger, director of energy futures at Mizuho in New York. \"You could come back Monday and everything is fine - the refineries are running at 100%, everyone is back on the platform, oil comes back and gasoline is coming out of the refinery - and the market could potentially pull back exponentially,\" Yawger said. Still, oil futures are expected to break a streak of weekly declines following sharp storm-related increases earlier in the week. Brent is on track for a weekly increase of about 1% while WTI is poised to register a roughly 1.5% gain. Official data showed as of Thursday, the storm nearly shut in 42% of oil production in the region that accounts for about 15% of U.S. output. \"These cuts are expected to prove brief and within the broader context are unlikely to spur much movement in the crude balances given the importance of shale production that accounts for the major portion of U.S. output,\" Ritterbusch said. Crude prices also took a hit from the U.S. rig count from energy services group Baker Hughes, which reported the biggest weekly rise in oil and natural gas rig in a year. The oil and gas rig count rose by eight in the week to Sept. 13 to 590, returning to mid-June levels. The increase was the biggest since the week to Sept. 15, 2023. Both the Organization of the Petroleum Exporting Countries and the International Energy Agency lowered their demand growth forecasts this week, citing economic struggles in China, the world's largest oil importer. U.S. oil stockpiles also rose across the board last week as crude imports grew and exports dipped, while fuel demand weakened, the Energy Information Administration said on Wednesday. Investors are looking ahead now to the U.S. Federal Reserve's two-day policy meeting next week. It is widely expected to cut interest rates on Wednesday.",
        "title": "Oil eases as US production resumes after storm, rig count rises",
        "date/time": "14 Sep 2024, 12:54 AM IST",
        "author": "Reuters",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/ares-said-in-advanced-deal-talks-with-glp-capital-partners-11726253981880.html",
        "content": "-- Ares Management Corp. is in advanced talks on an acquisition of GLP Capital Partners Ltd.’s operations outside of China, according to people familiar with the matter, in what could rank as one of the biggest recent combinations in the alternative asset management industry. Ares and GCP are finalizing details of a transaction that could be agreed as soon as the next few weeks, the people said. They have been discussing a deal that would feature a roughly $3.5 billion upfront payment, with the total value climbing to around $5 billion over time if certain targets are hit, some of the people said. Los Angeles-based Ares is considering using a mix of cash and stock to fund the acquisition, the people said, asking not to be identified as the talks are private. The parties are focused on ensuring the long-term retention of GCP’s leadership and staff, one of the people said. Shares of Ares rose 2.1% to $146.86 at 1:02 p.m. in New York trading Friday, giving the company a market value of more than $46 billion. Bloomberg News reported in June that Ares was exploring the acquisition. GCP has about $66 billion of assets under management outside China, spread across Japan, Southeast Asia, Europe, the US and Brazil. Ares Chief Financial Officer Jarrod Phillips said at a conference this week that the firm could grow in Asia through acquisitions, and also sees opportunities to expand in infrastructure equity. Alternative asset managers are pursuing mergers to gain scale and expand into new sectors and geographies, turning into one-stop shops offering a range of investment strategies. The deal would expand Ares’ business in one of Wall Street’s hottest areas: infrastructure. GCP has made bets on data centers and renewable energy just as investors are looking to ways to ride on growing demand for infrastructure and resources to power what they hope will be an artificial intelligence boom. Terms of a deal may still change, and it’s possible the timing of any announcement could get pushed back, the people said. Talks are ongoing and there’s no certainty they will lead to a transaction. A spokesperson for GCP declined to comment, while representatives for Ares didn’t respond to requests for comment. An agreement would top recent deals including TPG Inc. paying $2.7 billion for credit specialist Angelo Gordon & Co. last year, and T. Rowe Price Group Inc.’s 2021 acquisition of Oak Hill Advisors for about $4.2 billion. Ares recently also acquired direct lending fund Riverside Credit Solutions for an undisclosed sum. GCP has traditionally invested in areas such as real estate tied to logistics, digital infrastructure and renewable energy. The firm grew out of Singapore-based GLP Pte, a developer and operator of warehouses that has benefited from the boom in e-commerce. GLP set up a fund management arm to invest third-party money in the sector, and it became a separate entity — GLP Capital Partners — after a series of transactions in 2022. Since then, GLP itself has been grappling with a debt burden and slumping earnings amid a prolonged property slump. It has been pursuing divestments of some Chinese logistics assets as it tries to cut debt and move toward a more asset-light business model. Ares highlighted Asia-Pacific real estate equity, global infrastructure equity and digital infrastructure equity at its investor day earlier this year as high priority areas of growth for the $447 billion alternative asset manager. The firm, still best known as a US credit manager, has pegged the market opportunity for Asia real estate at $3.4 trillion. Investors have cheered Ares’ rapid growth. Its stock has risen roughly 380% over the past five years, the most of the big five US alternative asset managers. Ares has about $15 billion in assets under management in Asia Pacific, the smallest geographic segment of its business, with real estate and infrastructure assets making up less than $100 million, according to its investor day presentation. --With assistance from Dong Cao and Allison McNeely. More stories like this are available on ©2024 Bloomberg L.P.",
        "title": "Ares Said in Advanced Deal Talks With GLP Capital Partners",
        "date/time": "14 Sep 2024, 12:29 AM IST",
        "author": "Bloomberg",
        "author_url": null
    },
    {
        "url": "https://www.livemint.com/companies/news/x-unlikely-to-fall-under-landmark-eu-tech-rules-source-says-11726258889137.html",
        "content": "By Foo Yun Chee BRUSSELS - Elon Musk's X social media platform is unlikely to be subjected to landmark EU tech rules which aim to rein in the power of Big Tech because it does not meet the rules' gatekeeper criteria, a person with direct knowledge of the matter said on Friday. The European Commission in May opened an investigation into X after the company rebutted earlier indications that it may have to comply with the Digital Markets Act , which imposes a list of dos and don'ts on Big Tech. X has said it does not qualify as an important gateway between businesses and consumers. Under the DMA, companies with more than 45 million monthly active users and 75 billion euros in market capitalisation are classified as gatekeepers. They must make their messaging apps interoperable with rivals and let users decide which apps to pre-install on their devices. They are also not allowed to favour their own services over rivals' or prevent users from removing pre-installed software or apps. The commission, which had said it would wrap up its investigation within five months, declined to comment. X's bigger challenges are with the EU's newly adopted Digital Services Act , which requires big online platforms to do more to tackle illegal and harmful online content or risk fines of as much as 6% of their global annual turnover. X is the target of several ongoing DSA investigations. Bloomberg was first to report on X likely to avoid the EU tech rules.",
        "title": "X unlikely to fall under landmark EU tech rules, source says",
        "date/time": "14 Sep 2024, 01:51 AM IST",
        "author": "Reuters",
        "author_url": null
    }
]