[
    {
        "url": "https://www.telegraphindia.com/india/hoteliers-gst-grouse-and-subsequent-apology-to-nirmala-sitharaman-sparks-row/cid/2047960",
        "content": "A hotelier in Coimbatore has expressed before finance minister Nirmala Sitharaman his exasperation with the Centre’s GST that the Opposition and many small businessmen have often described as flawed, and have had to apologise to the minister within hours. Srinivasan, who runs the Annapoorna hotel chain, had told Sitharaman during an interaction with traders and small businesses on Wednesday that while a plain bun does not come under the ambit of GST, accompaniments and other bakery products attract tax rates varying from 18 per cent to 28 per cent. While Sitharaman gave a patient hearing, her facial expressions in videos widely shared on social media led many to believe she was not happy. Srinivasan pointed out that while there was no GST on the plain bun, wafering it with a little bit of cream invites 18 per cent GST. “My customers are not amused; they say give us the bun and cream separately and we will spread it on the bun at home,” he said in Tamil, triggering peels of laughter. Srinivasan said sweets attracted 5 per cent GST but savouries were taxed at 12 per cent. He claimed that local BJP MLA Vanathi Sreenivasan, who was at the venue, often expressed annoyance at the multiple GST rates for food items. “For the same family we have to generate different bills, depending on what they wish to eat,” the hotelier said, urging the finance minister to simplify the GST rates. At one stage, Sitharaman was seen smiling when hotelier Srinivasan quipped: “Even our computer is unable to handle when we have to give multiple bills to the same family who dine with us.” “GST is not state-specific,” the finance minister said. However, Sitharaman appeared taken aback when the hotelier took the MLA’s name and said the lawmaker often attributed the low GST rate on sweets and a higher one on savouries to “people in north India consuming a lot of sweets”. Hotelier Srinivasan later met Sitharaman and apologised to her, according to reports, after the local BJP leadership told him that his manner of addressing the finance minister was in poor taste and that he should not have taken the name of the MLA. Vanathi called a media conference at Coimbatore on Friday and denied the hotelier’s claims on her. The ruling DMK and the Congress asked whether the hotelier was “forced” to apologise to the finance minister. Congress leader Rahul Gandhi posted on X: “When the owner of a small business, like Annapoorna restaurant in Coimbatore, asks our public servants for a simplified GST regime, his request is met with arrogance and outright disrespect.”",
        "title": "Hotelier's GST grouse and subsequent apology to Nirmala Sitharaman sparks row",
        "date/time": "\n                                    ",
        "author": "M.R. Venkatesh"
    },
    {
        "url": "https://www.telegraphindia.com/world/donald-trump-calls-laura-loomer-a-free-spirit-after-her-smell-like-curry-racist-remarks-against-kamala-harris/cid/2047930",
        "content": "Donald Trump has defended his ties with Laura Loomer, who has drawn fire from some of his Republican allies for embracing conspiracy theories and making racist comments, including against Kamala Harris. “Laura has been a supporter of mine. Just like a lot of people are supporters, and she’s been a supporter of mine. She speaks very positively of the campaign,\" Trump, the former president, said on Friday at a news conference in Southern California. He was responding to a question from a reporter about his allies expressing concern about his close relationship with Loomer in recent days. “I don’t control Laura. Laura — she’s a free spirit. Well, I don’t know. I mean, look, I can’t tell Laura what to do,” Trump said. “She is a strong person, she’s got strong opinions, and I don’t know what she said, but that’s not up to me,” he added. Several of Loomer's posts on social media this week came under fire, including one where she nodded to a conspiracy theory about the 9/11 attacks. \"23 years later, and there’s still a lot of unanswered questions,\" Loomer posted on Friday, alongside a video of Trump in 2001 questioning whether airplanes could cause explosions like the ones that happened at the Twin Towers on 9/11,\" Loomer wrote. Loomer, often seen as a right-wing conspiracy theorist, in another post on Sunday, said the \"White House will smell like curry & White House speeches will be facilitated via a call centre\" if Harris wins the November 5 presidential election. Harris, a Democrat, will take on Trump in the November election. NBC News asked Trump whether he’d been informed of Loomer’s conspiracy theories. “I don’t know that much about it. No, I don’t,” he said, adding, “I know she’s a big fan of the campaign, but I really don’t know.” Trump later sought to distance himself from Loomer’s statements, though without specifying which ones. In a Truth Social post, Trump said that Loomer \"doesn’t work for the Campaign. She’s a private citizen and longtime supporter. \" Even in that post, Trump defended Loomer and said: “Like the many millions of people who support me, she is tired of watching the Radical Left Marxists and Fascists violently attack and smear me.” Several Republicans denounced Loomer for her remarks. Republican Senator Thom Tillis said Loomer was a “crazy conspiracy theorist who regularly utters disgusting garbage intended to divide Republicans”. “The history of statements by Ms. Loomer are beyond disturbing,” Senator Lindsey Graham, also a Republican told The Washington Post on Thursday.",
        "title": "Donald Trump calls Laura Loomer a ‘free spirit’ after her racist remarks against Kamala Harris",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/business/government-scraps-minimum-export-price-thresholds-on-onion-basmati-rice/cid/2047839",
        "content": "The government on Friday scrapped the minimum price thresholds for onion and basmati rice to boost outbound shipments and enhance farmers' income. The decision to remove the Minimum Export Price on both onion and basmati rice comes ahead of assembly elections in Maharashtra and Haryana. Haryana along with Punjab is the major producer of basmati rice. According to a communication from the Department of Commerce, the USD 950 per tonne minimum export price on basmati rice has been removed. Commerce and Industry Minister Piyush Goyal said the move will help boost exports and increase farmers' income. \"It has been decided to remove current minimum export price of USD 950 MT for issuing Registration-cum-Allocation Certificates for export of Basmati Rice,\" the communication said. The APEDA has been requested to take immediate action to implement the decision and it will also closely monitor export contract for any non-realistic prices for basmati exports. In October 2023, the government has reduced the floor price for basmati rice exports to USD 950 per tonne from USD 1,200 per tonne amid concerns that higher prices were hurting outward shipments. The government on August 27, 2023 decided not to allow exports of basmati rice below USD 1,200 per tonne to restrict possible \"illegal\" shipment of white non-basmati rice in the garb of premium basmati rice. India's total exports of basmati rice stood USD 5.9 billion in 2023-24. During 2022-23 fiscal, basmati rice exports stood at USD 4.8 billion in terms of price, while in volume terms it was at 45.6 lakh tonnes. As per the Foreign Trade Policy, APEDA is mandated to register all contracts for the export of basmati rice and issue the registration-cum-allocation certificate for the export of basmati rice. The basmati crop is grown in kharif season. In another farmer-friendly decision ahead of assembly election in Maharashtra, the directorate general of foreign trade removed the MEP on onion with immediate effect. In May this year, the government lifted the ban on onion exports but had imposed a USD 550 per tonne as the minimum export price , which essentially meant farmers could not sell their produce overseas at lower than this rate. \"The Minimum Export Price condition on export of onions is removed with immediate effect and until further orders,\" the DGFT said. The decision to remove the MEP on onion has been taken despite high retail prices of this key kitchen item. According to the data compiled by the Department of Consumer Affairs, the All-India average price of onion on Friday is Rs 50.83 per kg, while the modal price is Rs 50 per kg. The maximum price of onion is Rs 83 per kg and the lowest is Rs 28 per kg. On September 5, the Centre began the first phase of retail sales of onion at a subsidised rate of Rs 35 per kg to provide relief to Delhi-NCR and Mumbai consumers from rising prices of the kitchen staple. NCCF and NAFED, which are maintaining a buffer stock of 4.7 lakh tonnes onion on behalf of the government, have started retail sale through their stores and mobile vans. Last week, Consumer Affairs Secretary Nidhi Khare noted that the outlook for onion availability and prices in coming months remains positive as the kharif sown area has increased sharply to 2.9 lakh hectares till last month against 1.94 lakh hectares in the year-ago period. Further, about 38 lakh tonnes of onion are reported to be still in storage with farmers and traders, she had said.",
        "title": "Government scraps minimum export price thresholds on onion, basmati rice",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/india/congress-terrorism-increased-in-jammu-and-kashmir-since-prime-minister-narendra-modi-sworn-in-for-third-term/cid/2047996",
        "content": "Congress on Saturday accused the Centre of failing to end terror attacks in Jammu and Kashmir and claimed that terrorism has returned stronger in union territory where it had been eliminated many years ago. Addressing a press conference at the party office here, the party's spokesperson Supriya Shrinate said there have been 25 terror attacks in Jammu and Kashmir in the 98 days since Prime Minister Narendra Modi was sworn in for his third term. \"Huge claims were made that after August 2019, peace will be established in Jammu and Kashmir. I will not talk about the time since 2014 or 2019, but it has been 98 days since Modi was sworn in. In the last 98 days, there have been 25 terror strikes in J-K in which 21 security personnel were martyred, while 28 others were injured,\" she said. Shrinate said 15 citizens of the union territory have also lost their lives in these terror attacks, while 47 people were injured. \"Who will answer for it? Jammu was peaceful, the insurgency had ended there, but now, we are again witnessing terror attacks in Jammu's Doda, Reasi, and other areas,\" she added. The Congress spokesperson paid tributes to the two soldiers who lost their lives in an encounter with terrorists in the Kishtwar district of Jammu on Friday. She alleged the prime minister has not been offering his tributes to the fallen soldiers since 2019. \"PM tweets on small issues, discovers new countries on the world map to travel to and wishes happy birthday to people, but since 2019, Modi has stopped sending tribute or sympathy messages. Our officers, and soldiers lost their lives, Jammu and Kashmir police personnel were killed, but Modi has not uttered a single word to offer tributes or sympathies after 2019,\" Shrinate alleged. \"Check his media and social media and see if he has even taken notice of one such attack. The least you can do is pay homage for the supreme sacrifices our force and police forces are making in J-K\" she added. Shrinate said Modi chose not to do that \"because you want to tell the world that everything is alright in J-K\". \"No, it is not alright because militancy that had completely evaporated and vanished in Jammu, is back with a vengeance and what are you doing ? This is your failure,\" she claimed.",
        "title": "Terrorism increased in Jammu and Kashmir since PM Narendra Modi sworn in for third term: Congress",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/business/centres-subsidised-onion-sale-brings-relief-prices-drop-in-major-cities/cid/2047981",
        "content": "The government's subsidised onion sale initiative, launched on September 5, has led to price drops in major cities within days, the consumer affairs ministry said on Saturday. In Delhi, retail onion price fell from Rs 60 to Rs 55 per kg, while Mumbai saw a decrease from Rs 61 to Rs 56 per kg. In Chennai, the retail price reduced from Rs 65 to Rs 58 per kg, the ministry said in a statement. The government initiated the sale of onions at a subsidised rate of Rs 35 per kg through mobile vans and outlets of NCCF and NAFED. The program, which began in Delhi and Mumbai, has since expanded to other major cities including Chennai, Kolkata, Patna, Ranchi, Bhubaneswar, and Guwahati. Responding to the growing demand, the government has decided to increase the quantity of subsidised onion and expand distribution channels to include e-commerce platforms, Kendriya Bhandar outlets, and Mother Dairy's SAFAL stores. The government has also initiated wholesale disposal of onion in major cities. It has already commenced in Delhi, Mumbai, and Chennai, with plans to extend to Hyderabad, Bengaluru and Kolkata and eventually all state capitals. A dual transportation strategy involving both road and rail networks is being implemented to improve logistics efficiency and reduce post-harvest losses. The Department of Consumer Affairs is working closely with state governments to ensure targeted supply based on demand and price trends. With a buffer stock of 4.7 lakh tonne of onions and increased kharif sowing area compared to the previous year, \"the government expects onion prices to remain under control in the coming months,\" the ministry said. The combination of enhanced retail and bulk sale strategies is anticipated to stabilize prices and ensure widespread availability of affordable onions, it added.",
        "title": "Centre's subsidised onion sale brings relief, prices drop in major cities",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/business/dock-systems-at-calcutta-haldia-report-8-04-per-cent-drop-in-cargo-handled-in-first-5-months/cid/2047869",
        "content": "The dock systems at Calcutta and Haldia reported an 8.04 per cent drop in cargo handling in the first five months of this fiscal, led by a sharp deceleration in coking coal movement as traders and importers diverted ships to deeper drafted ports in Odisha to save on cost. The decline at Syama Prasad Mookerjee Port, the only riverine major port in India, is noticeable as the cluster of twelve government-owned major ports together posted a 4.87 per cent increase in cargo handling in the same period. The only other port which recorded a drop was Goa’s Mormugao. A closer look at the cargo handled by Bengal’s ports reveals that Haldia Dock Complex recorded a 27 per cent drop in coking coal movement, while volume dropped by 87 per cent in Kolkata Dock System . Coking coal, used by steel mills in blast furnaces, is the most important cargo for SMP, Kolkata. In volume terms, SMPK handled 5.97 million tonnes of coking coal compared with 8.79 mt in April-August of FY24, a drop of 2.82 mt. Data sourced from BigMint shows India’s coking coal import has gone up by 6 per cent in the same period. Port officials said the spike in seaborne bulk cargo rates, led by the Red Sea crisis, is forcing importers to avoid anchorages like Sandheads and Sagar under SMPK. Compared with 13 cape vessels handled in April-August of FY24, only two baby cape vessels have been handled in the same period of this year. The fall in anchorage cargo traffic of coal has in turn affected the handling of this cargo by barges within the port and the Haldia floating jetty, amplifying the traffic loss. “Since we are a riverine port and drought is less, vessels with larger parcel size come to the deeper ports such as Paradip and Dhamra, and then to our anchorages. From there, cargo would come to Haldia in barges. Earlier this two-port call cost $3 per tonne, it has now gone up to $8 per tonne,” Rathendra Raman, chairman of SMPK, told The Telegraph. He, however, expressed confidence to turn the tide from October when fair weather allows big ships to come more often to the Sagar anchorage. “We are taking multiple steps to not only make up the drop, but post modest growth at the end of FY25,” Raman added. The port is pinning hopes on resumption of thermal coal movement along the eastern coast. Raman said he is in touch with power plants in south India, exhorting them to use Haldia to source thermal coal for their requirement. “I have also met the chairman of Coal India,” Raman said. In the past, CIL subsidiary Eastern Coalfield Ltd was a supplier of coal to Tamil Nadu power plants. Later, Mahanadi Coalfield of Odisha came up as the preferred supplier, and the coastal movement shifted to Paradip and Dhamra ports. Raman said APGENCO of Andhra Pradesh will start procuring coal from ECL later this month. Panamax ships will load about 30,000 tonnes of cargo from Haldia and then top up another 40,000 tonnes from Paradip. “Once people find confidence in this movement, more will follow,” the chairman said, adding NTPC is also considering using Haldia to take coal to the Vallur plant in Tamil Nadu. He expressed hope that NTPC will also source coal for its Bangladesh plant in future. While SMPK is a major port for bulk cargo movement, officials are also pinning hope on container traffic. The port has been able to forge two direct shipping routes from SMPK to Zabel Ali in Dubai and two ports in south China. As they are expected to shorten transit time, the port is hoping users will take advantage of this. “We are already seeing some of the Nepal traffic coming to SMPK from Visakhapatnam,” Raman noted.",
        "title": "Dock systems at Calcutta, Haldia report 8.04 per cent drop in cargo handled",
        "date/time": "\n                                    ",
        "author": "Sambit Saha"
    },
    {
        "url": "https://www.telegraphindia.com/india/haryana-bjp-kisan-morcha-president-sukhvinder-mandi-joins-congress/cid/2048022",
        "content": "Haryana BJP Kisan Morcha president Sukhvinder Mandi joined the Congress party on Saturday as the state moves closer to the October 5 Assembly polls. Mandi, a former MLA from the Badhra assembly segment, joined the Congress in the presence of party leader Bhupinder Singh Hooda and Haryana Congress chief Udai Bhan. Mandi was hoping to get a ticket from Badhra but the BJP denied him. Mandi was welcomed into the Congress fold by Hooda and Bhan, a party statement said. Earlier on Friday, Haryana BJP leader and former minister Karan Dev Kamboj joined the Congress. He recently stepped down as the BJP state unit's OBC Morcha chief after being denied ticket to contest the next month's assembly polls. Kamboj was eyeing a ticket either from Radaur or Indri seats. Kamboj had last week claimed that the BJP rewarded many new entrants and turncoats with tickets while ignoring those who have been working for years. Polling for the 90 assembly seats in Haryana will be held on October 5 and the votes will be counted on October 8.",
        "title": "Haryana BJP Kisan Morcha president Sukhvinder Mandi joins Congress",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/world/donald-trump-rules-out-another-presidential-debate-against-kamala-harris/cid/2047946",
        "content": "Donald Trump on Thursday ruled out another presidential debate against Kamala Harris as her campaign announced a massive fundraising haul in the hours after the two candidates met on stage. Trump, the Republican nominee, posted on Truth Social that “THERE WILL BE NO THIRD DEBATE!” following Tuesday's debate against Harris and his June debate against President Joe Biden. In rejecting another debate, the former President suggested that a “prizefighter\" who loses a bout is always the one to call for a rematch. A day earlier, he had said, “I just don't know,” to the question of whether he would meet Harris for another debate. Some Republicans, including the No. 2 Republican Senator John Thune, have urged Trump to debate against Harris again. While he could still change his mind, his announcement means that Tuesday's meeting will likely be the only time voters will see the two debate each other before the November election. More than 67 million people watched the Trump-Harris debate. Harris, the Democratic nominee, said during a rally in North Carolina on Thursday she believes that she and the former President “owe it to voters” to debate again. Meanwhile, her campaign revealed that it had raised $47 million from nearly 600,000 donors in the 24 hours after her Tuesday debate against Trump.",
        "title": "Donald Trump rules out another presidential debate against Kamala Harris",
        "date/time": "\n                                    ",
        "author": " AP/PTI"
    },
    {
        "url": "https://www.telegraphindia.com/world/china-raises-retirement-age-for-the-first-time-since-the-1950s/cid/2047843",
        "content": "The Chinese government on Friday approved a plan to raise the country’s statutory retirement age, currently among the lowest in the world, in a long-awaited but broadly unpopular effort to address the challenge of its rapidly ageing population. This is the first time China has raised its retirement age since the 1950s. It will be phased in gradually, starting on January 1, 2025. The retirement age for men, previously 60, will increase in increments of several months before finally reaching 63 by 2040. The retirement age for women in white-collar jobs, previously 55, will rise to 58. Women in blue-collar jobs, who previously could retire at 50, will have to work until 55. The decision would “maintain the momentum and vitality of economic and social development”, Wang Xiaoping, China’s minister of human resources and social security, said at a news conference. Policymakers and experts have for decades been calling for a change to the retirement age, noting that the previous rules dated from a time when life expectancy in China was much shorter, and fertility rates higher. They warned that maintaining the status quo would severely strain the country’s workforce and pension funds, with large numbers of older Chinese retiring but fewer young people replacing them. China’s working-age population has been falling since 2012, according to official statistics, with an average annual decrease of more than 3 million people. Last year, China had 297 million people over 60 years old, or about 21 per cent of its population. But the proposal faced broad opposition, from older workers as well as from younger ones, who worried that an expanded workforce would mean even tougher competition for jobs. China also lacks a strong social safety net, and age discrimination by employers is common, leaving many blue-collar workers to worry that they would be left without work but unable to draw on pensions. In a sign of how sensitive the issue was, the government has promised before to raise the retirement age, only to backpedal in the face of public outcry. In some ways, now is a particularly bad time for the government to follow through. China’s economy is still struggling to recover from the coronavirus pandemic. Youth unemployment remains high. Local governments, which administer pensions and other government benefits, have already cut back on payouts in recent years — at times setting off protests. But the government most likely realised it had no more time to delay, said Alfred Wu, a professor of public policy at the National University of Singapore, who noted that he was surprised by the speed with which the government had ultimately made its move. “I think China has lost a lot of golden opportunities” to make the decision more palatable to the public, Professor Wu said. “Maybe another way is just to release it. Let people accept it, and they move forward.” Acceptance did not seem to be the initial public reaction. On Chinese social media, where several hashtags about the decision led the trending topics, users complained that they would have to wait even longer to receive benefits that they decried as too low anyway. Others worried that the pension funds would be even more depleted by the time they finally got to retire. The government-backed Chinese Academy of Social Sciences has previously projected that China’s pension funds would run out of money by 2035. The decision announced on Friday will also lengthen the time people must pay into pension funds before becoming eligible to receive a monthly pension, to 20 years from 15. In an apparent effort to ease people’s concerns, the plan included what it described as a flexible option for people to retire up to three years earlier — that is, at the current retirement age — if they had fulfilled the 20-year contribution requirement. “The decision reflects respect for individual wishes. It does not force everyone to reach the new statutory retirement age,” Xinhua, the official news agency, quoted a professor at Zhejiang University, Jin Weigang, as saying. The raising of the retirement age by three years for most workers was less than the five years many had expected. The government also promised to improve the system for paid annual leave, fight age discrimination and offer earlier retirement for workers in physically demanding jobs. It said it would work to establish universal child care — another step that could be crucial for ensuring that the delayed retirement age does not inadvertently worsen the population ageing problem, by discouraging people from having children. Currently, many retirees take primary responsibility for raising their grandchildren. Besides those reassurances, the government also had another tool to ensure that public backlash did not spiral out of control: censorship.",
        "title": "China raises retirement age for the first time since the 1950s",
        "date/time": "\n                                    ",
        "author": "Vivian Wang"
    },
    {
        "url": "https://www.telegraphindia.com/world/j-k-rowling-celebrates-resignation-of-indian-origin-transgender-as-head-of-rape-crisis-centre/cid/2047823",
        "content": "A Scotland-based Indian-origin transgender woman on Friday resigned as the head of a rape crisis centre at Edinburg after a review found that the unit set up to support victims of sexual assault had failed to protect women-only spaces. Mridul Wadhwa stepped down as the chief executive officer of the Edinburgh Rape Crisis Centre after an independent report, commissioned by the Rape Crisis Scotland , found a “failure to protect women-only spaces” as the CEO “did not understand the limits on her role's authority” and therefore “failed to set professional standards of behaviour.” The review was commissioned in May in response to an Employment Tribunal case by a former member of staff of the ERCC charity over concerns around its systems and functioning. “Mridul Wadhwa and the Board have decided that the time is right for a change of leadership at the ERCC,” read a statement from the Board of Directors. “Mridul has stood down from her role as CEO of ERCC. Recruitment of a new CEO will happen in due course. We are committed to delivering excellence while taking on board the recommendations from the independent review to ensure we place survivors’ voices at the heart of our strategy,” it noted. In an earlier letter, the Board apologised and admitted it “got things wrong.” The independent review, by legal specialist Vicky Ling, flagged “a strategy which did not put survivors first; a failure to protect women-only spaces; poor review of systems, procedures and document control; and a period of weak governance.” Among its recommendations, the report notes: “In the light of the debate between those holding gender identity/affirmative and gender critical beliefs and the developing context of litigation, ERCC must take advice from RCS concerning the definition of 'woman' within its service. Women-only spaces and times must be protected and clearly publicised.” In its statement, RCS said that it was extremely concerned that for many months ERCC did not provide dedicated women-only spaces, as required by the National Service Standards. The resignation of Wadhwa was welcomed by Harry Potter author J K Rowling, a very vocal campaigner for women-only spaces. “Mridul Wadhwa is gone from Edinburgh Rape Crisis. He should have been fired the moment he said that survivors who wanted a female-only space were bigots who should 'reframe their trauma'. Those who appointed, enabled and protected Wadhwa remain in post,” she posted on X. Meanwhile, Member of Scottish Parliament Sue Webber stressed that by definition, rape crisis centres should offer a safe haven for traumatised women. “Yet, instead of focussing on providing that, ERCC has been more concerned with imposing its own militant gender ideology on both staff and distressed victims,” she added.",
        "title": "J.K. Rowling celebrates resignation of Indian-origin trans as head of rape crisis centre",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/business/rupee-rises-6-paise-to-close-at-83-90-against-us-dollar/cid/2047787",
        "content": "The rupee witnessed range-bound trade and settled for the day higher by 6 paise at 83.90 against the US dollar on Friday supported by weakening of the American currency in the overseas market and significant foreign fund inflows. Forex traders said rupee trade was range-bound as the Reserve Bank of India is maintaining a firm grip on the domestic currency. At the interbank foreign exchange market, the local unit opened at 83.92 and witnessed an intraday high of 83.85 and a low of 83.98 against the American currency. The domestic unit finally settled for the day at 83.90 , higher by 6 paise over its previous close. On Thursday, the local unit settled 3 paise higher at 83.96 against the US dollar. Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was down 0.46 per cent to 100.90 points. Brent crude, the international benchmark, gained 1.03 per cent to USD 72.71 per barrel in futures trade. In the domestic equity market, the 30-share BSE Sensex declined 71.77 points, or 0.09 per cent, to close at 82,890.94 points, while the Nifty fell 32.40 points, or 0.13 per cent, to 25,356.50 points. Foreign Institutional Investors were net buyers in the capital markets on Thursday, as they purchased shares worth Rs 7,695.00 crore, according to exchange data. On the domestic macroeconomic front, retail inflation in August inched up to 3.65 per cent, though vegetables and pulses witnessed price rise in double digits, according to official data released on Thursday. India's industrial production output decelerated to 4.8 per cent year-on-year in July 2024, mainly due to poor performance of the manufacturing and mining sectors, as per official data released on Thursday.",
        "title": "Rupee rises 6 paise to close at 83.90 against US dollar",
        "date/time": "\n                                    ",
        "author": "PTI"
    },
    {
        "url": "https://www.telegraphindia.com/business/ford-chennai-manufacturing-plant-to-be-utilised-for-exports/cid/2047774",
        "content": "American automaker Ford on Friday said it is preparing to utilise its Chennai manufacturing plant to roll out vehicles for exports and has intimated the same to the Tamil Nadu government. The company which in 2021 had said that it would stop manufacturing vehicles in India, has submitted a Letter of Intent to the Tamil Nadu government, confirming its intention to utilise the Chennai plant for manufacturing for exports. The announcement follows a meeting between Ford leadership and Tamil Nadu Chief Minister MK Stalin as part of his visit to the United States, Ford said in a statement. \"This step aims to underscore our ongoing commitment to India as we intend to leverage the manufacturing expertise available in Tamil Nadu to serve new global markets,\" Ford International Markets Group President Kay Hart said. Ford said the strategic move will see the facility repurposed to focus on manufacturing for export to global markets, as part of the company's ambitious 'Ford+ growth plan'. It, however, said further information about the type of manufacturing and other details will be disclosed in due course. Ford said its latest announcement reaffirms the company's commitment to India as a critical market for its global operations. The company currently employs 12,000 individuals in Global Business Operations in Tamil Nadu, a number expected to grow by 2,500 to 3,000 jobs within the next three years, it added. \"Combined with the engine manufacturing operations in Sanand, India represents Ford's second-largest salaried workforce worldwide,\" the company said. In September 2021, after nearly three decades of struggling to make a mark in India, Ford Motor Co had announced that it would stop vehicle production at its two plants in the country and will sell only imported vehicles going ahead, as part of a restructuring exercise. While the company sold its vehicle manufacturing plant at Sanand in Gujarat to Tata Motors, it could not wind down its vehicle and engine manufacturing in Chennai by the targeted timeline of second quarter of 2022.",
        "title": "Ford chennai manufacturing plant to reopen to roll out vehicles for exports",
        "date/time": "\n                                    ",
        "author": "PTI"
    }
]